{
  "document_name": "Inamdar, Amogh (001590808).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Inamdar, Amogh; DOB: 06/24/1998; ID: 001590808\nAmogh Shreedhar Inamdar\nlinkedin.com/in/amoghinamdar amogh.inamdar@columbia.edu github.com/AmoghSInamdar\nEDUCATION\nColumbia University New York, NY\nM.S. in Computer Science - Machine Learning track; GPA: 4.0/4.0 May 2022\nRamaiah Institute of Technology Bengaluru, IND\nB.E. in Computer Science and Engineering ; GPA: 9.76/10 Aug 2020\nACADEMIC RESEARCH\nColumbia University New York, NY\nGraduate Researcher; Advisor: Dr. Richard Zemel Feb 2022 - Present\nContrastive Learning of Disentangled Representations\n● Extended the SimCLR algorithm to novel supervised and unsupervised contrastive attribute learning paradigms.\n● Visualized the effects of data supervision on learned image representation spaces with PCA and t-SNE.\n● Developing methods to evaluate the performance of large pretrained models on attribute learning tasks.\nGraduate Researcher and Developer; Advisor: Dr. Nakul Verma Oct 2021 - Jun 2022\nLogicLearner: a tool for learning propositional logic ( logiclearner.ctl.columbia.edu)\n● Developed a grammar for predicate logic with the Lark parser-generator in Python.\n● Designed a novel frontier-generation algorithm by implementing logic rules as parsed-expression transforms.\n● Implemented A* search and optimized heuristics with a genetic algorithm to solve propositional logic proofs.\n● Embedded logic statements as vectors using a Siamese GRU network optimizing for a dot-product A* heuristic;\nachieved strong problem-solving performance.\nGraduate Researcher; Advisor: Dr. Ansaf Salleb-Aouissi Jun 2021 - Sep 2021\nCategorization of post-operative Proximal Junctional Kyphosis (PJK) in spine deformity patients\n● Collaborated with medical staff bi-weekly to design and standardize a proprietary dataset of spinal deformity patients\nto study the post-operative complications of spinal surgery.\n● Leveraged ensemble learning to analyze data, characterize post-operative PJK, and take steps towards predicting\nrevision surgery in a highly imbalanced dataset while emphasizing algorithmic explainability.\nRamaiah Institute of Technology Bengaluru, IND\nUndergraduate Researcher; Advisor: Dr. Seema S Jan 2020 - Jul 2020\nEfficient Handwriting Generation of English Text with Conditional GANs\n● Combined image stitching heuristics with lightweight conditional GANs to generate handwritten English text from\ntyped input efficiently (>40 chars/second) in Tensorflow.\n● Built a web application to generate handwriting from input text using HTML5/CSS and Flask in Python.\nUndergraduate Researcher; Advisor: Dr. Sangeetha J Jan 2019 - Dec 2019\nTime-Dynamic NEAT: a Validation-based Heuristic for Neuroevolution on Large Datasets\n● Formulated TIDY NEAT, a heuristic for exponentially scaling data input to NEAT evolutionary algorithm.\n● Demonstrated a 3.3x faster convergence to equal accuracy as vanilla NEAT on a cardiovascular disease classification\ntask and supported time complexity results with qualitative analysis.\nAmogh Inamdar - CV 1\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Inamdar, Amogh; DOB: 06/24/1998; ID: 001590808\nThe Indian Institute of Science Bengaluru, IND\nAcademies’ Summer Research Fellow at IISc; Advisor: Dr. Balaji Jayaprakash Jun 2018 – Aug 2018\nMonte Carlo Simulation of Problem-Solving Behavior in Rats\n● Modeled learning via memory consolidation in rats by simulating brain grid cells and a Morris Water Maze\nexperiment with Monte Carlo methods and reinforcement learning in C++.\n● Developed a GUI to run trials, visualize simulated rat paths, and generate and store results and heatmaps, using the\nand Java Swing framework.\nTEACHING EXPERIENCE\nDepartment of Computer Science, Columbia University New York, NY\nCourse Assistant - COMS 4771 Machine Learning Feb 2022 - Jun 2022\n● Instructor: Dr. Nakul Verma ; As described below.\nCourse Assistant - COMS 4771 Machine Learning Jun 2021 – Sep 2021\n● Instructor: Dr. Nakul Verma ; Enrollment: 70+ undergraduate and graduate Columbia students.\n● Held office hours to solve student doubts, graded assignments, and assisted with course logistics.\nCourse Assistant - Machine Learning, Columbia-edX AI Micromasters (MOOC) Feb 2021 – May 2021\n● Instructor: Dr. John Paisley ; Enrollment: 322 online learners taking graduate-level coursework.\n● Answered doubts on course material, exams, and logistics on a student forum for the ML course.\nRamaiah Institute of Technology Bengaluru, IND\nSpecial Lecture – Data Mining Dec 2019\n● Instructor: Prof. Sowmya BJ; Enrollment: 60+ undergraduate juniors.\n● Delivered a lecture on data mining practices and dataset pre-processing for deep learning.\nPROFESSIONAL EXPERIENCE\nSalesforce San Francisco, CA\nAMTS Software Engineer – Salesforce Genie Jun 2022 - Present\n● Building Salesforce Genie, a hyperscale data platform providing a unified customer data interface for real-time CRM.\n● Developing tools to provision and manage millions of dollars of infrastructure on AWS EMR and EKS platforms.\n● Engineering resilient infrastructure enabling data warehousing and real-time streaming analytics at massive scale.\nSoftware Engineer Intern – ML Services team, Einstein Platform Jun 2021 – Sep 2021\n● Designed and developed a Python SDK for real-time scoring of customer service requests with machine learning.\n● Enabled experimentation and debugging in a production-like environment across cloud tenants and ML models.\n● Reduced effort for model experimentation from several steps taking hours to a single step taking a few minutes.\nAI Model Share Initiative, Columbia University New York, NY\nDeveloper (Part-time) Mar 2021 – Jun 2021\n● Created an API to enable the Model Share library to deploy customized pre-trained ML models as AWS Lambda\nendpoints reachable by AWS API Gateway.\n● Prototyped AWS CloudFormation integration to enable modular deployments of AI Model Share infrastructure.\nAmogh Inamdar - CV 2\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Inamdar, Amogh; DOB: 06/24/1998; ID: 001590808\nCadence Design Systems Bengaluru, IND\nSoftware Engineer Intern – R&D team, Pegasus Verification System Jul 2020 – Sep 2020\n● Devised a C++ engine to improve Pegasus Design Rule Check performance and integrated it into Pegasus flow.\n● Enhanced automated test generation for microchip density and fill characteristics in Python\n● Created complex test cases with KLayout editor and evaluated and debugged Pegasus in Linux.\nSamsung Research Institute Bangalore Bengaluru, IND\nResearch Intern - PRISM Program for Undergraduate Research in AI Apr 2019 – Nov 2019\n● Led a student research team in On-Device AI to create an SQLite to Apache Lucene Query Parser with Antlr4 in Java.\n● Presented results to an open floor of 300+ Samsung engineers at a showcase for the top 20% of all intern projects.\n● Received a Certificate of Excellence for exceeding KPIs for processing time and memory utilization by 5-10x.\nHONORS and AWARDS\nRanger Certification - Salesforce Trailhead learning platform Sep 2022\nBest Student Award - Computer Science, Ramaiah Institute of Technology Aug 2020\nCertificate of Excellence - Samsung PRISM Undergraduate Research Program Nov 2019\nSummer Research Fellowship in 2018, Indian Academies of Science Jun 2018\nTECHNICAL SKILLS\nLanguages Python, Java, C/C++, R, SQL, JavaScript, HTML5/CSS, UNIX shell scripting\nTools AWS, K8s, ML tools (PyTorch etc.), Parser-generators, MongoDB, Apache Lucene, Flask\nAmogh Inamdar - CV 3\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}