{
  "document_name": "Zhang, Yipeng (032288797).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Zhang, Yipeng; DOB: 02/03/2000; ID: 032288797\nYipeng Zhang\nMailing Address: 43-15 52nd St, Apt 4G, Woodside, NY, 11377\nyz4290@columbia.edu +1 6462207846\nEDUCATION\nSchool of Engineering and Applied Sciences, University at Buffalo (SUNY)\nB.S. in Chemical Engineering (Cum Laude)\nFu Foundation School of Engineering and Applied Science, Columbia University\nM.S. in Chemical Engineering\nRESEARCH EXPERIENCE\nInstitute of Chemistry Chinese Academy of Sciences, Advisor: Dr. Kun Zheng\nMay 2021 – October 2021\n● Participated in the project aims to improve the Interfacial thermal conductance between filler\nand polymer matrix using surface treatments.\n● Participated in the study of boron nitride nanosheet polymer composite with high out-of-plane\nthermal conductivity.\n● Co-authored an article published in the Journal of Physics: Conference Series.\nChemical Engineering, Columbia University, Advisor: Prof. Sanat K. Kumar\nSeptember 2022 – Present\n● Synthesized polymer grafted silica particles via atom transfer radical polymerization (ATRP)\nfor gas permeation membranes and polymer-particle composite characteristic studies (DSC,\nXPCS, TEM).\n● Synthesized quaternized poly (styrene-co-vinyl benzyl chloride) for anion exchange\nmembrane.\n● Reviewed literature and studied the kinetics of ATRP polymerization.\n● Get trained on diverse techniques to characterize polymer and nanoparticle materials, including\nTGA, GPC, DLS, and SAXS. Analyzed data obtained from these instruments via Python and\nMATLAB.\nPUBLICATION\nWei Yang，Yun Chen，Yipeng Zhang，YongSheng Fu，Kun Zheng，Kun Wang，YongMei Ma,\n“Thermal conductance of epoxy/alumina interfaces”, presented on 2021 International Conference on\nAdvanced Materials and Mechatronics, Kunming·China, publish on Journal of Physics: Conference\nSeries (ISSN: 1742-6588)\nSTUDENT GROUP EXPERIENCE\nColumbia Chinese Orchestra (CCO), Columbia University\nMay 2023 – Present\nSuona (a traditional Chinese instrument) performer.\nSKILLS\nLaboratory: Thermogravimetric analyzer (TGA), gel permeation chromatography (GPC), dynamic\nlight scattering (DLS), small angle x-ray scattering (SAXS), UV-Vis, and glovebox.\nProgramming and software: MATLAB, Python, Polymath, UniSim Design, Microsoft Office.\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}