{
  "document_name": "Luo, Yuhong (038797260).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Yuhong Luo Luo, Yuhong; DOB: 10/31/1996; ID: 038797260\n# jamesluoyh@gmail.com (cid:239) linkedin.com/in/yuhong-luo/ § github.com/JamesLuoyh\nEducation\nUniversity of Massachusetts Amherst, MA, USA\nM.S. in Computer Science, 3.96 GPA September 2022 - December 2023\nUniversity of Washington Seattle, WA, USA\nB.S. double major in Computer Science and ACMS, 3.82 GPA September 2016 - March 2019\nPublication\n• Yuhong Luo, Austin Hoag and Philip S. Thomas. Learning Fair Representations with High-Confidence Guarantees.\nIn Submission. arXiv preprint arXiv:2310.15358, 2023. [pdf]\n• Yuhong Luo and Pan Li. Neighborhood-aware Scalable Temporal Network Representation Learning.\nIn Learning on Graphs, 2022. Oral (4.6%), Best Paper Award. [pdf]\nTalk\n• Invited to present my work on Temporal Graph Learning at Stanford (in person), and at the Temporal Graph\nReading Group (online) hosted jointly by McGill University, Mila, and University of Mannheim. [¯ Recording ]\nExperience\nUMass Amherst, MA, USA\nGraduate Researcher with Prof. Philip Thomas on Fair Representation Learning (repo) February 2023 - September 2023\n• Created a framework that offers high-confidence fairness guarantees for representation learning (paper submitted).\nGraduate Researcher with Prof. Hui Guan on Personalized Federated Learning (repo) September 2022 - December 2022\n• Designed and implemented an algorithm for improving personalization in federated learning.\nPurdue & Georgia Tech Remote\nPartime Research Intern with Prof. Pan Li on Temporal Graph Learning (repo) May 2021 - August 2022\n• Created a temporal graph neural network that improves SOTA expressiveness and efficiency (paper published).\nAirbnb San Francisco, CA, USA\nSoftware Engineer on Marketing Technology July 2019 - September 2022\n• Built personalized marketing content recommendation models.\n• Designed and implemented marketing content building and campaign publishing tools.\n• Designed and implemented coupon management and issuance platform.\nUW Seattle, WA, USA\nUndergraduate Researcher with Prof. Jan Buys on Natural Language Processing (repo) January 2019 - March 2019\n• Designed and implemented a graph learning algorithm to incorporate semantic graphs of sentences as input to LSTM.\nTeaching Assistant with Prof. Martin Tompa on Foundations of Computing II September 2018 - March 2019\n• Held teaching sessions on topics including probability, statistics, randomized algorithms, introductory ML.\nMeta Seattle, WA, USA\nSoftware Engineer Intern July 2018 - September 2018\n• Designed and implemented crawler for ads landing pages and algorithm for ads detection on landing pages.\nYahoo San Francisco, CA, USA\nSoftware Engineer Intern July 2017 - September 2017\n• Designed and implemented web services to power Sports App game alerts.\nTechnical Skills\nLanguages: Java, Python, C++, C, Ruby, SQL, Kotlin, php, JavaScript.\nTechnologies: Deep Learning, NLP, Vision, Statistics, Graphical models, Reinforcement Learning.\nFrameworks: PyTorch, TensorFlow, React, Spark.\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}