{
  "document_name": "Wei, Haochen (085541001).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Wei, Haochen; DOB: 04/19/1999; ID: 085541001\nHaochen Wei\n2001 W Cold Spring Ln, Baltimore, MD 21209 | hwei15@jhu.edu | (518) 256 3774\nEducation:\nJohns Hopkins University, Baltimore, Maryland Sep 2021 - May 2023\nMaster of Science and Engineering in Robotics, GPA 3.80/4.00\nRensselaer Polytechnic Institute, Troy, NY Sep 2017 - May 2021\nBachelor of Science in Mechanical Engineering, GPA 3.73/4.00\nResearch Experience:\nSensing, Manipulation, and Real-Time Systems (SMARTS) Lab, Johns Hopkins University Feb 2022 - Now\nResearch Assistant, Advisor: Prof. Peter, Kazanzides\nProject 1:\n⚫ Building an abdominal phantom with instrument tracking for laparoscopic training.\n⚫ Dock the abdominal phantom with the Asynchronous Multi-Body Framework (AMBF) and visualize both the handheld instruments and dVRK\nconsole side instruments together within the AMBF, facilitating co-training with the MTM side surgeon.\n⚫ Conduct a user study to demonstrate the effectiveness of augmented assistance in first assistant training. The results of this study were\npresented at the 2023 IEEE International Symposium on Medical Robotics (ISMR).\nProject 2:\n⚫ Collaborated with Dr. Chen to utilize gaze tracking devices for real-time point-of-interest visualization during the training process.\nProject 3:\n⚫ Collaborated with Dr. Green to design and develop an augmented reality (AR) based platform for acute vertigo tele-assessment, automating the\nHead Impulse test, Nystagmus test, and Test of Skew (HINTS).\n⚫ This project is currently under review for IEEE Virtual Reality 2024 (IEEE VR 2024).\nLaboratory of Biomechanical and Image Guided Surgical Systems, Johns Hopkins University Sep 2022 - May 2023\nResearch Assistant, Advisor: Prof. Alejandro Martin-Gomez\n⚫ Designed an augmented reality (AR) interaction method for path planning and distance measurement within 3D Slicer.\n⚫ Utilized HoloLens 2 to create a label map, transmitted it to a desktop, and visualized it using the desktop version of 3D Slicer software.\nMechanical Aerospace and Nuclear Engineering Department, Rensselaer Polytechnic Institute Jan 2020 - May 2020\nResearch Assistant, Advisor: Assistant Prof. Mamadou Diagne\n⚫ Participated in the project to establish a math model of Sedimentation in the river.\n⚫ Designed a CAD model of a gate to control the fluid rate of a small-scale river model.\nMechanical Aerospace and Nuclear Engineering Department, Rensselaer Polytechnic Institute Aug 2020 - Dec 2020\nResearch Assistant, Advisor: Prof. Theo Borca-Tasciuc\n⚫ Assist to build a prototype of energy saving building.\n⚫ Analyzed the thermal efficiency of existing design by using NX Flow.\n⚫ Created a simple tutorial for how to use the NX Flow.\nPublications:\n⚫ Wei, H., Chen, C., & Kazanzides, P. (2023). An abdominal phantom with instrument tracking for laparoscopic training. In 2023 IEEE\nInternational Symposium on Medical Robotics (ISMR).\n⚫ Wei, H., Bolsey, J., Kuwera, E., Kazanzides, P., & Green,K. (2023). TeleAutoHINTS: A Virtual or Augmented Reality (VR/AR) System for\nAutomated Tele-Neurologic Evaluation of Acute Vertigo. In 2024 IEEE Virtual Reality (IEEE VR).(Under Review)\nWork Experience:\nBeijing Automotive Industry Holding Co., Ltd. Beijing, China Sep 2019 - Dec 2019\nIntern of Powertrain Calibration\n⚫ Assisted in the powertrain calibration. Focused on transmission control unit calibration.\n⚫ Analyzed drivability based on IMU data.\n⚫ Preliminary research on engine emission estimation model.\nSkills:\n⚫ Programming Language: Python, MATLAB, C++, C#\n⚫ OS, Program & Library: Linux, OpenCV, Unity, ROS, MRTK, PyTorch, Git, LaTeX, UGNX, SolidWorks, ZeroMQ, 3DSlicer, Blender\n⚫ Language: Mandarin (native speaker), English (fluently)\nHonors:\n⚫ Magna Cum Laude\n⚫ Dean’s Honor List on Fall 2018; Spring 2019; Summer 2019; Spring 2020\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}