{
  "document_name": "Jaikumar, Shreyas (125307276).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Jaikumar, Shreyas; DOB: 12/08/1995; ID: 125307276\nSHREYAS JAIKUMAR\n2/8 Manonmani Ammal St, Kilpauk, Chennai-600010 | Mobile: +91 9840912895 | Email: sjaikum1@stevens.edu\nEDUCATION\n2018 - 2020 Stevens Institute of Technology, Hoboken, NJ\nMaster of Science, Financial Engineering, GPA 3.6 / 4.0\n2013 – 2017 SRM Institute of Science and Technology, Chennai, INDIA\nBachelor of Technology, Electrical and Electronics Engineering, GPA 8.5 / 10.0\nWORK EXPERIENCE\nOct ‘20 – July ‘23 Tata Consultancy Services Limited, North America\nAnalyst – Data Services\n• Assisted Priceline in design, development, and implementation of efficient\ninformation systems in support of core enterprise functions.\n• Experienced working with Python and SQL to implement data extraction,\ntransformation, curation and loading (ETCL) processes.\n• Utilized Spark for leveraging distributed computing frameworks for large-\nscale data processing and analysis.\n• Familiarized with Google Cloud Platform thereby utilizing its services for\nscalable and efficient data processing.\n• Assisted JetBlue’s data science team with Exploratory and Explanatory data\nanalysis of the EMS pricing module to identify pricing opportunities, demand,\nbooking behavior and potential outliers.\n• Developed robust unit tests using assertions and wrote test cases to check\nthe quality, reliability, functionality and performance of the respective codes\nand queries.\n• Leveraged Tableau and Spotfire by creating compelling visualizations that\nhelped in driving actionable insights.\nJul ‘19 – Aug ‘19 JetBlue Airways Corporation, Long Island City, NY\nJET Intern, IT Project Management Office\n• Analyzed the 1,3 and 5-year forecast reports based on projected growth, cash\ninflows and outflows pertaining to the various IT departments.\n• Assisted with the ongoing development of the Project Task Management tool .\nOct ‘17 – Feb ‘18 Atyant Capital, Chennai, INDIA\nFinancial Analyst (Intern)\n• Performed qualitative analysis and equity research to help improve the firm’s\nclient portfolio performance.\nAug ‘17 – Sep ‘17 ithought Financial Consulting LLP, Chennai, INDIA\nSummer Financial Analyst\n• Formulated individual financial plans for the firm’s high net-worth clients.\nSKILLS\nMS Office Suite, C++, Python, R, MATLAB, SQL, Spark, GCP, Tableau, Spotfire & Bloomberg Certification\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}