{
  "document_name": "Wang, Shao-Ju (128093427).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nShao-Ju Wang\n1400 Martin St., State College, PA 16803 | (814) 915-1354 | shaojuwang1216@gmail.com\nEducation\nThe Pennsylvania State University, University Park, PA, USA\n Bachelor of Science in Electrical Engineering 2019 - 2023\n Bachelor of Science in Computer Science 2019 - 2023\nMinor: Computer Engineering\nCumulative GPA: 3.66\nRe search Experience\nResearch Assistant: Bio-Motion Systems Lab Aug 2022 – May 2023\n Reconstructed and enhanced the 3D model of fruit flies from stereo images using MATLAB\n Analyzed wing motion before and after wing damage to discover natural strategies for stabilizing\ndamaged aerodynamic systems.\n Improved and optimize code for faster processing and user-friendliness with the parallelized\nworkload.\nRelevant Project Experience\nOn-going Projects\nNordic Semiconductor Hackathon Jul 2023 – Present\n Create a device that monitors farmland and a web server that processes the sensor data to predict\nfuture growth and potential improvement.\n Handle the robot and sensors.\n Expect to finish prototyping by October.\nObject Detection Device for Micromobility Jun 2023 – Present\n Collaborate with Professor Kyusun Choi to port the OneM2M hackathon award-winning project to\nusing Android phones.\n Re-purpose used phones and pack more robust features into smaller casings than the previous version.\n Test software-based and hardware-based hybrid object distance detection mechanisms.\nAutomatic Image Analysis Algorithm for Metal Deposition May 2023 – Present\n Use OpenCV on Python to detect the dimensions of a cross-section view of metal deposition under\ndifferent power and velocity.\n Smooth out noise on the deposition, including the bumps on the edges.\nUSB Programmable IO Jul 2023 – Present\n Integrate FPGA and GUI to enable computers to act as digital writers and readers.\n Design a GUI that allows users to program manually or have the ability to import packages such as\nHDMI protocol.\nUSB PD to ATX converter Aug 2023 – Present\n Design a device that converts USB PD protocol via type-c to 24 pin + 8 pin ATX protocol for desktop\nmotherboards\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\n Use cascading buck converters to step down voltages to various voltages required by the ATX\nprotocol\nAccomplished Projects\nOneM2M International Hackathon – Team ScootSafe Apr 2023 – Jun 2023\n Design a device with pedestrian detection, automatic horn, and dash functionality to be installed on\nmicromibility.\n Responsible for the alarm system and electrical wiring.\n Awarded with Best Potential Award.\nEngineering for Sustainable World Project - Automatic Plant Watering system Jan 2023 - May 2023\n Build a watering and cooling system based on Arduino with soil moisture sensors, temperature\nsensors, and others for an automated hydroponic system.\n Collect data for algorithm improvement.\n Implement sustainable water and power source in the phase 2 design.\nSlab Leveling Jig Automation Proof of Concept- Hardware/Software Designer Jan 2023 – May 2023\nEE 403 Capstone Design for Seneca Woodworking\n Develop a user-friendly scalable human-machine interface.\n Integrate microcontroller, stepper motors, and AC power system to control router.\n Use Arduino with C++ to control the speed and precise 2D motion of the router.\nExtracurricular and Service Experience\nEta Kappa Nu (Epsilon Chapter) Treasurer Apr 2022 – May 2023\n Assist members with Electrical and Computer-course related problems by organizing tutoring lessons\nand connecting students, professors, and other sponsors in the field.\n Manage cash flow and assist other officers in club operations and events.\nEta Kappa Nu (Epsilon Chapter) Tutor Nov 2021 – May 2023\n Tutor Electrical Engineering and Computer Science undergraduate students for 3 hours weekly.\n Provide consulting services to new students to help them choose classes and academic planning.\nHub Aquarium Volunteer Feb 2022 – Present\n Help supervisor to fix system faults, such as pump and inflow system.\n Explain the organism and equipment to the visitors.\n Lead and train new volunteers to maintain a clean aquarium.\n Monitor and feed seawater fish in the Hub Aquarium and conduct seawater quality testing.\nStudent Farm Club – Hydroponics Team Sep 2021 – May 2023\n Experimented with agricultural practices and promoted healthy eating.\n Planned for more reliable all-year crop production in the Greenhouse.\nHonors and Awards\nBest Potential Award: 2023 OneM2M International Hackathon – Team ScootSafe 2023\nDean’s List (6/8 semesters), Penn State 2020 – 2021\nIEEE - Eta Kappa Nu (International Honor Society of Computer and Electrical Engineers) 2021 – Present\nTau Beta Pi (International Honor Society of Engineers) 2021 – Present\nNittany AI Award Finalist: Nittany AI Challenge – Team FungAi 2022\nBehrend Honor Program, Penn State (Behrend Campus) 2020 – 2021\nCollege of Engineering Scholarship (STEP) 2021\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nIEEE Mini Hackathon 2022\nCollege of Engineering Travel Grant, awarded by the Center for Global Engineering 2021\nEngagement, Penn State University (unable to complete due to COVID-19 pandemic)\nSkills\nHardware/Software Languages\nC++/ C Python MATLAB Java VHDL Verilog\nKotlin Assembly (MIPS and HC12)\nSoftware\nVisual Studio Xilinx Vivado AutoCAD NI Multism NI Labview MPLAB\nAndroid Studio Blender ROS 2\nLanguages\nEnglish Chinese Mandarin Taiwanese Spanish Japanese\n(Fluent) (Native) (Conversational) (Beginner) (Beginner)\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}