{
  "document_name": "Qin, Yifan (134745944).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Qin, Yifan; DOB: 06/12/2000; ID: 134745944\nYifan Qin\n800 Park Avenue, Fort Lee, NJ 07024\n(929) 989-7805 & yq2343@columbia.edu\nEDUCATION\nColumbia Engineering, Columbia University New York, NY\nMaster of Science in Chemical Engineering 09/2022-present\n• Overall GPA: 4.0/4.0\n• Courses: Transport in Fluid Mixtures, Soft Condensed Matter\nZhiyuan College, Shanghai Jiao Tong University (SJTU) Shanghai, CN\nBachelor of Science in Chemistry (Zhiyuan Honors Program) 09/2018-06/2022\n• Overall GPA: 85/100 | Senior GPA: 90.5/100\n• Courses: Organic Chemistry, Polymer Chemistry, Physical Chemistry, Polymer composite\nACHIEVEMENTS & AWARDS\n• Zhiyuan Honors Scholarship of Shanghai Jiao Tong University 12/2018; 12/2019; 12/2020;12/2021\n• Scholarship of Shanghai Jiao Tong University 12/2019; 12/2020;12/2021\n• First Prize in Shanxi Province, The 31st National Chemistry Competition for High School Students 10/2017\nRESEARCH EXPERIENCES\nTransport and Mechanical Properties of Grafted Nanoparticles 02/2023-present\nStudent Research Worker | Supervisor: Prof. Sanat K. Kumar | Columbia Kumar Research Group\n• Mechanical Properties Research on Polymer-Grafted Nanoparticle Membranes via Oligoaniline Environments\n- Investigated the impact of polyoligoanilines inclusion in poly (methyl acrylate) (PMA) graft nanoparticles (GNPs).\n- Conducted rheological measurements using small amplitude oscillatory shear (SAOS) on both polyoligoanilines\nintegration methods: (1) bimodal systems where chains of polyoligoanilines and PMA are attached to the silica;\n(2) diblock copolymer systems: PMA-b-polyoligoanilines are attached to the silica.\n- Systematically optimized film mechanical properties by strategically tuning the content and positioning of\npolyoligoanilines within the GNP matrix, achieving superior material outcomes.\n• Mechanical and Gas Transport Properties Research on GNP Membranes with Added Free Polymers\n- Incorporated homopolymers with distinct molecular weights into GNP solutions, followed by the fabrication of a\nrange of GNP membranes through precise control of homopolymer content, molecular weight, and evaporation\nkinetics.\n- Performed comprehensive rheological assessments using SAOS techniques on the resulting membranes. The\nintroduction of larger free chains exhibited a marginal enhancement in mechanical properties, whereas the\nincorporation of smaller free chains led to a noticeable reduction in modulus.\n- Conducted small-angle X-ray scattering and small-angle neutron scattering analyses to elucidate the spatial\narrangement of the free chains within the GNPs.\n- Performed gas permeation tests under various temperatures and gas compositions to investigate the activation energy.\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Qin, Yifan; DOB: 06/12/2000; ID: 134745944\nNano-horticulture Technology based on Micellar Brush 06/2020-06/2022\n(Awarded the Zhiyuan Scholars Research Program funds of 75000 RMB)\nTeam Leader | Supervisor: Prof. Huibin Qiu | SJTU Qiu Group: Precision Hierarchical Self-Assembly\n• Used poly(lactide)-containing block copolymer for assembly into micellar brushes, resulting in nanostructure\nconstruction on material surfaces and enhanced material functionalization for new applications.\n• Synthesized a series of block copolymers with crystalline PLLA as core-forming block and different amorphous corona-\nforming blocks, investigated their active self-assembly behavior in solution, obtained the controllable morphology and\nsize by adjusting parameters such as block ratio, assembly time, temperature, and types of selective solvent\n• Anchored the cylindrical micelle seeds onto material interfaces, prepare the micellar brushes with controllable density\nand uniform length, and explore the controllable growth process of poly(lactide)-containing cylindrical micellar brushes\n• Executed functionalization of micellar brushes, expanding their applicability in medical materials, drug delivery,\nantibacterial operations, and more.\nA Self-Assembly Pathway to Soft-matter Toroidal Nanostructures 06/2020-11/2020\nIndividual Research | Supervisor: Prof. Huibin Qiu | SJTU Qiu Group: Precision Hierarchical Self-Assembly\n• Mapped the preparation landscape of toroidal nanostructures, emphasizing the evolving self-assembly methodologies of\nsoft matters.\n• Demonstrated the intricate constructions of hierarchical nanostructures, harnessing toroidal micelles as foundational\nbuilding units.\n• Consolidated insights on self-assembly principles, while evaluating and addressing the impending challenges and\nconsiderations for this nascent realm of nanomaterials.\nLEADERSHIP & VOLUNTEER EXPERIENCES\n• Class Monitor of Zhiyuan Honors Program of Chemistry, Zhiyuan College of SJTU 09/2018-09/2019\n• Excellent Member of the Secretary Department of Student Union of Zhiyuan College of SJTU 09/2019-09/2020\n• Excellent Member of Summer Volunteer Teaching Activities of SJTU 08/2019\n• Volunteer of Zhiyuan College of SJTU (over 100 hours of volunteer service) 07/2019-09/2021\n• Volunteer of Shanghai International Marathon 12/2019\nADDITIONAL INFORMATION\n• Software and Programming Skills: Python, Mathematica, ChemDraw, MestReNova, Gaussian 09\n• Experiment Skills: Gas Permeation Cell, Rheometer, Thermogravimetric Analysis (TGA), Small angular X-ray\nscattering (SAXS), Column Chromatography, Thin Layer Chromatography (TLC), High-Performance Liquid\nChromatography (HPLC), Nuclear Magnetic Resonance (NMR), Transmission Electron Microscope (TEM), Scanning\nElectron Microscope (SEM)\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}