{
  "document_name": "Li, YiRan (159558714).pdf",
  "total_pages": 5,
  "pages": [
    {
      "page_number": 1,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nVanessa YiRan Li\nyl5200@columbia.edu | +1 (339) 213-0689 | vanessaliyiran.webflow.io | New York City, NY\nEducation\nColumbia University, Fu Foundation School of Engineering and Applied Sciences Expected Dec 2023\nM.S. in Biomedical Engineering | GPA 4.21/4.00 New York, NY\n• Concentration in Biomaterials and Tissue Engineering\nWellesley College May 2022\nB.A in Chemistry (Honors) and Sociology | GPA 3.92/4.00 Wellesley, MA\n• Durant Scholars Summa Cum Laude and Sigma Xi Scientific Research Honor Society\nMassachusetts Institute of Technology (MIT) May 2022\nGordon-MIT Certificate in Engineering Leadership |GPA: 5.00/5.00 Cambridge, MA\nResearch Experience\nTranslational Therapeutics Accelerator (B. Fine Lab), Columbia University\nTeam Member Jan 2023 – Present| New York, NY\n• Selected to take part in the Translational Therapeutics Accelerator Lab-to-Market Boot Camp to\ncommercialize a STK25 inhibitor as a drug to ameliorate cardiac ischemia injury\n• Conducted stakeholder interviews and market analysis to understand the heart attack market\nand formulate a business model for this new drug\nLaboratory for Stem Cells and Tissue Engineering (G. Vunjak-Novakovic Lab), Columbia University\nResearch Assistant Sep 2022 – Present| New York, NY\n• Model myocarditis using engineered cardiac tissues and patient antibodies to understand the\nunderlying mechanism of this myocardial injury in systematic lupus erythematous patients\n• Initiated the Women in STEM database and created science-related content (i.e. articles and\nvideos) on the Tissue Engineering Resource Center website to make science more accessible\nY. Yoshida Laboratory, Center for iPS Cell Research and Application (CiRA), Kyoto University\nResearch Intern June 2022 – Aug 2022 | Kyoto, Japan\n• Characterized disease phenotypes of cardiac fibrosis by evaluating key signaling pathways and\nbiomarkers upon exposure to immunosuppressants and MAPK inhibitors\n• Modeled mature human hearts by engineering iPS cell-derived multi-lineage organoids for\naccurate and reliable drug screening and toxicity studies\nSenior Thesis at Flynn Laboratory, Department of Chemistry, Wellesley College\nIndependent Researcher Aug 2021 – May 2022 | Wellesley, MA\n• Explored the application of water transfer printing to micropattern hydrogels onto 3-dimensional\nnonplanar surfaces for replicating microenvironments in the body\n• Designed assays to optimize material properties and hydrogel composition as well as to visualize\nmicropatterns with fluorescent particles\n10/07/2024 09:57 Resume 1/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nY. Shrike Zhang Laboratory, Harvard Medical School-Brigham and Women’s Hospital\nResearch Trainee Oct 2019 – Apr 2020 | Cambridge, MA\n• Synthesized tubular hydrogel constructs with self-constructed bio-printer to model renal tubules\nand blood-brain barrier for applications in disease modeling\n• Conceived the fabrication of glomerulus-on-a-chip and its accompanying bioreactor with\nmicrofluidic devices\nR. Weiss Laboratory, Department of Biological Engineering, Massachusetts Institute of Technology\niGEM Undergraduate Research Intern Jan – Nov 2019 | Cambridge, MA\n• Engineered human embryonic kidney cells to induce swarm-like chemotactic behavior in\nneutrophils to form immunogenic cell swarms\n• Designed migration assays with Boyden chambers and fluorescent microscopy to communicate\nthe migration index of HL-60 cells toward endogenous and transfected chemoattractants\nPROFESSIONAL EXPERIENCE\nColumbia University Graduate Engineering Student Affairs\nBiomedical Engineering Student Ambassador Feb 2023 – Present | New York, NY\n• Reviewed video interviews of MS applicants to evaluate applications for Fall 2023 entry\n• Organized mentorship program between incoming and current MS students\n• Represented BME master’s program at informational session as well as serve as point of contact\nfor incoming students on inquiries regarding program experience and life at Columbia\nPforzheimer Learning and Teaching Center at Wellesley College\nCafe Tutor and Accessibility Notetaker Sep 2019 – May 2022 | Wellesley, MA\n• Supported student learning in introductory and organic chemistry courses by teaching sessions\ntailored towards the needs of each tutee with up to 20 students at a time\n• Assisted students in the planning and organization of course material and study schedules to\nincrease performance in chemistry courses\nInnovating Environmental Health\nFounder and Executive Director Jan 2020 – October 2021 | Wellesley, MA\n• Managed 15 students in the design of low-cost air filtration devices and air quality sensors to\nimprove the respiratory health of school children in Nepal, amassing 800+ followers on social\nmedia platforms\n• Designed and delivered 6-week courses on sustainability and design thinking to 80+ students in\nNepal and China as a Davis Project for Peace Grant recipient (2021)\nSiemens Healthineers\nInnovation Think Tank Fellow May – Jul 2021 | Shanghai, China\n• Conducted 20+ hours of physician interviews and 100+ hours of research on radiography\nequipment in three tiers of hospitals in China\n• Analyzed urine and blood analysis systems for product innovation and business modeling\ntargeting community healthcare facilities\n10/07/2024 09:57 Resume 2/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nSurgiBox Inc., Massachusetts Institute of Technology D-Lab\nBiomedical Engineering Intern Feb 2019 – Jan 2020 | Cambridge, MA\n• Constructed origami-inspired air filters to increase the portability of operating-room-in-a-\nbackpack device to unique settings around the world\n• Implemented failure modes and effects analysis by coding an automated google sheets\ndocument to deploy safe surgery\nPUBLICATIONS\n“An Engineered Human Cardiac Tissue Model Reveals Contributions of Systemic Lupus Erythematosus\nAutoantibodies to Myocardial Injury.” In Preparation.\n“Immunosuppressants Tacrolimus and Sirolimus revert the cardiac antifibrotic properties of p38-MAPK\ninhibition in 3D-multicellular human iPS-heart organoids.” Y. Tian, Y. Tsujisaka, V.Y. Li, K. Tani, A.\nLucena-Cacace, and Y. Yoshida. Frontiers in Cell and Developmental Biology. November 11, 2022.\n“Water Transfer Printing: Hydrogel Micropatterning of Complex 3-Dimensional Surfaces for Biological\nApplications.” V.Y. Li and N. Flynn. Wellesley College Digital Depository. 2022.\n“The Glomerulus: A Review on Current Biomimetic Models.” M.G. Valverde, L.S. Mille, K. Figler, E.\nCervantes, V.Y. Li, J. Bonventre, R. Masereeuw, Y.S. Zhang. Nature Reviews Nephrology. January 21,\n2022.\n“The Directed Migration of Neutrophil-Like Cells Through Engineered Chemokine Secretion.” YiRan Li,\nMelody Wu, Margaret Zhang, Nika Shakiba, Shiva Razavi, Ron Weiss. MIT Undergraduate Research\nJournal Volume 38. Fall 2019.\nPRESENTATIONS\n\"Understanding myocardial injury with clinical systolic dysfunction in systemic lupus erythematosus\npatients using iPSC-derived engineered cardiac tissues.\" S. Fleischer, T. Nash, M. Tamargo, R. Lock, G.\nVenturini, M, Morsink, V. Y. Li, M. Lamberti, P. Graney, M. Liberman, Y. Kim, R. Zhuang, J. Whitehead,\nR. Friedman, R. Soni, J. Seidman, C. Seidman, L. Geraldino-Paradilla, R. Winchester, G. Vunjak-\nNovakovic. Poster presentation at the Columbia Summer Research Symposium. New York, NY. July 26,\n2023.\n“Disease Pathway: Wound Healing Disorder.” External Innovation Think Tank Exhibition. July 28, 2021.\n\"Innovating Environmental Health: Providing Clean Air to Children through Collaborative Engineering\nand Education.\" V.Y. Li. Social Impact Lab Presentation at the Unite for Sight Global Health and\nInnovation Conference. April 10, 2021.\n\"Innovating Environmental Health: Building Air Filtration Devices to Clean the Air in Nepali Secondary\nSchools.” V. Y. Li, S. Sedhain, B. Mandal, B. Y. Li. Poster presentation at the 12th Annual Consortium of\nUniversities for Global Health Conference. March 21, 2021.\n10/07/2024 09:57 Resume 3/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nAWARDS AND HONORS\nSigma Xi Grants in Aid of Research Recipient (June 2023): Awarded 1000 USD to study the electrical\nand metabolic maturation of engineered cardiac tissues in the Vunjak-Novakovic Lab\nSummer at SEAS Fellowship (March 2023): Awarded 6000 USD to conduct summer research in the\nSchool of Engineering and Applied Sciences at Columbia University\nBostInno’s 25 Under 25 Honoree (September 2021): Selected as one of Massachusetts’ 25 young\ninnovators under the age of 25 by digital media and events company BostInno\nDavis Project for Peace Grant 2021 Recipient (June 2021): Awarded 10,000 USD to improve the air\nquality for children in Nepal as nominated by Wellesley College and selected by the Davis Foundation\nSocial Innovation Warehouse Global Fellow (February 2021): Selected to take part in a 5-week\ncapacity-building program for young innovators to grow their social innovation projects\nAlbright Institute of Global Affairs Fellow (January 2021): Selected as one of 40 Wellesley Students,\nguided by Secretary M. Albright, to engage in global leadership seminars with the goal of bridging\neducation and practice\nIntroductory Chemistry Award (April 2020): Awarded for outstanding performance in an introductory\nchemistry course at Wellesley College\nInternational Genetically Engineering Machine Gold Medal (November 2019): Awarded to teams who\nhave shown excellence in key pillars of an iGEM project as a part of the MIT iGEM team at R. Weiss\nLaboratory\nLEADERSHIP EXPERIENCE\nInterschool Chair and Lead Department Representative, Columbia Engineering Graduate Student\nCouncil (Sep 2022 – Present) – Organize social/networking events between different schools at\nColumbia to foster interdisciplinary 21st century discussions\nFounder and Co-Editor in Chief, Wellesley Undergraduate Research Journal (Sep 2020 – May 2022) –\nLaunched biannual peer-reviewed journal to showcase multidisciplinary research at Wellesley College,\nproviding an opportunity for students to undergo the peer-review process\nTechnology Lead, MIT Hacking Medicine (May 2019 – May 2022) – Managed event hosting 400+\nparticipants around the world to address medicine, COVID, and racism to foster an innovative\necosystem that solves healthcare problems worldwide\nPresident and Project Manager, Wellesley Engineering Society (Oct 2018 – May 2022) – Initiated 3D-\nprinted e-NABLE prosthetics project, Design for Social Change Ideation, and Wellesley in Minecraft\nproject to diversify the engineering community at Wellesley\n10/07/2024 09:57 Resume 4/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nCOMMUNITY OUTREACH\nEvent Organizer, Columbia BME Diversity, Equity, and Inclusion Committee (Jan 2023 -Present) –\nOrganize speaker events and social media content to celebrate women’s history month at Columbia\nUniversity with the goal of increasing the visibility of women-identifying scientists\nSocial Media Manager, Health Tech Without Borders (Nov 2022 – Present) – Create social media posts\nto raise awareness for the humanitarian emergency in Ukraine and to leverage telemedicine to provide\nimmediate access to health resources, garnering 40,000+ impressions on published posts\nHYPOTHEKids, Maker Lab Instructor (July 2023) – Designed and taught a computational biology\ncurriculum to underserved high school students in New York interested in STEM\nResearch and Advocacy Volunteer, The Family Van (Sep 2021 – Dec 2021) – Engaged in research on\nmobile health clinics around the United States as well as compiled healthcare data and resources to\nbring mobile health services to vulnerable populations in greater Boston\nHealth Partnerships Coordinator, Boston Healthcare for the Homeless (Sep 2019 – May 2021) – Led\ncommunity-based learning and reflection for volunteers at Boston Healthcare for the Homeless and\norganized games/music concerts for the residents\n10/07/2024 09:57 Resume 5/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}