{
  "document_name": "Liu, Yi-Chen (198186667).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Liu, Yi-Chen; DOB: 01/27/1997; ID: 198186667\nETHAN (YI-CHEN) LIU\n+1 (332) 256 1405 | yl5188@columbia.edu | www.linkedin.com/in/Ethan-Yi-Chen-Liu\nEDUCATION\nColumbia University, New York, US Sept.2022-Dec.2023(Expected)\nMaster of Science in Material Science and Engineering\nNational Tsing Hua University, Hsinchu, TW July.2020-July.2022\nMaster of Science in Chemical Engineering\nNational Chung Cheng University, Chiayi, TW Sept.2015-Jan.2020\nBachelor of Science in Chemical Engineering\nWORK EXPERIENCES\nEffect of Laser Annealing on Indium-Gallium-Zinc-Oxide (IGZO) Thin-Film Transistors\nResearcher Student\nResearch Advisors: Prof. James S. Im, Columbia University Oct.2022- Present\n Simulated laser-induced crystallization of thin films using 3-D numerical simulation (3DNS) program to analyze\nthermal behavior and optimize process parameters.\n Fabricated the bottom-gate transistor with varying composition and thickness of IGZO and heat conductive layer\nand performed annealing of oxide layers using Excimer Laser and Flashlamp system.\n Optimized Excimer Laser annealing energy density based on the tendency of oxygen vacancies and electrical\ncharacterizations with X-ray photoelectron spectroscopy (XPS) to achieve desired material properties and applied\nX-ray diffraction (XRD) to assess crystallization process of IGZO.\n Evaluated the conductivity and sustainability of devices after high-density laser annealing, ensuring superior\nperformance and reliability.\nModel-Building for Ozone Absorption and VOCs ozonation in a Rotating Packed Bed\nResearcher Assistant\nResearch Advisors: Prof. Shi-Shang Jang, NTHU, and Prof. David Shan-Hill Wong, NTHU July.2020-July.2022\n Developed a generic high-gravity rotating-bed model in Aspen Custom Modeler to predict ozone absorption and\nVOCs ozonation.\n Selected suitable combination of mass transfer correlations through numerous comparisons and reduced deviation\nbetween simulation and experiment data to 9% and 3.2% in ozone and oxygen absorption, respectively.\n Modified the Enhancement Factor in mass transfer from VOC concentration-based to pH-based, resulting in an\nimprovement in simulation accuracy and reducing deviation from 97.5% and 57.8% to 7.3% and 11.5% in\nsimulating two VOCs ozonation.\n Validated model applicability and universality and presented at Asian Symposium on Process Systems Engineering\n(PSE Asia 2022).\nStudy on the influences of Different Solvents for CO2 Capture in Rotating Packed Bed (RPB)\nResearcher Assistant\nResearch Mentor: Prof. Jeffrey Kantor, University of Notre Dame Jan.2021-May. 2021\n Compared CO absorption of MEA and DETA (as solvents), then studied effect of adding PZ, discovered a mixture\n2\nof DETA and PZ was assessed to highest mass transfer coefficient, K .\nGa\n Analyzed absorption performance of RPB and traditional absorption tower and demonstrated the potential for\nsubstituting the traditional packed tower with RPB based on comparative data.\n Presented at International Conference on Sustainable and Renewable Energy Engineering (ICSREE 2021).\nSKILLS ____\nSimulation/Programming:\nAspen Plus, Aspen Custom Modeler, Origin, Microsoft Office (Word, Excel, PowerPoint…), Python, Layouteditor.\nDevice Fabrication/Skills:\nPhotolithography, Plasma-Enhance Chemical Vapor Deposition, Wet and Dry Etching, Laser Annealing, Flashlamp\nAnnealing, Wafer Dicing, Chemical Mechanical Polishing, Physical Vapor Deposition.\nMetrology/Equipment:\nOptical Microscope, X-ray Photoelectron Spectroscopy, Atomic Force Microscope, Ellipsometer, Raman spectrometer\nX-ray Diffraction, Probe Station.\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}