{
  "document_name": "O'Connell, Samantha (206710962).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "O'Connell, Samantha; DOB: 12/27/1999; ID: 206710962\nSamantha O'Connell\nEmail: sno2321@nyu.edu Location: NY, NY LinkedIn: https://www.linkedin.com/in/samantha-oconnell\nSUMMARY\nI am a full-time undergraduate student interested in obtaining a master’s degree in computer science, computer engineering, or\ndata science. I plan to apply to fellowships, internships, and financial aid to pay for my tuition. I am a low-income student.\nEMPLOYMENT AND VOLUNTEER EXPERIENCE\nGovernor's Committee on Scholastic Achievement Dec 2022 - Present\nGraphic Designer/ Social Media Manager\nI work with a team on social media marketing techniques. I create graphic designs for social media and business relations. I\nnegotiated a sponsorship/ plan between Governor's Committee on Scholastic Achievement (GCSA) with New York University\n(NYU). I promote GCSA events and partnerships. Such as creating internships for NYU students.\nNew York University Jun 2023 - Aug 2023\nCommunity College Transfer Opportunity Program Orientation Leader Aug 2023 - Sep 2023\nNYU Welcome Leader\nNew York University School of Professional Studies Jul 2023 - Sep 2023\nSchool of Professional Studies Orientation Leader\nIn all three of my orientation leadership positions, I welcomed new incoming and returning students to campus. I assisted with\norientation events and played a key role in the ease of students' transition to NYU and NYC. I worked with advisors and other NYU\nprofessional staff to guide students, lead tours, provide knowledge on NYU resources, complete office duties, conduct inventory\nmaintenance, and assist with university ID creation and university ID distribution. In addition to a multitude of other duties.\nThe School of Professional Studies (SPS) and Community College Transfer Opportunity Program (CCTOP) orientations were\ndesigned for students within that division or scholarship program. This led to a smaller more personalized experience compared to\nNYU Welcome. Which was a broader experience with over 20,000 incoming and returning students. In addition to working with a\nteam of over 160 NYU Welcome Leaders and staff.\nA list of skills developed is event management, communication, interpersonal skills (Inclusion and Belonging), customer service,\nleadership, conflict management, training, organization, facilitation, intentionality, assessment, conflict resolution, creativity,\nteamwork, collaboration, critical thinking, and problem-solving, line management, resilience and adaptability, self-management,\nresources, professionalism, and enthusiasm.\nNew York University School of Professional Studies May 2022 - May 2023\nSchool of Professional Studies Social Media and Design Committee Chair UG\nSchool of Professional Studies Undergraduate Student Council Committee Chair\nSchool of Professional Studies Social Media and Design Committee Co-Chair Jun 2022 - May 2023\nSchool of Professional Studies Undergraduate Student Council Committee Chair Jun 2023 - Present\nI worked in three interchangeable non-profit graphic design positions at the School of Professional Studies (SPS). I was an\nUndergraduate Student Council (USC) graphic design chair. I led a team of graphic designers and social media managers. I worked\nalongside my team to meet NYU and the SPS Student Council requirements: guidelines, brand/ brand marketing, and niche. The\nteam and I organized hybrid events to strengthen student engagement for returning students and online only students. Many of\nmy designs are published on the Student Council's social media and within NYU's internal media feed.\nI wrote captions, created and edited designs, assisted with social media management, organized and managed events, welcomed\nguests and provided good quality service within the event, sent and received emails, performed research, managed records and\ndocuments, wrote status reports, managed my team, resolved last-minute changes, created meeting credentials, managed\nequipment, performed other office duties, volunteered, participated in decor and interior design, cleaned, carried and stored\nsupplies, coached new chairs, collaborated with other committees on additional projects, negotiated with other school divisions/\nsenior management/ clubs/ other, and worked diligently to meet all of my deadlines.\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "content": "O'Connell, Samantha; DOB: 12/27/1999; ID: 206710962\nSchool of Professional Studies Student/ Club Leader May 2022 - May 2023\nI worked as a non-profit student leader on the School of Professional Studies Undergraduate Student Council. I was considered a\nbrand ambassador/ representative of the council and school. I assisted the NYU and NYC communities through volunteer work\nand research.\nEDUCATION\nBorough of Manhattan Community College 2018 - 2020\nAssociate of Liberal Art, AA (Honors)\nNew York University - School of Professional Studies 2021 - Present\nBachelor of Information Systems Management, BS (Honors)\nRESEARCH AND PUBLICATIONS\nNew York University - School of Professional Studies 2022 - Present\nAre You a Duck or Are You Brave: Comparing DuckDuckGo to Brave\nNew York University - School of Professional Studies May 2023\nDovetail - Art & Literacy Magazine\nEXTRACURRICULAR, LEADERSHIP, AND COMMUNITY SERVICE\nNew York University\nhttps://docs.google.com/document/d/1ZYJw3AAaDT_hbF0DKvntQQ5yBwPbe7Qi1ybmbbT35ao/edit?usp=sharing\nACADEMIC HONORS AWARDED AND HONORARY SOCIETIES\nNew York University - School of Professional Studies Apr 2023\nAlpha Sigma Lambda - Delta Upsilon Chapter Honor Society\nBorough of Manhattan Community College 2018\nThe National Society of Leadership & Success\nNew York University - School of Professional Studies FA 2021, SP 2023\nDean’s List\nBorough of Manhattan Community College Dec 2020\nHonors\nBorough of Manhattan Community College FA 2019, SP 2020, FA 2020\nDean’s List\nAWARDS FOR SERVICE OR LEADERSHIP\nNew York University - School of Professional Studies Apr 2023\nRising Star Award\nGovernor’s Committee on Scholastic Achievement Jun 2023\nCommunity & Contribution Certificate\nGovernor’s Committee on Scholastic Achievement Jun 2023\nAlumni Council Member Certificate\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792.0
      }
    }
  ]
}