{
  "document_name": "Safari, Fatemeh (223323625).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Safari, Fatemeh; DOB: 09/10/1992; ID: 223323625\nFatemeh Safari\nEmail: fsafari92@gmail.com,Phone: (906) 231-4279\nEDUCATION\nMichigan Technological University(MTU) | Houghton, MI May 2020\nMSc Electrical Engineering\nUniversity of Mazandaran | Mazandaran, Iran February 2015\nBS Physics\nPUBLICATION\n1. E. Hedayati, F. Safari, G. Verghese, V. R. Ciancia, D. K. Sodickson, S. Dehkharghani, and L. Alon, ”An\nexperimental system for detection and localization of hemorrhage using ultra-wideband microwaves with\ndeep learning,” arXiv:2310.02215, 2023. [Online]. Available: https://arxiv.org/abs/2310.02215.\n2. O. Yaghmazadeh, S. Schoenhardt, A. Sarabandi, A. Sabet, K. Sabet, F. Safari, L. Alon, and G. Buzs´aki,\n”In-vivo measurement of radio frequency electric fields in mice brain,” Biosensors and Bioelectronics: X,\nvol. 14, pp. 100328, 2023. [Online]. Available: https://www.sciencedirect.com/science/article/pii/\nS2590137023000250.\n3. S. Jamilan, N. P. Gandji, G. Semouchkin, F. Safari, and E. Semouchkina, ”Scattering from Dielectric\nMetasurfaces in Optical and Microwave Ranges,” IEEE Photonics Journal, 2019.\n4. S. Jamilan, G. Semouchkin, F. Safari, and E. Semouchkina, ”Interference Phenomena at Resonances in\nDense Silicon Metasurfaces,” in Proceedings of PhotonIcs & Electromagnetics Research Symposium, Rome,\n2019.\nPROFESSIONAL/RESEARCH EXPERIENCE\nResearch Associate in Radiology, NYU Grossman School of Medicine Sep 2020 - Aug 2023\n• Microwave Medical Imaging Prototype for Stroke Classification and Localization\n– Designed electronic printed circuit boards and a switch matrix on PCB up to 4 GHz using KiCad.\n– Developed UWB unidirectional Vivaldi antennas for medical imaging purposes using HFSS.\n– Designed and manipulated CAD models for 3D printing, which included an anthropomorphic human\nhead phantom for pre-human testing, antenna holders, different mounts, and more.\n– Created dielectric tissue-mimicking solutions at 64MHz-6GHz with similar dielectric parameters to the\nhuman brain, muscle, and blood\n– Studied the electromagnetic response, behavior, and penetration of the designed UWB unidirectional\nVivaldi antennas in a heterogeneous head model using CST Microwave Studio.\n– Contributed to the design of a 2x8 port PCB switch matrix functional up to 10 GHz, including\nsimulating various transmission lines, vias, and coaxial launches.\n– Assisted with data collection from the stroke detection test bed prototype to validate system perfor-\nmance.\n– Contributed to the construction of a 2x16 switch-matrix functional up to 12 GHz, encompassing shift-\nregister design, mechanical assembly, soldering, organization, and 16-port calibration.\n– Facilitated component-level testing and troubleshooting setups for PCBs.\n– Collaborated in a multidisciplinary team of engineers, physicists, and medical professionals.\n– Facilitated the procurement of a 2-port Vector Network Analyzer (VNA), including vendor selection,\nnegotiation, and finalizing the purchase.\nSeveral manuscripts are currently under review or in preparation for publication.\nMaster Student, MTU Sep 2018 - May 2020\n1\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Safari, Fatemeh; DOB: 09/10/1992; ID: 223323625\n• Electromagnetic Response from Dielectric Metasurfaces\n– Investigated scattering parameters of dense and sparse arrays of dielectric resonators (metasurfaces)\nusing CST Microwave Studio.\n– Conducted simulations to explore the parameter correspondence with Magnetic Dipole Resonance\n(MDR) and Electric Dipole Resonance (EDR), referenced in published work [jamilan2019scattering].\n• Electromagnetically Induced Transparency in Metasurfaces\n– Simulated metasurfaces with arrays of cylindrical resonators using electromagnetic field simulation\nsoftware (CST Microwave Studio and COMSOL Multi-physics) to find structures which provides EIT-\nlike response\n– Discovered that EIT-like response has no correlation to MDR\n– It was shown that the EIT-like response happens at the EDR frequency and the slow-light effect can\nbe observed\n– Found the group index velocity using MATLAB from transmission phase\n– Verified the simulations by performing experiments using dielectric cylinders in microwave range (10-\n12GHz) by X-Band horn antennas\nTEACHING EXPERIENCE\n• Michigan Technological University\n– Developed an online version instruction (using NI Multisim) of ”AC magnitude and Phase” for circuits\nand instrumentation course’s lab for non-major students during the COVID-19 pandemic, Spring 2020\n– Circuits and Instrumentation (EE3010) Lab Instructor for EE, CE, BME, and ME major students,\nFall & spring 2019/20, Fall 2018/19\n– Electric Circuits II (EE2112) Lab, Lab Instructor for EE and CE students, Spring 2018/19\n– Co-Developed a course design for fundamental physics laboratory III, 2012\nSOFTWARE AND TECHNICAL SKILLS\n• COMSOL Multi-Physics • ANSYS Electronic • CST Microwave Studio\n• AutoCad Desktop (HFSS) • NI LabVIEW\n• Autodesk Fusion 360 • MATLAB and Python • PCB Routing (LPKF Protomat\nD104, H100)\n• Autodesk Inventor • Autodesk Eagle\n• 3D Printing (Fortus, Phrozen, Any-\n• NI Multisim • KiCad cubic)\nSELECTED PROJECTS OF COURSES\n• New Design of Patch Based Uda-Yagi; Special topics in Antennas Spring 2020\nAn Uda-Yagi Antenna can be improved by placing Patch antennas in place of some or all of its elements\n(including the reflector, driven element and directors). My goal was to increase the Uda-Yagi’s bandwidth\nin 3GHz+ frequency. The model has been simulated in ANSYS Electronic Desktop(HFSS).\nIn order to learn how an Anechoic chamber works, a dipole antenna was simulated in COMSOL Multi-\nphysics, then built and tested in the Anechoic chamber to verify the performance of the antenna antenna.\n• OptimizingaPatchAntennawithaMetasurface; AdvancedMicroElectroMechanicalSystems\nSpring 2020\nEmploying a metasurface with cylindrical resonators as its unit cells on top of a patch antenna to reduce\n2\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Safari, Fatemeh; DOB: 09/10/1992; ID: 223323625\nthe return loss and improve the gain which can be useful in medical devices. The antenna and the model\nhave been simulated by ANSYS Electronic Desktop(HFSS).\n• Design of a matched 50 ohm Feeding-Line Insert Fed microstrip Patch Wi-Fi Antenna for\n2.45GHz; Microwave & Antenna Engineering Spring 2019\nFirst based on the target center frequency the dimensions of our patch antenna was calculated. Then, using\nCST Microwave Studio software the antenna was modeled. In the simulation phase, different substrate\npermitivities have been tested to optimize the maximum radiation efficiency at the anntena’s resonant\nfrequency.\nPRESENTATIONS\n• Michigan Technological University\n1. How to simulate a dipole antenna in COMSOL, Special topics in Antennas (02/2020)\n2. Carbon Nanotube Field Effect Transistors, Solid state Devices (03/2019)\n3. Dielectric meta-surfaces, Electronic Materials (12/2018)\n• Iran University of Science and Technology\n1. Vacuum pump evacuation rate and its calculations, Vacuum Techniques (04/2014)\n2. Kramers-Wannier Duality of Statistical Mechanics Applied to the Boolean Satisfiability Problem of\nComputer Science, Statistical Mechanics (12/2013)\n3\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}