{
  "document_name": "Wang, Zeyu (236052530).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Wang, Zeyu; DOB: 03/17/2000; ID: 236052530\nZeyu Wang\nEmail. zw2853@columbia.edu | (646) 255-7271\n30 Morningside Dr, Apt 608\nNew York, NY 10025\nEDUCATION\nColumbia University New York, NY\nM.S. in Chemical Engineering Sept 2022 - Expected Dec 2023\nFudan University Shanghai, CN\nB.S. in Chemistry Aug 2018 - Jul 2022\nRESEARCH EXPERIENCE\nResearch into Battery Recycling January. 2023- Now\nAdvisor: Professor Dan Steingart, Columbia University\n➢ Selectively leached lithium from NMC811 and LFP with efficiency higher than 85%.\n➢ Recycled and separated different metals from NMC811 through piranha digestion and solvent extraction at different pH.\n➢ Analyzed the composition of the residues after NMC811 powder bromine leaching with SEM and XRD.\nResearch into Lithium Ion Battery Sept 2022 – Dec. 2022\nAdvisor: Professor Yuan Yang, Columbia University\n➢ Designed and modified solid polymer electrolyte based on PVDF-HFP and PEGDA\n➢ Applied different polymer formulation and increased the mechanical strength to a large extent.\n➢ Explored different electrolyte composition to soak the solid polymer electrolyte film to improve conductivity.\nResearch into the photo induced living radical polymerization Feb 2020 - Jul 2022\nAdvisor: Professor Mao Chen, Fudan University\n➢ Synthesized a variety of monomers, chain transfer agents and photocatalysts to synthesize polymers with outstanding\nelectric performance with productivity more than 60%.\n➢ Optimized reaction conditions of photo induced polymerization including temperature and adding rate and improved\npostprocessing with productivity rising from 30% to 70%.\nPUBLICATION\nWang, Z.; Zhou, Y.; Chen, M., Computer‐Aided Living Polymerization Conducted under Continuous‐Flow Conditions.\nChinese Journal of Chemistry 2021.\nACTIVITIES\nLeader of the Organization and Investigation Department of the Student Union in Chemistry Sept 2019 – Sept 2020\n➢ Investigated students’ and teachers’ opinions and suggestions on situations regarding teaching buildings and laboratories.\n➢ Rated as best departments reflecting students’ suggestions.\nVolunteering in the Academic Forum of Chemistry Nov 2019\n➢ Took charge of the whole activity and worked on the communication with professors to give speeches.\n➢ Organized students to share academic research experience and results.\nSKILLS\n➢ Experimental skills: Nuclear Magnetic Resonance; High Performance Liquid Chromatography; Gel Permeation\nChromatography; Inductive Coupled Plasma Emission Spectrometer, Scanning electron microscope and Energy\nDispersive Spectrometer; X-Ray diffraction.\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}