{
  "document_name": "Tang, Zifeng (282670368).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Tang, Zifeng; DOB: 01/17/2000; ID: 282670368\nZIFENG TANG\n775 Columbus Ave, New York, https://www.linkedin.com/in/zifeng- tang-03917a214/ (917) 912- 6024\nNY, 10025 zt2309@columbia.edu\nEDUCATION\nColumbia University New York, NY\nMaster of Science in Chemical Engineering, Overall GPA: 3.62 Expected Dec 2023\nSample Coursework: Carbon Utilization and Conversion, Green Chemical Engineering, Electrochemistry\nNew York University, College of Art and Science New York, NY\nBachelor of Science, Chemistry, Overall GPA: 3.64, Major GPA: 3.87 May 2022\nSample Coursework: Organic Chemistry, Biochemistry, inorganic Chemistry, Intro to Computer Programming\nAward: George Granger Brown Award in Chemical Engineering, Isidore Rubiner Award in Outstanding Chemical Research\nWORK EXPERIENCE\nColumbia University in the City of New York New York, NY\nResearch Assistant & Technician Jan 2023 - Present\n• Joined Prof. Faye McNeil's lab for electrochemistry research focusing on environmental problems. The current focus is to economically\nand efficiently recover lead ions from river water through electro-deposition onto the modified electrode, intensifying the lead\ndetection signal. Mentored undergraduate students for lab research over the summer\n• Act as a technician in the Precision Biochemical Characterization Facility laboratory in the chemistry department. The duty includes\nfilling LN2 dewars, changing cylinders, routine maintenance on instruments, learning instrument operation, and training students in\ntheir use\nInternational Fund For China's Environment Washington, DC\nIntern Jun 2023 - Present\n• Update information and recent events about IFCE on official social media; Research on collecting US low carbon activities among the\nchemical industries, seek potential sustainability cooperation between US and China's chemical industries\nNew York University New York, NY\nCourse and DNA Lab Research Sep 2018 - May 2022\n• Studied 3D printing technology. Comprehended 3D design programs featuring Additive Manufacturing machine\n• Performed strand purification protocol at the DNA Nanotechnology Lab. Attempted to anneal DNA strands to form motifs with other\nlab members. Developed a new strand design whereby DNA strands were made into triangular or polygonal shapes\nInstitute of Life Sciences, Hunan Normal University Changsha, Hunan, China\nBiotechnology Laboratory Intern Jan 2020 - Aug 2021\n• Devised one project to coat antibacterial material, polydopamine catalyzed by H2O2 and Fe3+, on surface of a polyacrylamide gel to\nobtain extra photo-thermal and chemokinetics disinfection\n• Collaborated on another published research project \"An Ultrasmall Fe3O4-Decorated Polydopamine Hybrid Nanozyme Enables\nContinuous Conversion of Oxygen into Toxic Hydroxyl Radical via GSH-Depleted Cascade Redox Reactions for Intensive Wound\nDisinfection.\" https://onlinelibrary.wiley.com/doi/full/10.1002/smll.202105465\nBanfert New Materials Co., Ltd Changsha, Hunan, China\nIntern May 2021 - Jun 2021\n• Managed to utilize UV Curable Coatings for wooden floors and various furniture surfaces\n• Implemented one general procedure of determining the specifications of UV curable coatings, and learned how to test and adjust\ncoating viscosity and adhesiveness, layer thickness, as well as other coating properties\nGreen Hunan Changsha, Hunan, China\nMember May 2017 - Aug 2017\n• Analyzed the water body quality near my hometown and reported the polluting companies emitting chemicals alongside the river. A\nchemical plant was fined 250k CNY\n• Participated in field research at one of the largest landfill sites around my hometown. Assessed its ability to compost daily garbage\nand its potency to convert landfill to electricity for power plant and other sustainability pathways\nSKILLS\nComputer Skills: Word doc, PPT slide, Excel, Python\nINTERESTS\nSoccer, Working out, Fishing, snowboarding, Travel, piano, guitar\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}