{
  "document_name": "Naga Venkata Chandrasekhar, Koralla (285518974).pdf",
  "total_pages": 6,
  "pages": [
    {
      "page_number": 1,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nK N V CHANDRASEKHAR\nPermanent Address\nPlot No: 25, Road No: 2B,\nhandrapuri colony, L.B.Nagar,\nHyderabad, 500074\nTelengana.\nEmail-id: biml . koralla 1 @ gmail .com\nMobile: 7036155043\nAcademic Qualification:\nDegree Name of the Institute University Year of passing Percentage\nSSC Presidency High School Board of Secondary 1991 80%\neducation\nIntermediate Rajadhani Jr. College Board of Intermediate 1993 83%\nEducation\nB.E. M.V.S.R.Engineering Osmania University 1998 85%\nCollege\nMTech IITBombay IITBombay 2000 9.15 GPA\nMBA Johns Hopkins University Johns Hopkins University 2006 3.6 CGPA\nUSA\nGraduate Aptitude Test of Engineering (GATE) – All India Rank – 100+\nFunctional areas of expertise:\nFinite element analysis, structural analysis, solid mechanics, structural optimisation\nTechnical Areas of expertise:\nOperating Systems: Win 10, UNIX\nSoftware: Marc Mentat®, RISA 3D®, MS Office, VC++, MatLab®\nDatabases: MS SQL server, MS Access\nTools: MS Word, MS Excel, MS Power Point\nProfessional Life Memberships\n1. Life Member of Indian Society for Theoretical and Applied Mechanics, IIT Kharagpur\n2. Life Member of Indian Society for Applied Mechanics, IIT Madras\nGIAN Courses Attended\n1. Isogeometric Analysis at IIT Varanasi\n2. Isogeometric Analysis at NITWarangal\n10/07/2024 09:57 Resume 1/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nCAREER PATH\nTotal Experience of 23.5years of teaching, research and industry experience\nMahaveer Institute of Science and Technology Hyderabad 2021 to tilldate\nAssociate Professor in the Department of Civil Engineering\nCVR College of Engineering Hyderabad 2016 - 2021\nAssistant Professor in the Department of Civil Engineering\nTeaching Strength of Materials, Structural Analysis, Numerical Methods, Finite Element Analysis\nGlobal Institute of Engineering and Technology Hyderabad 2016\nAffiliated to JNTUH\nAssociate Professor in the Department of Civil Engineering\nSirindhorn International Institute of Technology, Thailand 2013\nResearch Scholar\nAurora Technical & Research Institute Hyderabad 2011\nAssociate Professor & Head, Department of Civil Engineering\nTeaching Structural Analysis, Building Materials and Construction, RCC, Surveying Lab, SOM Lab\nBentham Institute of Management 2009\nDean Academics, Quality Nominee, Finance Faculty\nAdamSmith Institute of Management 2008\nEconomics, Banking and Finance Faculty\nICICI Bank Bandra-Kurla Complex, Mumbai 2006\nRole: Senior Manager\nCross selling and Up selling\nCITICORP Citibank London, United Kingdom 2001\nRole: Project Lead\nZero Balancing Accounting (ZBA) Account Server\nCITICORP 2000\nRole: Team Member\nPERSONAL DETAILS:\nFather’s name: Shri. K. Eswara Rao\nDate of Birth: 25-07-1976\nAge: 47 Years\nMarital Status: Married\nScopus Author ID: 57209400740\nORCID 0000-0003-3930-1196\nPublons Web of science Id ABB-3964-2020\nAICTE Id 1-3199093162\nJNTU Academic Audit ID 3060-160315-080646\nNew JNTU Faculty Registration ID 1050-210708-141630\nAcademic Bank of Credits ID 564-817-219-619\n10/07/2024 09:57 Resume 2/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nReviewer\n1. International Structural Engineering Conference, Chicago, USA, 2023\n2. The Fourth European and Mediterranean Structural Engineering and Construction Conference\nJune 20-25, 2022, Leipzig, Germany\n3. IEEE Access\n4. Advances in Structural Engineering Journal\nList of Publications\nInternational Journals (Scopus Indexed)\n1. Sahithi, KNV Chandrasekhar, “Isogeometric Topology Optimisation of continuum structures using\nEvolutionary algorithms”, J. Appl. Comput. Mech, DOI: 10.22055/JACM.2018.26398.1330\n2. KNV Chandrasekhar, V Bhikshma, Syed Abdul Mohi “On the six node hexagon elements to perform\ntopology optimisation of plates carrying in plate loading and shells carrying out of plane loading” J.\nAppl. Comput. Mech., 6(3) (2020), DOI: 10.22055/JACM.2019.28993.1532\n3. KNV Chandrasekhar, V Bhikshma, K Udaya Bhaskara Reddy “Topology optimisation of laminated\ncomposite shells” J. Appl. Comput. Mech, In the press 8(2), 2022\nInternational Journals (Web of Science Indexed)\n4. KNV Chandrasekhar, V.Bhikshma, Ch.Madhusudhana Chary, Maduri Venkatsai “Cubic B-splines for\nIsogeometric Analysis of Laminated Composite Plates Subjected to Hygroscopic Loading Using\nClassical Laminated Plate Theory,” Journal of Polymer & Composites, Vol.9, Issue 3, December 2021.\nISSN: 2321-2810 (Online), ISSN: 2321-8525 (Print). DOI (Journal): 10.37591/JoPC\nIndexed in Civilica\n1. KNV Chandrasekhar, V Bhikshma, N Rakesh, Swapna Reddy, C Rakesh “Isogeometric analysis for\ntopology optimisation of two dimensional planar and laminated composite plate continuum structures,” J.\nSolid Mech., 13(2), 2021\nInternational Conferences\n1. B.Archana, K.N.V.Chandrasekhar, Dr. T. Muralidhara Rao \"Topology Optimization of Continuum\nStructures Using Firefly Algorithm\" Proceedings of 61st Congress of ISTAM (http://istam.iitkgp.ac.in)\nHeld at: VITU - Vellore, India, Dec. 11-14, 2016\n2. Sravali, Thulla, KNV Chandrasekhar, TMRao \"A study on Performance Based Indices to perform\nTopology Optimisation of Continuum Structures using Swarm Intelligence Firefly Algorithm - II\" 62nd\nCongress of ISTAM, IITKGP, To be held at: OU - Hyderabad, India, Dec. 15-18, 2017\n3. NSS Sahithi, KNV Chandrasekhar,TM Rao \" Multi population parallel search engines to perform\nIsogeometric Topology Optimisation of continuum structures using Swarm Intelligence Aqua Search\nalgorithm\" 62nd Congress of ISTAM, IITKGP, To be held at: OU - Hyderabad, India, Dec. 15-18, 2017.\n5. KNV Chandrasekhar et.al. “Evolutionary algorithms for performance based topology optimisation of\ncontinuum structures,” MJCET\n6. KNV Chandrasekhar, V Bhikshma, M VenkatSai “Cubic b-splines for isogeometric analysis of\nlaminated composite plates subjected to hygroscopic loading” VSAM, January 2021\n7. KNV Chandrasekhar et.al., “Isogeometric analysis to perform topology optimisation of planar reinforced\nconcrete structures using first order b-splines,” VSAM May 2021\nNational Journals\n1. KNV Chandrasekhar \"Second order sensitivity analysis and fundamental frequency based optimisation to\nperform topology optimisation of continuum structures using evolutionary algorithm,\" i-managers journal\non structural engineering, vol. 9 l no. 2 l June - August 2020, ISSN 2278-7887\n10/07/2024 09:57 Resume 3/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\n2. KNV Chandrasekhar “Static analysis of laminated composite plate using six node linear strain triangular\nelements,\" i-managers journal on structural engineering, vol. 8 l no. 4 l December 2019 - February 2020,\nISSN 2278-7887\n3. KNV Chandrasekhar “Design of reinforced cement concrete corbel and perform free vibration and\nbuckling analysis,\" i-managers journal on structural engineering, vol. 9 l no. 1 l March - May 2020, ISSN\n2278-7887\n4. KNV Chandrasekhar “A study of free vibration and forced vibration characteristics of laminated\ncomposite elliptical paraboloid shells,\" i-managers journal on structural engineering, vol. 9 l no. 1 l March\n- May 2020, ISSN 2278-7887\n5. KNV Chandrasekhar “Optimisation of steel transmission tower structure using firefly algorithm,\" i-\nmanagers journal on structural engineering, vol. 6 l no. 2 l June - August 2017, ISSN 2278-7887\n6. KNV Chandrasekhar “Bending characteristics of reinforced concrete beams,\" i-managers journal on\nstructural engineering, vol. 6 l no. 3 l September - November 2017, ISSN 2278-7887\n7. KNV Chandrasekhar “A step by step procedure to perform isogeometric analysis of beam and bar\nproblems in civil engineering including sizing optimisation of a beam,\" i-managers journal on structural\nengineering, Vol. 7 | no.1 | Mar - May 2017, ISSN 2278-7887structural engineering, Volume 6. no. 4\nDecember 2017-February 2018, ISSN 2278-7887\n8. KNV Chandrasekhar “A step by step procedure to perform hygroscopic analysis of laminated composite\nplate using six node linear strain triangular elements with coding in ForTran®,\" i-managers journal on\nstructural engineering, Vol. 9 l no. 4 l December 2020 - February 2021, ISSN 2278-7887\n9. KNV Chandrasekhar “A study on parameters of firefly algorithm for topology optimisation of\ncontinuum structures – II,\" i-managers journal on structural engineering, Vol. 6 l no. 1 l March - May\n2017, ISSN 2278-7887\n10. KNV Chandrasekhar “Free vibration analysis of laminated composite conoidal shells using six node\nlinear strain triangle elements,\" i-managers journal on structural engineering, Vol. 8 l no. 3 l September -\nNovember 2019, ISSN 2278-7887.\n11. KNV Chandrasekhar “A comparative study on evolutionary algorithms to perform isogeometric\ntopology optimization of continuum structures using parallel computing,\" Journal of aerospace engineering\n& technology, Vol.8 Issue 1, 2018, ISSN 2348-7887\n12. KNV Chandrasekhar “A step by step illustrative procedure to perform isogeometric analysis and find\nthe nodal displacements for a two dimensional plate structure,\" i-managers journal on structural\nengineering\n13. P. Srilatha, D.Narmada, D.Tarun Kumar, M.Arun, D.Yuva Kumar, KNV Chandrasekhar (2022) “First\norder basis splines to perform isogeometric topology optimisation to design the outline of the bridge pier\nand analyse using Idea Statica,” imanager Journal on Civil Engineering, Vol.12, Issue 2, May 2022\n14. KNV Chandrasekhar, V.Bhikshma (2022) “Cubic basis splines to perform topology optimisation of\nlaminated composite regular cylindrical and elliptical and hyperbolic thin shell structures using inverse\nbuckling formulation,” imanager Journal on Civil Engineering, Vol.12, Issue 2, May 2022\n15. KNV Chandrasekhar, V.Bhikshma (2022) “First Order Basis Splines to perform Isogeometric topology\noptimisation of three dimensional structures,” imanager journal on Civil Engineering, Vol.12, Issue 3,\nAugust 2022\n16. KNV Chandrasekhar, V.Bhikshma (2022) “Cubic b-splines to perform topology optimisation with\nbuckling load on carbon fibre nano reinforced simply supported cross ply laminated composite square\nplates using inverse buckling formulation,” imanager Journal of Civil Engineering, Vol.12, Issue 4,\nNovember 2022.\nList of Patents/Designs\n1. Title: Interlocking Gabion Frame for Structural wall\nDesign Application Number: 373584-001 Design application Granted Date: 04/11/2022\n10/07/2024 09:57 Resume 4/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nList of MTech Projects completed\nS. No. Project title Year\n1 Response of structural components subjected to blast loading 2016\n2 Topology optimisation of continuum structures using firefly algorithm 2016\n3 A study on performance based indices to perform topology optimisation 2017\nof continuum structures using swarm intelligence fire fly algorithm\n4 Nurbs based isogeometric analysis to perform topology optimisation of 2018\ncontinuum structures using evolutionary algorithms\n5 Second order sensitivity analysis and fundamental frequency 2018\noptimisation to perform topology optimisation of continuum structures\nusing evolutionary algorithm\n6 Free vibration and forced vibration 2019\ncharacteristics of laminated composite elliptical paraboloid shells\n7 Six node hexagon element to perform static analysis, vibration analysis 2019\nand topology optimisation of continuum structures\n8 Free vibration analysis of laminated composite conoidal shells using six 2019\nnode linear strain triangle elements\n9 Strain Energy based and fundamental frequency based topology 2019\noptimisation of laminated composite plates and shells\n10 An experimental investigation on nano concrete for bubble deck slab 2019\nmixed with graphene oxide\n11 Bending characteristics of laminated composite plates and shells having 2020\ncutouts subjected to hygroscopic loading\n12 Cubic b-splines to perform topology optimisation with buckling analysis 2021\nof simply supported cross ply laminated composite square plates\n13 First order b-splines to perform topology optimisation of three 2021\ndimensional continuum structures\n14 First order b-splines to perform topology optimisation of two 2021\ndimensional reinforced concrete structures using optimality criteria\nList of BTech Projects\nS.No. Title of the Project Year\n1. Design and analysis of bridge pier using idea statica® 2022\n2. Design and analysis of pratt truss bridge joint using idea statica® 2022\n3. Residual compressive strength of concrete cubes mixed with nano alumina 2023\nat high temperatures and estimate stress strain behavior using machine\nlearning - wip\n10/07/2024 09:57 Resume 5/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 6,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\n10/07/2024 09:57 Resume 6/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}