{
  "document_name": "Kim, David (334601415).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Kim, David; DOB: 11/16/1992; ID: 334601415\n709 Audubon Lake Drive Apt P, Durham, NC, 27713\n(505)-917-8245 | davidkim@gatech.edu | https://www.linkedin.com/in/davkime/\nDAVID KIM\nEDUCATION\nGEORGIA INSTITUTE OF TECHNOLOGY JAN 2019 - MAY 2021\nMasters of Science in Computer Science, Specialization in Machine Learning GPA 4.0/4.0\nPython, Numpy, Pandas, Scikit-learn, SVMLight, Hadoop, Pig, Hive, Scala, Spark, Spark SQL, Spark MLlib, Spark GraphX,\nPyTorch, OpenCV\nUNIVERSITY OF NEW MEXICO AUG 2017 - DEC 2018\nNon-Degree GPA 3.89/4.3\nCovered fundamental CS courses required for graduate computer science school.\nFULLSTACK ACADEMY SEP 2015 - DEC 2015\nY combinator funded immersive coding school focused on MEAN (MongoDB, Express, AngularJS, and Node) stack.\nMongoDB, Mongoose ODM, ExpressJS, AngularJS, NodeJS\nUNIVERSITY OF ROCHESTER AUG 2010 - MAY 2015\nBachelor of Science in Optical Engineering GPA 3.16/4.0\nRecipient of Dean’s Scholarship - $40,000\nRESEARCH\nCELLARITY APR 2023 – PRESENT\nAssist publication efforts by training internal models and comparing against public methods.\nDUKE DEC 2022 – PRESENT\nGenerate a vectorized random walk small intestine model with multiprocessing and 3D visualizer.\nGEORGIA TECH JAN 2021 – MAY 2021\nDevelop cognitive presence classifier on student forums for an in Georgia Tech.\nWORK HISTORY\nCELLARITY JUNE 2021 – PRESENT\nSenior Software Engineer Boston, MA\nMigrated company data from Benchling to Microsoft Sharepoint. Created data visualizations for gene embeddings. Developed\nAPI for model inference. Maintained web scraper for medical journals. Deploy ML models on AWS servers. Assist in\npublication efforts through model retraining, benchmarking, and paper reproduction.\nPython, JavaScript, Postgres, MongoDB, SQL, AWS, pytest, Benchling, Dotmatics, Microsoft Graph API, React, Apache Echarts,\nFastAPI, Docker, Hasura, BentoML, Weights and Biases, Pytorch, Pandas\nSANDIA NATIONAL LABS DEC 2019 – JAN 2021\nContractor, Software Developer Albuquerque, NM\nDeveloped and maintained quality management service applications for the NNSA through feature development, bug fixing,\nand web server migration.\nSQL, Java, Spring, RichFaces\nPROJECT ECHO SEP 2016 – SEP 2019\nFront End Developer Albuquerque, NM\nFront end developer for an educational telemedicine network application.\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Kim, David; DOB: 11/16/1992; ID: 334601415\nAngular, Angular Material, NgRx, Loopback, MongoDB. SCSS, Node\nSKILLS\nProficient – Python, JavaScript\nKnowledgeable – Java,\nFamiliar – C, SQL\nPage | 2 [Your Name]\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}