{
  "document_name": "Kuanyshbay, Maksat (412295099).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Kuanyshbay, Maksat; DOB: 06/26/1997; ID: 412295099\nMaksat Kuanyshbay\nmk7756@cims.nyu.edu\nEDUCATION\n01/2021—12/2022 M.S. in Scientific Computing, Courant Institute of Mathematical Sciences, New York\nUniversity – New York, USA\n• Cumulative GPA: 3.7 / 4.0\n08/2016—06/2020 B.S. in Mathematics, Nazarbayev University – Astana, Kazakhstan\n• Cumulative GPA: 3.8 / 4.0\n• Magna Cum Laude\n05/2019—07/2019 Summer Studies in STEM, University at Buffalo – NY, USA\nHONORS AND AWARDS\nInternational\n11/2018 2nd Prize, The 1st Al-Khorezmi International Mathematical Olympiad – Urgench,\nUzbekistan\n05/2018—06/2018 4th Prize, 2nd International Summer School on “Mathematical Methods in Science and\nTechnology” – Almaty, Kazakhstan\n04/2018 3rd Prize, 5th North Countries Universities Mathematical Competition – Astana,\nKazakhstan\n08/2017 3rd Prize, 24th International Mathematics Competition for University Students –\nBlagoevgrad, Bulgaria\nNational\n11/2020 International Bolashak Scholarship, awarded to cover all the expenses related to\ngraduate studies at NYU in amount of $ 140,000\n04/2019 2nd Prize, Republican Olympiad in Mathematics – Astana, Kazakhstan\n04/2018 3rd Prize, Republican Olympiad in Mathematics – Almaty, Kazakhstan\n04/2017 3rd Place, Republican Student Olympiad in Mathematical and Computer Modeling –\nAstana, Kazakhstan\n2016—2018 Dean’s List\n• For attaining a semester GPA of at least 3.75 out of 4.0\n• 5 times for Fall 2016, Spring 2017, Fall 2017, Fall 2018, Fall 2019\n2014—2015 Participant of IMO Training Camps\n• Was among top 12 high school students who were gathered in winter and spring camps\nfor special training and further selection for International Mathematical Olympiad\nRESEARCH EXPERIENCE\n07/2023—Present Research Assistant, Nazarbayev University – Astana, Kazakhstan\nName of Project: Multiattribute Utility Functions under Proper Partial Utility\nIndependence Condition: Methods and Applications\nPrincipal Investigator: Yerkin Abdildin\n• Reproduced the research results from “Analysis of Decision Alternatives of the Deep\nBorehole Filter Restoration Problem” written by Y. Abdildin, A. Abbas (2016)\n• Constructed multiattribute utility functions for the cases when attributes are fully\nindependent, partially dependent and fully dependent\n05/2023—Present Research Assistant, Courant Institute of Mathematical Sciences, New York University\n– remote\nName of Project: Surgical Simulation for Manipulating the Omentum\nPrincipal Investigator: Gizem Kayar\nPage 1\n10/07/2024 09:57 Resume 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Kuanyshbay, Maksat; DOB: 06/26/1997; ID: 412295099\nMaksat Kuanyshbay\n• Studying “Working with Volumetric Meshes in a Game Engine: a Unity Prototype”\nwritten by L. Pitzalis, G. Cherchi, R. Scateni, and L. D. Spano (2020).\n• Studying numerical integration methods, including Euler’s method, Euler-Cromer\nmethod, and Verlet’s method for the implementation of mass-spring system that is used\nto create the physical representation of deformable object\n09/2022—12/2022 Graduate Project, Courant Institute of Mathematical Sciences, New York University –\nNew York, USA\nName of Project: An Augmented Large Language Model for Patent Acceptance\nPrediction\nCourse Title: CSCI-GA 2565 Machine Learning\nCourse Grade: A-\nCourse Instructor: Rajesh Ranganath\n• Designed and implemented an augmented hierarchical language model for the Harvard\nUSPTO Patent Dataset in a 3-person team using Python\n• Implemented Sentence Transformer with SciBERT word embeddings to transform the\ninput sequence\n09/2022—12/2022 Graduate Project, Courant Institute of Mathematical Sciences, New York University –\nNew York, USA\nName of Project: Emoji Diffusion\nCourse Title: CSCI-GA 2271 Computer Vision\nCourse Grade: A\nCourse Instructor: Rob Fergus\n• Experimented with a simplified version of denoising diffusion probabilistic model\n(DDPM) on an emoji dataset in a 3-person team using Python\n• Experimented with varying noise scheduler (linear and cosine), loss function (L1 and\nL2), and model architecture\n01/2022—05/2022 Capstone Project, Courant Institute of Mathematical Sciences, New York University –\nNew York, USA\nName of Project: Accelerating Ray Tracing\nCourse Title: MATH-GA 2012 Advanced Topics in Numerical Analysis: High-\nPerformance Computing\nCourse Grade: A\nCourse Instructor: Benjamin Peherstorfer\n• Designed and implemented ray tracing algorithms with parallelization in OpenMP and\nCUDA in a 3-person team using C++ on Linux\n• Implemented OpenMP parallelization of ray casting loops for different scheduling and\nnumber of threads that provided a near 3x speedup over the original algorithm\n11/2019—05/2020 Research Assistant, Nazarbayev University – Astana, Kazakhstan\nName of Project: Micro-Electro-Mechanical Systems Problem\nPrincipal Investigator: Anastasios Bountis\n• Implemented in Python professor Bountis’ pull-in solution of the main differential\nequation according to Singularity analysis\n• Found the solution using the Python implementation of the 4th order Runge-Kutta\nmethod and compared the results\n09/2018—07/2019 Research Assistant, Nazarbayev University – Astana, Kazakhstan\nName of Project: Imaging in Seismic Exploration\nPrincipal Investigator: Yogi Erlangga\n• Reproduced the research results from “The Method of Difference Potentials for the\nHelmholtz Equation Using Compact High Order Schemes” written by M. Medvinsky,\nS. Tsynkov, E. Turkel (2012)\n• Learned to derive polar forms of the 1st and 2nd approximations of the highly absorbing\nlocal boundary conditions using conformal mapping\n• Used five-node stencil for the numerical approximation of both solution and data\nPage 2\n10/07/2024 09:57 Resume 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Kuanyshbay, Maksat; DOB: 06/26/1997; ID: 412295099\nMaksat Kuanyshbay\n• Applied the method of difference potentials in 2D space for circular domain\nRESEARCH INTERESTS\nMy research interests primarily lie with the mathematical foundations of machine learning. I am also interested in\nthe application of numerical methods in differential equation solvers for Computational Fluid Dynamics, 3D\nReconstruction in Computer Graphics and Virtual Reality, and Optical Flow of Fluids in Computer Vision.\nPUBLICATIONS\n1. Skrzypacz, P, He, J‐H, Ellis, G, Kuanyshbay, M. A simple approximation of periodic solutions to\nmicroelectromechanical system model of oscillating parallel plate capacitor. Math Meth Appl Sci. 2020;\n1– 8. https://doi.org/10.1002/mma.6898\nWORK EXPERIENCE AND UNIVERSITY SERVICE\n01/2021—12/2022 Recitation Leader, Courant Institute of Mathematical Sciences, New York University\n– New York, USA\nCourse List: Honors Linear Algebra, Math for Economics\n• Worked 10 hours per week as a recitation leader for the class of around 70 students at\nthe Courant Institute of Mathematical Sciences\n• Held weekly recitation sessions and office hours, proctored, graded, and gave feedback\non students' quizzes and exams\n01/2021—12/2022 Grader, Courant Institute of Mathematical Sciences, New York University – New York,\nUSA\nCourse List: Graduate Computer Graphics, Numerical Analysis, Linear, Nonlinear\nOptimization\n• Worked 10 hours per week as a grader for the class of around 40 students at the\nCourant Institute of Mathematical Sciences\n• Held weekly office hours, graded, and gave feedback on students' assignments\n08/2018—05/2019 Board Member of the Student Government, Nazarbayev University – Astana,\nKazakhstan\n• Actively participated in organizing events such as: Scholarship Fair, Informal Sessions\nwith Professors, Winter Camp, Midterm Preparation Nights\n08/2018—05/2019 Students’ Representative in the Self-Evaluation Group, Nazarbayev University –\nAstana, Kazakhstan\n• Participated on biweekly meetings and discussions about the University’s external\nFollow up Evaluation process by the European University Association\n06/2018—08/2018 Intern in Financial Management Department, KPMG – Astana, Kazakhstan\n• Developed a sentiment analysis algorithm to study KPMG’s perceived reputation in\nKazakhstan\n• Performed data pre-processing on unstructured data about private and governmental\ncompanies listed on Kazakhstan Stock Exchange (KASE)\n09/2015—11/2015 Mathematics for Olympiads Tutor, Nurorda High School – Astana, Kazakhstan\n• Prepared a group of high school students for regional and international competitions in\nmathematics specifically geometry, number theory, algebra and combinatorics\nTECHNICAL COMPETENCIES https://github.com/KMaxx\nPage 3\n10/07/2024 09:57 Resume 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Kuanyshbay, Maksat; DOB: 06/26/1997; ID: 412295099\nMaksat Kuanyshbay\nPython 4 completed graduate courses at New York University:\n• CSCI-GA 2271 Computer Vision (3 assignments, 1 group project)\n• CSCI-GA 2565 Machine Learning (2assignments, 1 group project)\n• MATH-GA 2010 Numerical Methods I (7 assignments)\n• MATH-GA 2704 Applied Stochastic Analysis (6 assignments)\n4 completed undergraduate courses at Nazarbayev University:\n• ROBT 407 Statistical Methods and Machine Learning (2 group projects)\n• PHYS 270 Computational Physics with Laboratory (11 laboratory sessions, 6\nassignments)\n• CSE 474 Intro Machine Learning (2 group projects)\n• ROBT 205 Signals and Sensing with Lab (2 laboratory sessions)\nMATLAB 2 completed graduate courses at New York University:\n• CSCI-GA 2945 Advanced Topics in Numerical Analysis: Convex and Nonsmooth\nOptimization (10 assignments)\n• MATH-GA 2020 Numerical Methods II (6 assignments)\n1 completed undergraduate course at Nazarbayev University:\n• ROBT 205 Signals and Sensing with Lab (11 laboratory sessions)\nC++ 2 completed graduate courses at New York University:\n• MATH-GA 2012 Advanced Topics in Numerical Analysis: High-Performance\nComputing (4 assignments, 1 group project)\n• MATH-GA 2270 Computer Graphics (6 assignments)\nMathematica 10 solved Wolfram Language Challenges in Programming & Computational Thinking,\nthat helped to get acceptance for Wolfram Summer School.\nJava 1 completed undergraduate course at Nazarbayev University:\n• CSCI 152 Performance and Data Structures (11 laboratory sessions, 2 assignments)\n12-week app development bootcamp\nC 1 completed undergraduate course at Nazarbayev University:\n• CSCI 151 Programming for Scientists and Engineers (11 laboratory sessions, 2\nassignments)\nMATHEMATICAL COURSEWORK\nAdvanced Partial Differential Equations, Fluid Dynamics, Nonlinear Differential Equations, Probability,\nMathematical Statistics, Regression Analysis, Real Analysis, Applied Finite Element Methods\nLANGUAGES\nEnglish (Fluent), Kazakh (Native), Russian (Fluent), Turkish (Conversational)\nREFERENCES\nProf. Robert V. Kohn Prof. Leslie Greengard\nEmail: kohn@cims.nyu.edu Email: greengar@cims.nyu.edu\nProf. Sylvia Serfaty Prof. Yogi Erlangga\nEmail: serfaty@cims.nyu.edu Email: yogi.erlangga@zu.ac.ae\nPage 4\n10/07/2024 09:57 Resume 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}