{
  "document_name": "Kumar, Piyush (445177306).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Kumar, Piyush; DOB: 09/22/2000; ID: 445177306\nPIYUSH KUMAR\n+1 646-240-8689|piyush.k@columbia.edu|https://www.linkedin.com/in/piyushskumar/\nEDUCATION\nColumbia University, New York, NY\nMasters of Science in Chemical Engineering; GPA: 3.92/4 Expected Dec 2023\n• Relevant Coursework: Computer Simulations in Biology, Solid State Chemistry in Pharmaceutical, Advanced Chemical Kinetics, Advanced Chemical\nEngineering Thermodynamics, Project Management.\nDwarkadas J. Sanghvi College of Engineering, Mumbai, IN\nBachelor of Engineering in Chemical Engineering; CGPA: 9.31/10 Jun 2022\n• Relevant Coursework: Biotechnology, Mass Transfer, Engineering Chemistry, Chemical Reaction Engineering.\nWORK EXPERIENCE\nColumbia University, New york, NY May 2023 - Present\nStudent Research Worker\n• Assembling proteins in pET vector and designed its primers by using Benchling and NEbuilder Assembly tool in tandem.\n• Performing heterologous protein expression via cell culture technique and purified it using affinity chromatography.\n• Performing FRET and CD to study the metal binding affinity of the different proteins obtained with 8 rare earth metals.\n• Conducting protein-ligand molecular docking using various software tools to analyze protein binding sites.\n• Managing technical training of interns, resulting in a 33.33% reduction in the time required to gather data on various proteins.\nColumbia University, New york, NY Sep 2023 - Present\nGrader\n• Working for CHEN E4800 Protein Engineering with prof. Scott Banta to grade homework and exams.\nColumbia University, New York, NY Jan 2023 - May 2023\nGraduate Research Assistant\n• Gained hands-on experience in molecular cloning techniques and standard laboratory procedures such as calibration of bioreactor, autoclaving, gel\nelectrophoresis, DNA extraction, and FPLC protein purification technique.\n• Altered DNA sequences using Gibson Assembly and restriction digest and cultured them in E-coli.\nAdage Automation Private Limited, Verna, IN Jul 2021 - Jul 2021\nEngineering Intern\n• Received hands-on experience with respect to process gas analyzer, gas chromatograph, and CV analyzer along with its applications.\nAaharya Technologies, Vijayawada, IN Feb 2021 - Mar 2021\nEngineering Intern\n• Designed 80% of flowsheet of Dimethyl-Ether manufacturing plant on Aspen Hysys single handedly and designed more than 10 heat exchangers using\nAspen Exchangers software and succeeded in its energy optimization by approximately 60%.\nPROJECTS AND RESEARCH\nColumbia University, New york, NY Sep 2022 - Dec 2022\nBiopharmaceutical Process Laboratory\n• Performed protein purification on a mixture of lysozome and α-chymotrypsinogen by employing ion-exchange chromatography, analyzed the\nchromatograms for retention time, absorbance and improved the resolution to a value of 1.86.\n• Conducted an Powdered X-Ray Diffraction (PXRD) analysis on crystals grown under 5 different conditions to assess its characteristics.\n• Conducted a water permeability test and the desalination of water by employing the tangential filtration model with a 5k membrane.\n• Simulated fermentation conditions by varying agitation and flow rates in the bioreactor during depletion and replenishing of oxygen.\n• Compacted a blend of MCC and tartrazine by using MTS machine at 3 different pressures and then tested its solubility properties.\nDwarkadas J. Sanghvi College of Engineering, Mumbai, IN Jul 2021 - Apr 2022\nManufacturing of Sorbate and Sorbic Acid\n• Performed material and energy balance for more than 15 equipments, devise and simulated process flow sheets using Smartdraw and Aspen Hysys and\nworked on optimization of the process and modified the process thus increasing the flexibility of the process.\nTECHNICAL SKILLS\n• Laboratory Skills: Chromatography (Ion exchange - UNICORN software, Affinity, AKTA), Optical Microscopy, PXRD analysis, Compaction (MTS 7\nkip compaction system), Filtration (minimate TFF capsule), Western Blot, Gel Electrophoresis, PCR, electroporation, Primer Design and Plasmid\nConstruction (Benchling, NEbuilder Assembly tool), SDS-PAGE, Western Blot, Staining, Buffer and Media Preparation, Cell Culture, DNA extraction\n(Plasmid and Genomic), RNA extraction, FRET (Softmax Pro Software), Nanodrop.\n• Programming Language: Python (NumPy, Pandas).\n• Simulation Softwares: Autodock, PyRx, Vega ZZ, Open Babel GUI, Avogadro, PyMOL, AlphaFold, Aspen (Hysys, EDR), Polymath, Sympy, Chemsep,\nMATLAB, AutoCAD, Canva, Smartdraw.\nLEADERSHIP AND ACTIVITIES\n• Selected as the MS Ambassador of the chemical department to mentor the incoming MS candidates with their program onboarding.\n• At PACE EOS, spearheaded a 40-member team and collaborated with 14+ institutions' committee heads to ensure seamless execution of events with\nnational-level celebrities.\n• Completed the Bronze level of Duke of Edinburgh Awards.\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}