{
  "document_name": "Dai, Shengwei (493075143).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Dai, Shengwei; DOB: 09/08/1998; ID: 493075143\nShengwei Dai\n4212 28th St, Apt 11E, New York, NY 11101 • (717) 962 - 6611 • sd3436@columbia.edu • https://linkedin.com/in/dai-shengwei\nRESEARCH INTERESTS\nA Chemical Engineering graduate student who is interested in chemical, environmental, and biochemical areas with 4-year laboratory\nexperiential and analytical experience, especially the research topics about sustainable construction material and carbon capture and\nutilization.\nEDUCATION\nColumbia University, The Fu Foundation School of Engineering and Applied Science, New York, NY\nMaster of Science in Chemical Engineering, GPA: 3.7/4.0 Expected Dec 2023\nCourses: Advanced Chemical Engineering Thermodynamics, Atmospheric Aerosols, Solid Waste Management, Polymer Physics, Process\nControl and Safety, Solid State Chemistry, Surface Reaction & Kinetics\nColumbia University, The Fu Foundation School of Engineering and Applied Science, New York, NY\nBachelor of Science in Chemical Engineering, GPA: 3.8/4.0 Sep 2020 – May 2022\nCourses: Topics in Soft Materials, Process & Product Design, Linear Algebra, Transport Phenomenon, Alternative Energy Resources,\nChemical Engineering Thermodynamics, Energy, Mineral, Material system\nDickinson College, Carlisle, PA\nBachelor of Science in Chemistry (GPA: 3.6/4.0) Sep 2018 – May 2020\nCourses: Organic Chemistry, Inorganic Chemistry, Structures and Functions of Biomolecules, Quantum Chemistry and Spectroscopy,\nMedicinal Chemistry, Genetics\nRESEARCH EXPERIENCE\nResearch of CO Cured Cement, Columbia University, Department of Civil Engineering\n2\nJune 2023 – Present\n§ Investigated the possibility of different cement systems including MgO cement and fly ash substituted OPC for carbonation curing.\nExplored the effect of different parameters such as mix design on cement's physical properties and carbonation degree.\n§ Measured the physical properties of cement samples using various mechanical testing machines and analyzed their mineral composition\nusing the thermogravimetric analyzer.\n§ Development of suitable mix design for high CO 2 uptake cement\nChemical Stabilization of Heavy Metals in Waste-to-Energy (WTE) Fly Ash, Columbia University, Department of Earth and\nEnvironmental Engineering May 2022 – Present\n§ Conducted independent research to experimentally measure and analyze the chemical stabilization effects of WTE (Waste-to-Energy)\nfly ash, with a focus on ensuring safe disposal in landfills or its reuse in civil engineering applications.\n§ Investigated the intricate reaction mechanisms involved in both inorganic stabilization and organic chelation techniques to mitigate the\npresence of heavy metals in WTE fly ash.\n§ Explored the efficacy of a single agent in reducing the leachability of heavy metals within WTE fly ash, leading to the identification of\noptimal solutions. Formulated cost-effective combinations of agents to efficiently stabilize heavy metals.\n§ Executed comprehensive leaching tests on stabilized WTE fly ash in accordance with U.S. EPA procedures and standards. Utilized ICP-\nOES for precise examination of element concentrations in leachates. Provided valuable insights into the long-term stability of\ncontaminants and their potential environmental impacts.\n§ Developed and refined an engineering-applicable stabilization procedure for WTE plants. Conducted a comparative analysis with\nexisting literature to optimize practicality and assess potential technical and economic benefits. Currently drafting the manuscript.\nResearch of Filtration Efficiency through Masks, Columbia University, Department of Chemical Engineering\nSep 2021 – May 2022\n§ Conducted an extensive investigation into the filtration efficiency of masks from major brands under the Covid-19 context, evaluating\ntheir effectiveness in filtering airborne particles\n§ Designed a specialized reaction chamber to simulate the ambient atmospheric environment for rigorous testing of mask filtration\n§ Synthesized a respiratory solution, consisting of NaCl in physiological concentration, mucin, and lung surfactants for research purposes.\nInvestigated the phase transition and evaporation properties of respiratory droplets, providing valuable insights into their behavior and\npotential impact on filtration efficiency\n§ Determined the filtration efficiency of masks offered by major brands and analyzed the size distribution of unfiltered droplets. Provided\ncustomers with essential guidance for selecting suitable products tailored to their individual needs and preferences.\nCharacterization of APTMS Coated ZnO, Dickinson College, Department of Chemistry May 2019 – July 2019\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Dai, Shengwei; DOB: 09/08/1998; ID: 493075143\n§ Conducted a comprehensive study on photocatalytic properties of unmodified and modified ZnO and their potential usages in\nwastewater treatment\n§ Synthesized unmodified and APTMS-coated ZnO for photocatalysis experiments; characterized ZnO and APTMS-coated ZnO through\nSEM and XRD\n§ developed detailed experimental design for determining photocatalytic properties of ZnO and APTMS-coated ZnO using UV-Vis\nspectrophotometer; evaluated the applicability of ZnO and modified ZnO in wastewater treatment\nPROJECT EXPERIENCE / SOCIAL SERVICE\nDesign of Co-generation Power Plant Coupled with Desal-Unit, Columbia University Sep 2021 – Dec 2021\n§ Designed a coal-fired power plant with a desalination unit, achieving desired electricity generation and ideal potable water production\nusing ASPEN\n§ Determined optimal pressure and temperature for reaction chambers; calculated plant size, running hour, estimated cost, and revenue of\ndesalination unit\n§ Optimized power plant for minimal greenhouse effect by modifying system parameters and reduced greenhouse effect by 4%\nCertified Nursing Assistant May 2018 – Aug 2018\nThe University of Pittsburgh Medical Center, Harrisburg, PA\n§ Assisted 15+ residents each shift with daily living activities, ensuring they were on time for all meals and activities; provided social and\nemotional support to improve residents’ morale\n§ Established rapport with team members, residents, and residents’ families; organized and scheduled 20+ weekly patient visits, sending\nfollow-up reminders\n§ Helped residents with daily hygiene, including showering, oral and peri care, and incontinence care; followed RN and LPN instruction\nfor a variety of activities including range-of-motion exercise and sore-relieve exercise\nPUBLICATION\n§ Yixi Tian, Shengwei Dai, Jianfeng Wang. 2023. Environmental Standards and Beneficial Uses of Waste-to-Energy (WTE) Residues in\nCivil Engineering Applications. Waste Disposal & Sustainable Energy, Published.\nTECHNICAL SKILLS\nProgramming:\n§ Python for data analysis\nSoftware:\n§ Originlab\n§ ASPEN\nLaboratory facilities:\n§ PANalytical XPert3 Powder X-ray Diffraction (XRD)\n§ TAM Air Isothermal Calorimeter analysis\n§ Inductively coupled plasma-optical emission spectrometry (ICP-OES)\n§ UV-Vis Spectrophotometer\n§ Zeiss Scanning electron microscopy (SEM)\n§ Micromeritics ASAP 2020 HV BET analyzer\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}