{
  "document_name": "Jiao, Yue (504448712).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Jiao, Yue; DOB: 05/26/1999; ID: 504448712\nYUE JIAO\n2030 Hudson St NJ, US • 949-345-9091• yj2722@columbia.edu • linkedin.com/in/yue-jiao-90580924a\nEDUCATION\nColumbia University NY, NY Dec 2023\nFu Foundation School of Engineering and Applied Science\nMaster’s degree: Chemical Engineering (concentrated on data analysis)\nRelative course: Biology simulation, Atomistic simulation.\nUniversity of California, Irvine Irvine, CA June 2022\nSchool of Physical Science\nBachelor’s degree: Chemistry (concentrated on Biochemistry)\nRelative course: Organic Chemistry, Chemical Biology, Physical Chemistry, Quantum Chemistry.\nHONOR\n• Dean's List (2019 Spring Quarter, 2021 Spring Quarter, 2021 Winter Quarter, 2020 Fall Quarter).\n• Graduated with academic honors.\nRESEARCH EXPERIENCE\nA combination of antiviral drugs inhibits SARS-CoV-2 polymerase and exonuclease and COVID-19 Therapeutic Development,\nColumbia University. New York, NY Jan2023-now\n• Assisted and trained in performing experiments to test and verify the efficiency and ability of antiviral drugs (ombitasvir) analogs\nconcentrated on exploring exonuclease inhibitors. The lab work includes setting up enzymatic assay, RNA purification, and MALDI.\n• Enzyme kinetic calculation to identify what kind of enzyme inhabitation happened to support the drug stimulation and find the target\ninsert position.\n• Organic chemicals polymer synthesis for analogs of ombitasvir.\nDissecting Inhibitor Impacts on Viral RNA Polymerase and Fidelity Control of RNA Synthesis in SARS- COV-2, University of\nCalifornia Irvine. Irvine, CA Dec 2021\n• Utilized modeling and molecular dynamic simulations dissected how activated Molnupiravir affects viral RNA and\nPolymerase and mutated proteins. transcri\n• Performed computational programming to simulate EIDD-2801 structure and calculate partial charge to find protein ption.\nmutation position when it works on the medical cure for coronavirus.\n• Implemented software of Avogadro, atom, VMD, and GreenPlanet to simulate and calculate partial charges and\nexecute chemical calculations to find the promising antiviral target position for inhibiting viral genome replication\nINTERNSHIP EXPERIENCE\nIntern of Research & Development | MP Biomedical LLC. Irvine CA\nMay 2023-now\n• Utilized bioinformatics to emulate and align next generation sequencing reads, aiding in the development of an optimized rapid\nsequencing toolkit.\n• Obtain sequences from ACC Acetyl-CoA carboxylase, merge them into the reference database, and use Miseq to analyze.\n• Conducted wet lab experiments involving six distinct DNA polymerases for qPCR and PCR applications.\nIntern of Research & Development | Yantai Ganzhiyuan Humic Acid Technology Co., Ltd YanTai China\nJune 2021 - Sep 2021\n• Analyzed how these yellow humic acid structures helped it be one good fertilizer with the main chemist.\n• Explored how to maximize one possible effect of functions of yellow humic acid to work as a fertilizer in lab.\n• Connect with clients to transfer the requirement to actual.\nIntern of Quality & Development | Shandong Wanhua Chemical Group Co.,Ltd YanTai China\nJan 2020 - March 2020\n• Performed quality testing for products and corrected operational problems. Advance the fixing of operational issues.\n• Recorded daily data and conducted relevant data analysis to delve into the problem of quality issues.\n• Handled safety control, checking and ensuring three sections of safety of storage, proper use of chemicals, and secured utilization\nof chemical equipment.\nTECHNICAL SKILLS\n• Instrument Operation: Gas chromatograph - mass spectrometry, Gel Electrophoresis, PCR, qPCR, HPLC, Column Chromatography,\nNMR, IR Spectrometry, UV-vis spectrophotometry, Plasmid Purification.\n• Computer skills: Mathematica, Biostar, Conda, Python, R, VMD, PyMol, Avogadro, MATLAB, Excel, Powerpoint, Word.\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}