{
  "document_name": "Anika, Adrita (544600210).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Anika, Adrita; DOB: 12/23/1997; ID: 544600210\nAdrita Anika\nEmail: adrita.anika@tamu.edu, adritaanika23@gmail.com Phone: (+1) 9797778466\nLinkedIn Google Scholar Github Website\nResearch Interests\nNLP, Information Retrieval, HCI, Machine Learning\nEducation\nM.Sc. in Computer Science 2021 - 2023\nDepartment of Computer Science and Engineering, Texas A&M University College Station, Texas, USA\nCGPA: 4.00/4.00\nB.Sc. in Electrical and Electronic Engineering (EEE) 2015 - 2019\nBangladesh University of Engineering and Technology (BUET) Dhaka, Bangladesh\nMajor: Communication and Signal Processing\nWork Experience\nData Science Co-op, Amazon Robotics July 2023 - Present\n• Ileveragedata-drivenmethodologiestooptimizeroboticsystems’performance,maximizecustomerreturnoninvestment\nand optimize human resources as a member of Global Safety and Support-Data Solutions and Insights (GSS-DSI) team.\nGraduate Assistant Lecturer, Department of Computer Science, Texas A&M University Jan 2023 - May 2023\n• I have worked as the principal instructor of CSCE 110: Programming I for undergraduate students.\nMachine Learning Engineer Intern, Tenstorrent Inc. May 2022 - Aug 2022\n• I have worked on developing a software stack for deep learning algorithms that can be run on the new AI processors\ncapable of delivering the best performance.\nTeaching Assistant, Department of Computer Science, Texas A&M University 2021 - 2022\n• Courses: CSCE120/121: ProgramDesignandConcepts,CSCE482: CapstoneDesign,CSCE110: ProgrammingI,CSCE\n221: Data Structures and Algorithms\nLecturer, Department of EEE, Brac University 2019 - 2021\nResearch Experience\n• Multi-evidence Natural Language Inference for Clinical Trial Data Oct 2022 - Present\nThe project aims at determining the entailment or contradiction given a hypothesis and premise of clinical trials on\nBreast Cancer which requires numerical and quantitative reasoning of natural language. We explored several BERT-\nbasedmodelstoinfusemedicalknowledge,andcomparedourperformancewiththestate-of-the-art(SOTA)models. The\nproposed approach achieved 64.24 % and 62.04 % accuracy and F1-score, respectively.\n• Estimation of Macronutrients with Continuous Glucose Monitors Jan 2021 - Aug 2021\nThe goal of the research was to estimate dietary intake automatically by analyzing the post-prandial glucose response\n(PPGR)ofameal,asmeasuredwithcontinuousglucosemonitors(CGM).Specifically,wewantedtoestimatetheamount\nof macronutrients (protein, fat, carbohydrate) from CGM responses using machine learning algorithms.\n• Search & Rescue with Drone-Embedded Sound Source Localization Sep 2018 - Nov 2020\nThe goal of the research was to develop algorithms capable of localizing a sound source based on audio recordings made\nwith an 8-channel microphone array embedded in an unmanned aerial vehicle (UAV).\n• Gaze for Responsive Interaction with 3D Avatar in Mixed Reality Environment May 2018 - Apr 2019\nThe goal of the research was to develop a real-time system where 3D avatar can respond in a virtual environment based\non the gaze-to-gaze interaction with the user.\nSkills\n• Programming: Python, R, C/C++, MATLAB, Bash, SQL, Git\n• Machine Learning: Keras, Scikit Learn, PyTorch, OpenCV, Spark, Hugging Face\n• Simulation & Design: PSpice, Simulink, AutoCAD\n1\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Anika, Adrita; DOB: 12/23/1997; ID: 544600210\nPublications\nIn Review\n• Adrita Anika, Md Messal Monem Miah, Tracy Hammond, ”Investigating the Role of Context in Evidence Retrieval for\nNatural Language Inference from Clinical Trials” AAAI Conference on Artificial Intelligence 2024\nPublished\n• Qayyum AB, Hassan KN, Anika A, et al. DOANet: a deep dilated convolutional neural network approach for search and\nrescue with drone-embedded sound source localization. EURASIP Journal on Audio, Speech, and Music Processing. 2020\nDec;2020(1):1-8.\n• A. Anika, M. Junaed-Al-Hossain, S. Hasibul Alam and Nahid-Al-Masood, Fault Detection and Classification of Power\nSystemBusbarusingArtificialNeuralNetwork,2019IEEEInternationalConferenceonPower,Electrical,andElectronics\nand Industrial Applications\n• S. Hossain, B. Debnath, A. Anika, M. Junaed-Al-Hossain, S. Biswas and C. Shahnaz, ”Autonomous Trash Collector\nBased on Object Detection Using Deep Neural Network,” TENCON 2019 - 2019 IEEE Region 10 Conference\n• A. B. A. Abdul Qayyum, A. Anika et al., ”Direction of Arrival Estimation through Noise Supression: A Novel Approach\nusing GSC Beamforming and Room Acoustic Simulation,” 2019 IEEE International Conference on Signal Processing,\nInformation, Communication Systems\n• S. Hossain, B. Debnath, S. Biswas, M. J. Al-Hossain, A. Anika and S. K. Zaman Navid, ”Estimation of Blood Glucose\nfromPPGSignalUsingConvolutionalNeuralNetwork,”2019IEEEInternationalConferenceonBiomedicalEngineering,\nComputer and Information Technology for Health\n• B. Debnath, A. Anika et al., ”Automatic Handwritten Words on Touchscreen to Text File Converter,” TENCON 2018\n- 2018 IEEE Region 10 Conference\nRelevant Projects\n• Matching Patients to Clinical Trials [Project Website]\nClinical trials are necessary for the development of novel medical treatments. The objective of this study is to address\nthe clinical trials matching problem: given a free-text summary of a patient’s health record, locate clinical trials that are\nappropriate for that patient.\n• Analysis and Visualization of Motor Vehicle Collision Data of New York City [Dashboard, Poster]\nTheprojectaimsatexploringthemotorvehiclecollisiondataofNewYorkCitythatcangiveinsightsregardingthecauses\nof such accidents which may lead to potential remedies for preventing road accidents. Specifically, the project targets to\nexplore the statistical relationship of road accidents with respect to the time of accident occurrence, types of injuries of\nthe victim, vehicle types, etc. using multiple datasets containing more than 1M rows of data which are publicly available\nfrom Open Data, City government of NYC.\n• Bringing Machine Learning into the Classroom [Slides]\nTheprojectaimsatdevelopinganinteractivelearningtooltohelplearnersunderstandalgorithmsbystep-by-stepvisual-\nization. Ithastwomainparts. TheSketch Vizenablesuserstolearnsketchgraphse.g. speedgraphs,curvaturegraphs\netc. for each data point. The system’s ML Algo Viz let users enter data points interactively, choose algorithms and\nhyperparameters,runandvisualizethemodel’strainingiteratively. Userstudyresultsdemonstratedthatusersfoundthe\ninterface easy to use & understand, it can help them learn, they will use it in the future and recommend it to others.\n• Estimation of Public Speaking Anxiety from Bio-Behavioral data [Poster]\nThe goal is to better understand individuals’ affective responses while performing public speaking tasks. Several deep\nlearning models, feature selection, feature transformation algorithms have been used on the Verbio Dataset.\nAwards and Scholarships\n• Disney Data & Analytics Women (DDAW) Award, Disney Data Analytics Conference 2022, Orlando, Florida\n• Techfest2017,IITBombayIndia,(Asia’sLargestScienceandTechnologyFestival)1strunnerup,DigitalizeCategory.\n• The Duke of Edinburgh’s International Award 2018 The Silver Standard\n• Scientific Poster Presentation, Esonance 2018, IUT, Bangladesh Champion\n• National Power and Energy Hackathon 2017, Bangladesh 1st runner up in the Smart Grid category.\n• Dean’s List Scholarship, Department of EEE, BUET Level 2, Level 3 and Level 4\nProfessional Service\nReviewer, Empirical Methods in Natural Language Processing (EMNLP) 2023\nExecutive Committee Member, Bangladesh Students Association, Texas A&M University, 2022 - 2023\n2\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}