{
  "document_name": "Palaskar, Rutwik (600922991).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Palaskar, Rutwik; DOB: 10/12/1999; ID: 600922991\nRUTWIK JAYANT PALASKAR\nrutwikpalaskar@gmail.com (cid:135) https://github.com/RutwikP\n(cid:140) https://rutwikp.github.io/ fl http://www.linkedin.com/in/RutwikPalaskar\nSUMMARY\nInterested in interdisciplinary research combining Machine Learning, Healthcare and Bioengineering.\nEDUCATION\nDuke University, Durham, USA Aug 2022\nMaster of Science (M.S.), Biomedical Engineering 3.5/4\nMIT ADT University, Pune, India Aug 2018 - Jul 2022\nB.Tech. Bioengineering 8.4/10\nEXPERIENCE/INTERNSHIPS\nDuke University Graduate Research Assistant May 2023 - Present\n• Working on Automating Traumatic Brain Injury (TBI) Assessment in Mice.\n• Utilizing an autoencoder to extract features from the EEG signals and employing these features in\nclustering and topic modeling techniques, including Latent Dirichlet Allocation (LDA), to uncover\nTBI severity clustering.\nDuke University Graduate Teaching Assistant June 2023 - Aug 2023\n• Graduate Teaching Assistant/Co-Pilot at The Fuqua School of Business.\n• Facilitated courses in Strategy, Financial Accounting, and Managerial Economics as a valuable\nmember of the instructional team.\nDuke University Graduate Research Assistant Jan 2023 - May 2023\n• Graduate Research Assistant in Computational Optics Lab under Prof. Roarke Horstmeyer.\n• Acquired and processed white blood cell image data using a microscopic system at various mag-\nnifications.\n• Developed code to annotate cells in low-magnification images and transfer annotations to higher-\nmagnification counterparts.\n• Demonstrated proficiency in maintaining and updating the lab’s websites.\nDuke University Graduate Teaching Assistant Jan 2023 - May 2023\n• Graduate Teaching Assistant for Medical Instrumentation course.\nNihilent Technologies Pvt Ltd Intern Jan 2022 - Jul 2022\n• Collaborated on developing a machine learning model aimed at detecting facial landmarks to\nenhance the precision of the company’s emotion analysis tool, Emoscape.\nUniversity of Pennsylvania Intern Jun 2021 - Dec 2021\n• Extended the capabilities of the large-scale deep learning framework GaNDLF for kidney tumor\nsegmentation utilizing computed tomography (CT) scans.\n• Implementedalgorithmstoextractintensitydistributions,amplifyingkidneyandtumorstructures.\nStony Brook University Intern Oct 2020 - May 2021\n• Refined my work on oral cancer detection.\n• Implemented histogram matching augmentation as a generalization technique over multi-site data\nfor cardiac image segmentation.\n• Extended histogram matching augmentation for generalization of machine learning models for\nOral Cancer Detection.\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Palaskar, Rutwik; DOB: 10/12/1999; ID: 600922991\nTech Smart Systems Data Science Intern Mar 2019 - Apr 2019\n• Trained machine learning models for classification and regression tasks on in-house housing prices\ndataset.\nPROJECTS\nReinforcement Learning for Generation of Novel Non-toxic Molecules\nDuke University, Machine Learning in Pharmacology Dec 2022\n• Generated non-toxic molecules from the Tox21 dataset. Employed Reinforcement Learning to\nenhance molecular generation, biasing it toward non-toxicity.\n• Successfully coupled a Support Vector Machine (SVM) predictive model with a Recurrent Neural\nNetwork (RNN) generative model to optimize molecule generation.\n• Demonstrated that reinforcement learning produced molecules biased towards non-toxicity.\nAnalysis of Spherical Aberration Correction in Microscopic Images using Physical Layers\nDuke University, Machine Learning in Imaging May 2023\n• The project aimed to enhance the robustness of machine learning models when applied to mi-\ncroscopic image data affected by spherical aberrations, a factor known to disrupt the accuracy of\nsegmentation tasks.\n• Developed an approach involving the integration of a trainable physical layer into the UNET net-\nwork architecture.\n• This solution, utilizing Zernike polynomials for correction, significantly improved segmentation\naccuracy.\nExploring Bias in Clinical Prediction Models: Does Race Effect Model Performance?\nDuke University, Intro to Biomedical Data Science May 2023\n• Evaluated the predictive capabilities of machine learning algorithms for 30-day hospital readmis-\nsion after hip fracture repair surgery, specifically examining potential performance disparities by\nrace\n• Model performance didn’t significantly differ when predicting minority patients.\nShwaas: Social Distance Tracking and Health Monitoring App\niBase Electrosoft LLP, Virtual Mar 2021\n• An App that ensures social distancing during the Covid 19 pandemic where recording a person’s\ntemperature and O2 saturation can be noted by just scanning a QR code to reduce contact and\ndecrease the chances of the virus spread.\n• View Project\nTransfer Learning for Oral Cancer Detection using Microscopic Images\nResearch Assistant, MIT ADT University Oct 2020\n• Collaborated with medical professionals at a Pune hospital to curate one of the first datasets of\nmicroscopic images for oral cancer detection.\n• Evaluated and compared the performance of transfer learning models, including ResNet-50, In-\nception V3, and MobileNet, against baseline CNNs, achieving a significant 10-15% performance\nenhancement.\n• Technical Report\nPredicting Urinary Incontinence in Elderly\nMedhacks Hackathon, Johns Hopkins School of Medicine Oct 2020\n• Built an assistive technology for the elderly to predict urinary incontinence.\n• View Project\nCollection and Utilization of Single-Use Plastics and Various Other Industrial Wastes\nSmart India Hackathon Oct 2019 - Jul 2020\n• Built a sustainable solid waste management system\n• Developed an online B2B e-commerce service for buying and selling of single-use plastics and var-\nious types of industrial wastes.\n• Developed machine learning algorithms for real-time waste classification to segregate waste.\n• View Project\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Palaskar, Rutwik; DOB: 10/12/1999; ID: 600922991\nENTREPRENEURSHIP\nProsthocentric Pvt Ltd Co-Founder Since 2019\nWe are developing innovative medical devices based on granted patents from the United States of\nAmerica (USA), European Union (EU), France, Germany, United Kingdom and Finland.\nGRANT\n1. Our start-up Prosthocentric Pvt Ltd received funding of Rs.50,00,000 ($62,500) from Biotechnol-\nogy Industry Research Assistance Council (BIRAC), Government of India for early development\nof innovative medical devices.\n2. We received another grant from Niti Aayog, Government of India of Rs. 1 Crore($1,25,000) for\nmanufacturing of our devices.\nPUBLICATIONS\n1. Rutwik Palaskar, Renu Vyas, Vilas Khedekar, Sangeeta Palaskar and Pranjal Sahu, “Transfer\nLearning for Oral Cancer Detection using Microscopic Images”, Under arXiv\n2. Shreyas Patil, Mihir Kulkarni, Shubham Hajare, Tanvi Parkhe, Rutwik Palaskar,\nDiksha Zutshi, Reema Shyamsunder Shukla, Sameer Desai, “Assistive Device for Hemiplegic Pa-\ntients”, 3D Printing, Book Chapter\nSKILLS\nPlatforms TensorFlow, PyTorch, Keras, Arduino, Django, Flask, Web Development\nProgramming Languages Python, R, Java, C, C++, HTML, CSS\nRELEVANT COURSES\nDuke University Machine Learning in Pharmacology, Signal Processing and Applied Mathematics,\nGenome Tools and Technologies, Machine Learning in Imaging, Brain Computer Interfaces, Introduc-\ntion to Biomedical Data Science, Medical Electrical Equipment, Digital Image Processing, Introduction\nto Deep Learning\nMIT ADT C, Java, Advanced Java, Machine Learning, Python, Data Mining and Warehousing,\nMicrocontrollers and Bioelectronics, Electrical engineering, Applied Mathematics, Genomics, Microbi-\nology, Biostatistics, Genetics, Molecular Biology, Genetic/Pharmaceutical Engineering, Biochemistry\nHONORS AND AWARDS\nSmart India Hackathon, Finalist 2020\nRepresented my university at the all-India level in this hackathon\nClass Representative 2019\nA mediator between students and teachers for communicating student welfare issues to the\nadministration department.\nTeam Player Award 2019\nDedication to Social Causes by Odser Charitable Trust, Pune\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}