{
  "document_name": "Adediran, Adedeji (670921615).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nADEDEJI ADEDIRAN (DJ)\nHayward, CA | aadediran2010@gmail.com | (415) 936-3622| https://www.linkedin.com/in/aadediran2010/\nBringing over 8 years of professional expertise in analytics and management, coupled with a proven ability to think analytically, collect, and\nanalyze data to initiate world-class AI solutions that drive impactful outcomes.\nEDUCATION\n2018 Master of Business Administration (MBA) Texas A&M University-Commerce\n2015 B.Sc. Computer Science/Economics Obafemi Awolowo University\nWORK & LEADERSHIP EXPERIENCE\nProgram Manager, Global Sales Operations and Analytics\nVisa Inc.\n❏ Define and implement automated executive reporting solutions, measuring key performance indicators\n(KPIs), providing comprehensive pipeline and product reviews, and supporting sales planning.\n❏ Lead and manage a team of data analysts, data scientists, and business intelligence professionals, providing\nguidance, mentorship, and career growth opportunities.\nSan\nNov 2019 – ❏ Oversee the creation of tailored monthly reports and interactive dashboards using tools like PowerBI,\nFrancisco,\nPresent Tableau, and PowerPoint, enabling executives to make informed business decisions based on data-driven\nCA (USA)\ninsights.\n❏ Ensure data governance and quality standards are implemented and continuously improved, maintaining the\nintegrity and reliability of analytics outputs.\n❏ Drive the adoption and utilization of advanced analytics techniques, including machine learning algorithms,\nto develop innovative solutions addressing complex business challenges and driving 23% revenue growth.\n❏ Stay updated with industry trends, emerging technologies, and best practices in analytics to recommend\nadvancements that enhance the organization's analytics capabilities.\nSales Strategy & Operations Analyst\nGoogle\n❏ Collaborated with program managers to generate valuable business insights, drive process improvement,\nand formulate effective strategies using Google Doc, Google Sheets, and Plx Dashboards.\nRedwood\nJan 2019 – ❏ Designed and implemented data pipelines and monitoring systems to track key performance indicators\nCity, CA\nOct 2019 (KPIs) at the business and representative levels, resulting in a notable 7% quarter-over-quarter increase in\n(USA)\npitch rate.\n❏ Provided leadership in project management and successfully managed global projects, resulting in significant\ntime and resource savings of 40 hours per vendor headcount within the program.\n❏ Recommended, developed, tracked, and reported performance metrics using PLX dashboard, Trix, and\nGoogle Doc, ensuring accurate measurement and evaluation of business performance.\nData Analyst & Business Consultant\nXerox\n❏ Partnered with cross-functional stakeholders to identify and define strategic business issues that required\nJun 2015 – Lagos\nanalysis.\nJul 2017 (Nigeria)\n❏ Synthesized and consolidated findings and recommendations into concise and visually compelling\npresentations using Excel and PowerPoint.\n❏ Utilized A/B testing techniques with Optimizely to enhance customer engagement and achieve a notable\n12% increase in sales conversion rate.\nLecturer\nHassan Usman Katsina Polytechnic\n❏ Developed and delivered engaging lectures on various computer science topics, including programming\nApr 2016 – Katsina\nlanguages like Python, R, and Excel.\nMar 2017 (Nigeria)\n❏ Prepared and implemented lesson plans, assignments, and assessments to evaluate student learning and\nprogress.\n❏ Fostered an inclusive and supportive classroom environment that encourages active participation and\ncollaboration.\nSKILLS\nSQL/VQL/DremelSQL Communication/PowerPoint Salesforce/Dynamics\nMachine Learning Alg./ Python/R Data Analysis/Research Business Intelligence/Excel\nData Visualization/Tableau/Power BI Google Sheets/Doc/Slide Google SQL/Plx/Hue/Hive/Hadoop\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPROFESSIONAL QUALIFICATIONS\nMassachusetts Institute of Technology\nJune 2017 Machine Learning for Big Data and Text Processing\n(MIT)\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}