{
  "document_name": "Pradhan, Piyush (703824610).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Pradhan, Piyush; DOB: 09/02/2000; ID: 703824610\nPiyush Pradhan\n(646) 354-8427 | piyush.pradhan@columbia.edu | www.piyushpradhan.com | www.linkedin.com/in/piyush-p-pradhan/\nEDUCATION\nColumbia University, New York, NY, GPA: 3.7/4/0 Expected Dec 2023\nMaster of Science in Mechanical Engineering, Robotics Concentration\n· Coursework: Robotic Studio, Control Theory, Data Science for Mechanical Engineers, Digital Control Systems, Robot\nLearning, Digital Manufacturing, MEMS Production & Packaging.\nBITS Pilani University, Goa, IN, GPA: 8.67/10 Jun 2022\nBachelor of Engineering in Mechanical Engineering\n· Coursework: Fluid Mechanics, Microfluidics, Computational Fluid Dynamics, Finite Element Method, C Programming.\nPROJECTS AND RESEARCH\nJLBM.jl,Columbia University June 2023 – Present\nGraduate Research\n· Developed a GPU-accelerated Lattice Boltzmann Method based solver under the guidance of Dr. Shaina Kelly, Columbia\nUniversity\n· Programmed the software in high-performance Julia language to accurately simulate porous media flows.\n· Leveraged CUDA libraries and meticulously designed data structures to craft high-performance kernels, attaining 90%\nmemory throughput on NVIDIA GPU’s.\n· Validated the software for various 2D and 3D cases.\nOsbot, Columbia University Aug 2022 – Jan 2023\nCourse Project\n· Designed and fabricated a 6DoF bipedal walking robot (youtube video).\n· Produced parts, assembly drawings and Bill of Materials (BOM) using Solidworks and GD&T.\n· Utilized Design for Assembly (DFA) and Design for Additive Manufacturing (DFAM) principles to reduce the fabrication\nand assembly time of the robot.\n· Manufactured parts using 3D printing (FDM) and laser cutting.\n· Developed an inverse kinematics model for bipedal walking in Python.\nNumerical Analysis of Tandem Flapping Foils, Chalmers University of Technology, Sweden Jan 2022 - May 2022\nUndergraduate Thesis\n· Examined the flow physics of synchronous flapping foils using Computational Fluid Dynamics software OpenFOAM.\n· Utilized geometry conforming Chimera meshes to reduce the computation time by 15h.\n· Identified the primary thrust generation mechanism and vortex interactions necessary for maximum performance.\n· Performed parametric study for different symmetric and asymmetric spacing conditions between the airfoils.\n· Analyzed and post-processed the results using Python and Matlab.\nLaminar Flow Control for Flow Past Semi-Circular Cylinder , BITS Pilani University Aug 2021 - Dec 2021\nUndergraduate Research Assistant\n· Numerically analyzed the drag reduction in the case of semi-circular cylinder using OpenFOAM.\n· Evaluated the utility of notches for passive flow control for different notch geometries.\n· Performed parametric study for different notch dimensions and achieved maximum drag reduction of 4%.\nParametric Study of Fully Passive Tidal Energy Extractor, University of Glasgow May 2021 - Jan 2022\nResearch Intern\n· Developed a Julia based one-way coupled solver using Vortex Methods to model the performance of a tidal energy turbine.\n· Computed a parametric map of energy extraction efficiency for different structural properties.\n· Identified the structural parameters for maximum energy extraction.\nDevelopment of Finite Element Method - FSI Solver, BITS Pilani University\nUndergraduate Research Assistant Jan 2021 - May 2021\n· Developed software to model one and two-way coupled fluid structure interactions using Finite Element Method (FEM)\nsoftware in MATLAB.\n· Developed a high performance mesh parser to reduce mesh input time by 12% .\n· Validated the efficacy and accuracy of the solver by comparing with results from the literature.\nTEACHING EXPERIENCE\nRobotic Studio, Course Assistant, Columbia University Jan 2023 - May 2023\n· Offered direction to approximately 100 students on diverse aspects of robot design encompassing CAD design (Solidworks,\nNX, Fusion 360), assembly of electronic components within enclosures, simulation and modeling of robots utilizing\nPyBullet & MuJoCo, and thermal and flow simulations using FlowthermXT.\n· Created custom Python code to facilitate the integration of camera and IR sensor modules.\nINTERNSHIP EXPERIENCE\nDHIO Research and Engineering, Bangalore, IN May 2020 - Jul 2020\nSummer Intern\n· Analyzed flow past a cyclone separator of given dimensions and estimated its separation efficiency for air-saw dust mixture\nnumerically using ANSYS Fluent.\n· Documented the efficacy of numerical predictions for evaluating separation efficiency of cyclone separator.\nSKILLS & INTERESTS\nProgramming & Development: Matlab, Python, Julia, C++, C, OpenGL, Bash, Linux, Git\nSoftware: Solidworks, NX, Creo/Pro-E, CATIA, Fusion 360, nTop, ANSYS, OpenFOAM, COMSOL, Paraview, Gmsh, Salome\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}