{
  "document_name": "Zhuang, Chris (715195754).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Zhuang, Chris; DOB: 10/10/2001; ID: 715195754\nChris Zhuang\n(832) 670-5777 | chriszhuang0824@utexas.edu\nE DUCATION\nBachelor of Science, Electrical and Computer Engineering, Mathematics, Dec/2023\nThe University of Texas at Austin\nOverall GPA: 3.64/4.00\nRelevant Coursework: Data Science Lab and Principles, Brain Computer Interfaces, Neural Engineering,\nGenomic Signal Processing and Data Science, Real-Time Digital Signal Processing Lab, Digital Image Processing\nW ORK EXPERIENCE\nUndergraduate Researcher, HST-Wellman Biomedical Optics REU, 06/2023 – 08/2023\n• Use OCT to image nerves and label dataset for computer vision.\n• Apply new computer vision and imaging algorithms to do object segmentation on nerves.\n• Analyze the results from object segmentation for OCT.\nU ndergraduate Researcher, Computational Biology REU, 05/2022 - 07/2022\n• Implemented transformers and added parameters to neural network to predict covid cases.\n• Presented research to REU faculty and participants.\n• Communicated with professor to complete research.\nUndergraduate Researcher, University of Texas at Austin, 08/2022 – 12/2022\n• Preprocess EEG data by filtering in gamma bands, using Fourier Transform, and calculating PSD.\n• Apply machine learning methods to try to predict spikes in the filtered data.\n• Analyze the results and discover reasons for data trends.\nU ndergraduate Course Assistant, University of Texas at Austin, 01/2023– 5/2023\n• Held office hours and calculus lab sessions to assist students.\n• Help lead discussion sessions to review concepts for lectures.\n• Communicated with the professor and the rest of the teaching team.\nE CE Undergraduate Teaching Assistant, University of Texas at Austin, 08/2021 - 12/2021\n• Held office hours to assist students in probability.\n• Coordinated with the teaching team.\n• Assisted professor in grading and checking quizzes.\nS KILLS\nMachine Learning implementation: Python, MATLAB\nAlgorithm development: MATLAB, Java, Python, C++\nHigh-Level languages: Python, C, C++\nAssembly languages: LC3, ARM Cortex-M4F\nA CCOMPLISHMENTS\nCharles W. and Margaret A. Tolbert Endowed Scholarships and Fellowships in ECE, 2023\nActive Member, Institute of Electrical and Electronic Engineers (IEEE), 2021–Present\nActive Member, Biomedical Engineering Society (BMES), 2020-Present\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}