{
  "document_name": "Myadam, Nishkal Gupta (737840932).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Myadam, Nishkal Gupta; DOB: 11/11/1997; ID: 737840932\nM Nishkal Gupta\n+918712749952 | mnishkalgupta@gmail.com | nimy18@student.bth.se\nAbout Me\nA self motivated technology enthusiast interested in bringing useful and creative ideas into existence by applying\nmy expertise by the knowledge gained from my education and industrial experience. Always looking to take up\nresearch roles that push my limits to get the best out of me which would benefit the society as well as the\nresearch community.\nProfile Links\nLinkedIn, GitHub, Personal Website\nEducation\nBlekinge Institute of Technology Karlskrona, Sweden\nMasters in Science, Dept of Computer Science Jan. 2019 – Oct 2020\nJawaharlal Nehru Technological University Hyderabad, India\nMasters in Technology in Electronics Engineering,Emphasis on Telecommunication Systems June 2018 – Jan 2019\nJawaharlal Nehru Technological University Hyderabad, India\nBachelors in Electronics and Communication Engineering Aug 2015 – May 2018\nExperience\nMLOps Research Engineer December 2022 – Present\nOne Convergence Hyderabad, India\n• Software Developer to research and develop functions and tools for an end to end MLOps platform called Dkubex\nwhich is involved in AI product development. I typically work with integrating open source ML tools and large\nlanguage models into the platform which is built by leveraging the power of Kubernetes and MLflow, I have also\nintegrated and worked with flyte ml pipelines for use cases in life science. Currently I am designing an developing\nan architecture for building a software router that helps multiple LLM’s to communicate with each other and also\nto scale up and down the LLM services on demand, the router acts a proxy between chatbot and LLM services\nincluding agents to complete a task.\nFounder April 2022 – Nov 2022\nSKN Technologies Hyderabad, India\n• Founder of an AI/ML consulting startup for providing clients with solutions for their business problems using some\nof the cutting edge AI/ML and MLOps tech stack.\nSoftware developer for 5G packet core Aug 2021 – Feb 2022\nEricsson AB Gothenburg, Sweden\n• Developer to maintain products (units, nodes, networks, systems and solutions) including all development activities\nsuch as: requirement analysis, system design, architecture design, hardware design, software design, integration,\nverification, simulations, tools design, product life cycle management support and product documentation.\nResearch Assistant June 2019 – September 2019\nBlekinge Institute of Technology Sweden\n• Worked as a research assistant under Professor Siamak Khatibi, I supported him on two projects, first one being\ndata simulation and analysis using various statistical as well as machine learning models majorly related to\nmarkovian chain model for supporting the communication network of a bus. Second project involved with\ndeveloping of a own algorithm for path planning of a turtlebot 2 robot and it’s comparison with A* and dijkstra’s\nalgorithms for performance evaluation.\nTechnical Intern May 2018 – June 2018\nCaribou Technologies Hyderabad, India\n• Worked on IoT tech stack (Raspberry Pi, Linux OS and customized sensors), developing and testing functionalities\nusing C and Python libraries over the cloud for building smart lock solutions as part of the home automation\nproject in collaboration with cross country team in India and Canada.\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Myadam, Nishkal Gupta; DOB: 11/11/1997; ID: 737840932\nResearch Work\nReduced sampling method for robotic path planning Ongoing\n∗ Designing an algorithm to generate less and optimal sampling points when compared to probabilistic road\nmap(PRM) and rapidly exploring random tree(RRT). The algorithm is first being implemented in 2D\nenvironment by converting the map into a Cartesian plane. Unlike PRM and RRT this algorithms focuses on\nconnecting the start and goal points using shortest distance which is a straight line and whenever an obstacle is\nencountered it traverses across it’s perimeter by making sampling nodes and equal interval, at every interval it\nchecks if the straight line from it to the goal is in free space configuration, if so path is found or else the process\ncontinues until the whole perimeter of the obstacle is traversed and later shifts to other obstacles if any. Aim of\nthis process is to eliminate the complexity and no of sampling nodes done by previous algorithms.\nMaster Thesis - Design of Key-exchange Mechanisms using Blockchain. Jan 2020 – Oct 2020\n∗ Designed and analyzed a framework by performing extensive research for adapting a decentralized PKI for key\nexchange mechanisms for software artifacts for micro-services with the help of blockchain technologies.\nResearch on Fraud Detection in Online Payment Aug 2019 – Nov 2019\n∗ Performed an SLR on Online Fraud Detection using various Machine Learning techniques and built a framework\nto analysis the same practically.\nResearch on Trusted Computing in Containers Aug 2019 – Nov 2019\n∗ Literature review describing various technologies and proposals for building trust in cloud based containers. The\nmain focus of this paper is to study the trusted platform module (TPM) and it’s relationship with container\ntechnology.\nProjects\n·\nBuilding Electric bike from scratch\n· Designed and built an electric bike from scratch using renewable material for the bike chassis, a DC rear hub\nmotor, a 2kw hour battery, reused battery management system and other electronic parts.The entire bike was\nbuilt under 1000 dollars.\n·\nAutomatic Labelling using Machine Learning\n· Implemented a machine learning tool for automatically labelling the raw sensor data and later generating\nfeatures from it. Principal component analysis and Kmeans were the 2 algorithms used.\n·\nObstacle Detection Robot\n· Built an obstacle detection robot with the help of arduino, camera, and ultrasonic sensor for a college robot\nfestival.\n·\nHand Gesture Recognition\n· Developed a software using python and AutoGUI along with arduino and ultrasonic sensor for handling laptop\nfunctions with hand gestures.\n·\nPath Follower Robot\n· Used arduino uno along with ultrasonic sensor, camera module and a robot structure built out of scratch to\nmake it follow a neon tape for a robot competition.\n·\nCryptocurrency using Blockchain\n· Built a Cryptocurrency similar to Bitcoin using python and Flask API.\n·\nPrediction and Analysis of Spam Emails using Machine learning models\n· Performed an experiment to compare the computational and predictive performance of ML models on a spam\ndetection task. Ten-fold validation test was conducted to estimate the performance of a model in general,\nfollowed by statistical test such as nemenyi and friedman.\n·\nChat Client and Server\n· Built a command line chat system based on Client Server architecture using TCP/IP protocol.\n·\nQuality of Experience for VoIP Service\n· Analyzed the performance of Free Call application which is based on voice over internet protocol service in\nrelation to its connectivity to the internet. Performance was measured using delay, data usage and experience.\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Myadam, Nishkal Gupta; DOB: 11/11/1997; ID: 737840932\n·\nMachine Learning Model for Communication Network of a Bus\n· Developed a ML based model that analyses and rectifies problems in the communication network of a vehicular\nsystem. Model supports both static as well as dynamic data. Later google map’s API was used for plotting a\nheat map for the communication between the bus and the reporting stations.\n·\nDesign of Network Architecture\n· Designed and simulated a network architecture for a startup using Cisco packet tracer. Components included\nData/DNS/FTP/Syslog servers, computers, switches etc.\n·\nNetwork Architecture for Online Game\n· Proposed a network architecture along with theoretical calculations for monitoring, operation and maintenance\nof an online game similar to PUBG but with a much higher capacity.\n·\nData Modeling of M/M/S Queuing system\n· Designed and implemented a lossless multiple server data model with the help of a state diagram for a cinema\ntheatre using MATLAB with various service and arrival rates. Later statistical analysis was carried out using\nboth graphical and numerical calculations.\n·\nImage Classifier\n· Built an image classifier based on Convolutional neural network using TensorFlow and python with the help of\nMNIST data set as input.\nTechnical Skills\nLanguages: C/C++, MATLAB, Dart, Python, Go ,BASH, JavaScript, LaTeX.\nDatabases:MySQL, MongoDB, Mongoose, PostgreSQL.\nWeb Frameworks and Languages:HTML/CSS, JSON, Bootstrap,Flask, Nodejs, Expressjs, Flutter, YAML.\nDeveloper Tools and Cloud Technologies: Git, Git-Lab, Docker, Redis, Anaconda, Kubernetes, HELM,\nKustomize , Openstack, Terraform, AWS.\nData Science Libraries: Pandas, NumPy, Matplotlib, Scikit Learn, Tensorflow, Transformers.\nIOT devices and OS: Arduino, Raspberry pi, Onion Omega2+, Linux(Kali and Ubuntu),Windows, ROS(Robot\noperating system).\nNetworking Tools: Cisco Packet Tracer, Openflow,TCP dump,Wireshark, Transport, Basics of P4. layer protocols\n(TCP,UDP),Internet Layer Protocols (IPV4&IPV6),SNMP,DNS and ARP\nBlockchain Technologies: Ethereum(smart contract, Secret Store development, Ocean Protocol),Bitcoin\nMS Office: Excel, PowerPoint, Word\nAchievements\n·\nMerit Scholarship by Swedish Government Jan 2019\n· Awarded50%feewaveinMaster’sEducationinSwedenduetooutstandinggradesfromBachelor’sEducation.\n·\nMSME by Government of India Feb 2018\n· Selected for National Level Idea pitching for startups by Government of India for my idea of ”SMART EAR\nPODS”.\n·\nInternational Maths Olympiad 2013\n· Attained 126th rank in India for International Maths Olympiad.\nExtra Curricular Activities and Hobbies\nStudent Ambassador for Blekinge Institute of Technology, Sweden. Sep 2020\nVolunteer at XP 2020 Agile Alliance, Software Community Jun 2020\nStudent President for Entrepreneurship cell, JNTU Hyderabad Mar 2017 – Dec 2018\nDIY RC plane making\nDIY watch making and engineering\nRiffle Shooting - Semi professional level\nProfessional Cricket and Table Tennis player\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}