{
  "document_name": "Golder, Aditi (739328629).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Golder, Aditi; DOB: 11/20/1995; ID: 739328629\nADITI GOLDER aditigolder2384@gmail.com\nResearch Gate\nDhaka, Bangladesh, Postal Code:1216\nContact: (+880)1843073557 LinkedIn\nGoogle Scholar\nHighlights of Academic Skills and Research Interest\nResearch Interest : Artificial Intelligence, Computer Vision, Natural Language Processing,\nSecurity Threat and IoT.\nResearch Skills : Have hands-on experience in machine learning and deep learning\nalgorithms, extensive data analysis, and medical image data.\nProfessional Skills : Strong analytical and problem solving skills, project management skills,\nability to work independently and collaboratively, team management\nskills, excellent academic writing, verbal and interpersonal skills.\nAcademic Credentials\n Master in Information Technology, Institute of Information Technology, Jahangirnagar\nUniversity (JU), Savar, Dhaka, Bangladesh. Duration: 2014-2018.\nDissertation Title: “Online Bookshelf”\nAdvisor: K M Akkas Ali, Professor (JU)\nCGPA: 3.63/4.00\nRank: 3rd\n Bachelor of Science in Software Engineering, Department of Software Engineering, Daffodil\nInternational University (DIU), Dhaka, Bangladesh. Duration: 2018-2020.\nDissertation Title: “Factor’s Influencing Female Students’ Intension to Continue Career as a\nProgrammer”\nAdvisor: Ms. Nusrat Jahan, Assistant Professor & Head of ITM Department DIU\nCGPA: 3.18/4.00\nExperiences/ Skills\n Research Assistant Worked for 1 year as an Research Assistant under Ms. Nusrat Jahan, at\nDaffodil International University.\n Programming Skills Python 3.x, Pytorch, MatLab, JS\n Tools and Libraries Hands-on experience in scikit-learn, Tensor Flow 2.x, spreadsheet and\nstatistical analysis (Excel, SPSS).\n Soft Skills Word, PowerPoint, Notion, LaTex.\nProjects\n Online Bookshelf Online Bookshelf is a user-friendly virtual library and marketplace for\nmanaging book collections, selling, exchanging, and tracking lent\nbooks using PHP, HTML, CSS, and MySQL.\n Blood Bank Management Online blood management system uses PHP and MySQL for efficient,\nSystem organized donation tracking, enabling seamless communication with\ndonors and timely access to life-saving blood donations during\nemergencies.\n E-Learning The web-based system provides teacher-led tutorials, registration,\nqualification verification, online exams, and a teacher-student blog\nfor interactive learning using C# and ASP.Net.\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Golder, Aditi; DOB: 11/20/1995; ID: 739328629\nResearch Publications\n Prediction of Heart Disease and Heart Failure Using Ensemble Machine Learning Models.\nConference: International Conference on Machine Learning, Big Data, and IoT, India, March,\n2023. (2nd author) [Accepted]\n Development of Automatic Number Plate Recognization System of Bangladeshi Vehicle Using\nObject Detection and OCR.\nConference: International Conference on Advances in Data-Driven Computing and Intelligent\nSystems, Goa, India, 2023. (2nd Author) [Accepted]\n CervixMed: Detecting Cervical Cancer based on combinational data using Hybrid architecture.\nConference: International Conference on Digital Image Computing: Techniques and Applications,\nPort Macquarie, Australia, 2023. (2nd Author) [Accepted]\n GSM Based Home Security Alarm System Using Arduino Using Mobile Call.\nConference: IEEE 14th Annual Ubiquitous Computing, Electronics & Mobile Communication\nConference (UEMCON), Columbia, USA, 2023. ( 1st Author) [Accepted]\n Security threats on Data-Driven Approaches for Luggage Screening.\nIEEE Symposium Series on Computational Intelligence, USA, 2023. (1st Author equal contributor)\n[Accepted]\n Leveraging InceptionV3 Model with Data Augmentation to Improve Crop Disease Detection in\nBangladeshi Agriculture.\nConference: International Conference on Computer and Information Technology, Bangladesh,\n2023. [Under Review]\n EmoBang: Detecting Emotion from Bengali Text.\nJournal: Transactions on Asian and Low-Resource Language Information Processing (Impact\nFactor: 1.471),Q1 (1st Author equal contributor) [Accepted]\n Hate Speech Detection in Bengali Language: A Comprehensive Survey.\nJournal: Journal of Big Data (Impact Factor: 10.835), Q1 (1st Author equal contributor) [Under\nReview]\nReviewing Experience: Reviewer in IEEE Symposium Series on Computational Intelligence.\nExtracurricular Activity/ Training/ Certification\n Participated in the Bangla translate-a-thon organized by GDG Bangla.\n Volunteer at Google Translate Community and Google Local Guide.\n Member of the Robotic Club of Daffodil International University.\n Organizer of various programs such as study tours, orientation and festival programs, fresher’s\nreception and farewell ceremony, seminars, and cultural programs at DIU. Volunteer at Social\nawareness, Blood donation.\n LICT Top-Up IT training program certification by ICT Division, Government of Bangladesh.\n Deep Learning specialization course certification by deeplearning.ai instructed by Andrew Ng.\n Six-month Training certification organized by Republic of Korea World Friends ICT Volunteers\nat Daffodil International University, Dhaka, Bangladesh.\nEnglish Proficiency Test Score (IELTS)\nListening Reading Writing Speaking Overall\n6.5 6.0 6.0 6.5 6.5\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}