{
  "document_name": "Olatunji, Isaac (765161652).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\nISAAC TOLULOPE OLATUNJI\n🞂\n27, River Meadow Drive, Rochester, NY 14623\nPhone: +1(585-303-3673)\nE-mail: iospring24@gmail.com\nEDUCATION\n● Rochester Institute of Technology, Rochester, USA, 2021 – 2023\no Master of Science in Bioinformatics\n● College of Medicine of the University of Lagos (CMUL), Lagos, Nigeria, 2009-2016.\no Bachelor of Dental Surgery (BDS)\nPUBLICATION(S) AND PROJECT(S)\n● Olatunji I and Cui F (2023) Multimodal AI for prediction of distant metastasis in\ncarcinoma patients. Front. Bioinform. 3:1131021. doi:\n10.3389/fbinf.2023.1131021\n● Isaac Olatunji, Feng Cui. Machine Learning Predicts Genes Associated with\nCancer Metastasis. Poster Presentation. AI@RIT Summit.\n● Isaac Olatunji. Potential application of tumor suppressor microRNAs for\ntargeted therapy in head and neck cancer: A mini-review. Oral Oncology, Volume\n87, 2018, Pages 165-169, ISSN 1368-8375.\n● Breast Cancer Segmentation on Histopathology Images. A Convolutional Neural\nNetwork based project where U-net architecture was coded from scratch using\ntensorflow, and other python libraries. Model was trained with image datasets\ndownloaded from Kaggle to make predictions.\n● Differential gene expression analysis in sulphoraphane treated versus vehicle\ntreated obese rats. Aim was to investigate if any of the Differentially Expressed\nGenes (DEGs) are related to the leptin receptor or Nuclear Factor Erythroid 2\nRelated Factor (NRF2) pathways. Data acquisition from SRA, Quality Control,\nAlignment, Count Matrices, Differential Gene Expression Analyis, Visualization, DEGs\ninterpretation.\n● Assessment of ligand protein binding in statins-HMG Co-A reductase complex.\nMolecular docking of various statin class ligands (ex. simvastatin, pravastatin, etc) to\nthe HMG Co-A reductase protein using AutoDock Vina in the PyRx software in order\n10/07/2024 09:57 Resume 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\n🞂 Resume: OLATUNJI ISAAC TOLULOPE\nto assess their binding affinities. Visualization and analysis of the various statin-\nHMG Co-A complex interactions based on features like hydrophobicity, and B factor\nin the UCSF Chimera software.\n● Machine Learning Predicts Cancer Recurrence and Metastasis in Head and\nNeck Cancer. A project in R that assessed ability of three types of machine learning\nalgorithm (NaïvF e Bayes, SVM- with linear, polynomial, radial basis kernel functions,\nand Random Forest) to accurately predict cancer recurrence and metastasis from\npatients clinical data downloaded from TCGA.\n● Molecular Modelling and Proteomics Course Individual Projects\n○ Python implementation of Chou Fasman algorithm for protein secondary structure\nprediction.\n○ Sequence specific retention calculator for calculation of retention time in reverse\nphase chromatography.\n○ Python scripts within Chimera software for download and manipulation of PDB\ndata.\n● Diagnose Your Toothache. A novel algorithm to diagnose pain of dental origin\nfrom information about patient’s symptoms, and medical history. (Python, MySQL)\nJOURNAL REVIEW ACTIVITIES\n● Reviewer, Journal of Surgery and Operative Care (online journal).\n● Reviewer, Journal of Cervical Cancer Research (online journal).\n● Reviewer, Journal of Medical Oncology (online journal).\n● Reviewer, Journal of Clinical Oncology and Cancer Research (online journal).\n● Reviewer, Journal of Otolaryngology, Head and Neck Cancer (online journal).\n● Reviewer, Springer book proposal (Medicine, Life Sciences and Biomedicine).\n● Reviewer, Journal of Receptors and Signal Transduction (online journal).\n● Reviewer, Acta Biochimica Polonica (online journal).\nSKILLS\n● Programming Languages: Python, R, C / C++, SQL, Linux.\n● Libraries and Tools: Pandas, NumPy, Matplotlib, Sklearn, OpenCV, Keras,\nTensorFlow, Pytorch, OpenSlide, Tiatolbox, PathML, HISAT2, DESEQ2, Modeller,\nPyRx, Chimera.\n● Databases: MySQL, Google BigQuery.\n● Concepts: Machine Learning, Deep Learning, Convolution Neural Network, Graph\nNeural Network, Transformer, Molecular Biology, Genomics, Proteomics,\nComputational Pathology, Algorithms, Statistics, Dentistry, Medicine.\nWORK EXPERIENCE\n● Research Assistant, Feng Cui Lab, Jun 2023 – Present:\n🞂 Page 2 | 08161725680\n10/07/2024 09:57 Resume 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\n🞂 Resume: OLATUNJI ISAAC TOLULOPE\no Application of AI techniques for analysis of biomedical data\no Literature review.\no Research.\n● Graduate Teaching Assistant, General Biology Laboratory, Jan 2022 – Dec\n2022:\no Delivered lab instructions to two classes of twenty-eight students.\no Graded student’s submissions.\no Held office hours.\n● Dental Team Lead, EHA Clinics, 2019-2021:\no Diagnosis and treatment of patients with oral and maxillofacial diseases.\no Administrative duties and communication between the dental department and\nupper management.\no Actively involved in writing of standard operating procedures.\no Worked with the Informatics team to create a digitized dental patient evaluation\nform.\nAWARDS / RECOGNITIONS\n Google CS Research Mentorship Program (CSRMP), 2023.\nMentorship from Google Researchers towards a computer science research career\n Google PhD Fellowship Summit Invited CSRMP Alumni, 2023.\n John Wiley Jones Scholarship for International Students, 2022.\n Bioinformatics Department Merit Scholarship, 2021.\nLEADERSHIP SERVICES\n● Dental Team Lead, EHA Clinics, 2021.\n● Member, Constitution Review Committee, Medical Community Development Service\ngroup, Bauchi state, 2018.\n● Medical Advisory Chairman, National Youth Service Corps orientation camp clinic,\nBauchi state, 2017\n● Pioneer member, University of Lagos Association of Dental Students (ULADS)\nSenate, 2014/2015\n● Chairman, Ethics and Disciplinary Committee, University of Lagos Association of\nDental Students (ULADS) Senate, 2014/2015\nEXTRACURRICULAR ACTIVITIES\n● Head Coach of undergraduate class football team for 3 years (2013-2015):\no Won the ULADS cup with the team twice and came 1st runner-up once.\n🞂 Page 3 | tisla91@gmail.com\n10/07/2024 09:57 Resume 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\n🞂 Resume: OLATUNJI ISAAC TOLULOPE\no Decided tactics, lead training sessions, players selection and co-ordination,\nman management.\n● Football management games and other video games\n● Singing\n🞂 Page 4 | 08161725680\n10/07/2024 09:57 Resume 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}