{
  "document_name": "Zhou, Chenrui (914600895).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Zhou, Chenrui; DOB: 12/25/2000; ID: 914600895\nChenrui Zhou\nTel: (+86) 18851118236 | Email: chenruizhou00@gmail.com\nName: Chenrui Zhou\nACADEMIC INTEREST\nI’m broadly interested in Computer Vision and its related applications, especially its application with computer\ngraphics, robotics and beyond.\nEDUCATION BACKGROUND\nKuang Yaming Honors School, Nanjing University Nanjing, Jiangsu, China\nBachelor of Science in Information and Computational Science(Mathematics) 09/2019-06/2023\n· Overall GPA: 4.125/5.0; 83/100 Major GPA：4.26/5.0; 85.2/100\nSTANDARD ENGLISH TEST SCORES\nTOEFL：103（S22） GRE: 323+AW3.0\nRESEARCH EXPERIENCE\nNanjing University Nanjing, Jiangsu, China\nProject: Design and implementation of hierarchical model reconstruction method based on recursive neural\nnetwork Sep.2021~ June 2022\nAdvisor: Prof. Yan Zhang\n⚫ Innovative Approach: Collaborated on pioneering a novel hierarchical 3D model reconstruction method using\nrecursive neural networks and shape generation gradients, achieving significant gains in accuracy and\nefficiency.\n⚫ Literature Review: Conducted a thorough review, revealing a gap in existing methods, which predominantly\nfocused on overall shape rather than semantic relationships among components.\n⚫ Semantic-Centric Design: Integral to designing and implementing a hierarchical reconstruction approach,\nutilizing recursive neural networks to initiate reconstruction from the semantic structure of each component,\nimproving reconstruction quality.\n⚫ Network Optimization: Played a key role in optimizing neural network parameters, introducing novel\nmathematical optimizations, leading to enhanced model accuracy.\n⚫ Data Preparation: Prepared and preprocessed datasets for compatibility with the recursive neural network,\nensuring consistent and reliable results.\n⚫ Comprehensive Evaluation: Conducted extensive experiments, including benchmark datasets and various data\nconditions, showcasing the method's ability to generate high-quality 3D models.\n⚫ Applications Exploration: Explored potential applications in computer graphics, virtual reality, and robotics.\n⚫ VGG16 Integration: Integrated and modified the VGG16 model, enhancing its performance for the specific\ntask.\nProject: AO-NeRF：Adaptive Octree-based Neural Radiance Fields April.2022~ Dec.2022\nAdvisor: Prof. Yan Zhang\n⚫ Adaptive Octree-Based Approach: Proposed an innovative volumetric neural rendering method called AO-\nNeRF (Adaptive Octree-based NeRF), designed to efficiently generate high-quality synthesized views.\nDistinguished from existing NeRF methods that uniformly partition space at the same resolution using points\nor octrees, AO-NeRF introduces adaptivity at multiple scales.\n⚫ Geometry Reconstruction: Integrated a deep multi-view stereo vision approach to rapidly reconstruct the\ngeometric shape of scenes, obtaining foundational neural point cloud features.\n⚫ Adaptive Resource Allocation: Introduced an adaptive octree-based framework for allocating resources at\nvarying scales, dynamically managing the complexity of the scene's geometry. This adaptability optimizes\n1 / 3\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Zhou, Chenrui; DOB: 12/25/2000; ID: 914600895\nChenrui Zhou\nmemory usage and computation costs.\n⚫ Attention-Based Feature Aggregation: Implemented a rapid aggregation of neural point features near the\nscene's surface using attention mechanisms, enhancing scene representation.\n⚫ High-Quality Rendering: Achieved high-quality scene rendering through a ray marching-based rendering\npipeline.\n⚫ Performance Advancements: As a general framework extending Point-NeRF, AO-NeRF significantly reduced\nmemory and computational costs while delivering superior view synthesis capabilities compared to existing\npoint-based methods.\n⚫ State-of-the-Art Results: Validated the proposed AO-NeRF on various datasets, demonstrating its ability to\noutperform existing methods in both rendering speed and quality, achieving state-of-the-art results.\nProject: Exploring the Influence of Diverse Loss Functions on 3D-LMNet Network Performance\nDec.2022~ June.2023\nAdvisor: Prof. Yan Zhang\n⚫ Undergraduate Thesis: Conducted an in-depth undergraduate thesis delving into the impact of various loss\nfunctions on the efficacy of 3D-LMNet, a pivotal point cloud reconstruction model within the realm of\ncomputer vision.\n⚫ Contextualized Point Cloud Reconstruction: Explored the broader context and significance of point cloud\nreconstruction, highlighting its pivotal role in critical applications such as autonomous driving and immersive\nvirtual reality experiences.\n⚫ 3D-LMNet Model Examination: Analyzed the intricacies of the 3D-LMNet model, elucidating its architectural\nframework and underlying principles. Proposed an innovative approach that harnesses diverse Minkowski\ndistances as loss functions to bolster its adaptability across a spectrum of real-world application scenarios.\n⚫ Comparative Analysis of Loss Functions: Carried out an exhaustive comparative study, scrutinizing the\nmodel's performance when subjected to various loss functions, encompassing L1, L2, and Huber loss\nfunctions.\n⚫ Empirical Validation: Demonstrated the experimental findings unequivocally, with results showcasing that the\nimplementation of L1 distance as the loss function notably elevated reconstruction accuracy. These empirical\nresults underscore the crucial role of loss function selection in the efficacy of 3D-LMNet network.\nPROFESSIONAL CONTESTS\nMeritorious Winner - Mathematical Contest in Modeling (MCM) and Interdisciplinary Contest in Modeling\n(ICM) Mar. 2021\n2021 hematical Contest in Modeling / Interdisciplinary Contest in Modeling\n⚫ Developed and fine-tuned a neural network utilizing Python and MATLAB to accurately identify wasp images\nfrom a diverse dataset of over a thousand images.\n⚫ Applied Support Vector Machines (SVM) for precise image classification.\n⚫ Enhanced the TF-IDF model to perform comprehensive text analysis.\n⚫ Employed Latent Dirichlet Allocation (LDA) for data insights in the absence of labeled data.\n⚫ Conducted an extensive literature review and method optimization to yield optimal solutions for predicting\nwasp diffusion paths.\nThis project earned the esteemed distinction of 'Meritorious Winner' in the American Mathematical Contest in\nModeling (MCM) and Interdisciplinary Contest in Modeling (ICM), underscoring my expertise in numerical\nmodeling and interdisciplinary problem-solving.\n2 / 3\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Zhou, Chenrui; DOB: 12/25/2000; ID: 914600895\nChenrui Zhou\nSKILLS\n• Programming Skills: Python, C, C++, MATLAB, SQL, Java, etc.\n• Deep Learning Framework: Familiar with Pytorch, OpenCV, Tensorflow, etc.\nSELECTED COURSEWORKS\nUse SQL to build a forum database June 2020\nCoursework for Introduction to databases; Score: 4.0/4.0\n⚫ Successfully built a forum database using SQL server, and can complete basic functions such as registration,\nposting, replying, deletion, etc.\nThe Development of Drawing Program Dec. 2021\nCoursework for Computer graphics; Score: 4.0/4.0\n• Designed and used python to complete a drawing program that can draw basic graphics and straight lines and\ndisplay them correctly on the screen.\n• Learned about graphics algorithms and how to approximate graphics as a combination of pixels.\nDeep Learning-Powered Sentiment Analysis Dec. 2021\nUndergraduate Research Project; Score: 4.0/4.0\n· Deployed cutting-edge Recurrent Neural Networks (RNNs) coupled with advanced word embeddings to\nconduct sentiment analysis on textual data.\n· Performed rigorous data preprocessing, including the implementation of word embeddings through Word2Vec.\n· Trained a state-of-the-art RNN model, such as Long Short-Term Memory (LSTM) or Gated Recurrent Unit\n(GRU), to expertly classify text sentiments.\nRigorously assessed the model's performance using a comprehensive array of metrics, including accuracy, precision,\nrecall, and the F1-score.\nFundamental PyTorch Proficiency Jan. 2022\nUndergraduate Research Project; Score: 4.0/4.0\n· Mastered the essentials of the PyTorch environment, including navigating different layers and comprehending\ntheir functions.\n· Gained a solid grasp of fundamental concepts such as Stochastic Gradient Descent (SGD), loss functions, and\nelementary neural network structures.\nDemonstrated practical skills through partial code implementations, including ResNet, Seq2Seq, and Generative\nAdversarial Networks (GANs).\nDesigning the Ball-Pushing Game Feb. 2022\nUndergraduate Research Project; Score: 4.0/4.0\n· Acquired proficiency in foundational tools and technologies, including OpenGL, SolidWorks, and basic\nphysics engine mechanics analysis.\n· Executed the implementation of core mechanics for the ball-pushing game, ensuring smooth gameplay\ninteractions.\n· Showcased competence in creating basic lighting effects to enhance the game's visual appeal.\nADWARDS AND HONORS\n• Honors of distinction, Kuang Yaming Honors School, Nanjing University 2023\n• Meritorious Winner, 2021 Mathematical Contest in Modeling (MCM/ICM) 2021\n3 / 3\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}