{
  "document_name": "Shrivastava, Abhudaya (937487022).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Abhudaya Shrivastava\nShrivastava, Abhudaya; DOB: 11/06/2002; ID: 937487022\n917-774-1358 | abhudaya.shrivastava@outlook.com | linkedin.com/in/abhudaya-shrivastava-a085711b2 |\ngithub.com/debugged-abh\nTECHNICAL SKILLS\nLanguages: Python, MySQL, C, JavaScript, HTML/CSS.\nFramework/Libraries: Apache Spark, Pandas, Matplotlib, Plotly, TensorFlow, Keras, PyTorch, and Scikit-learn,\nNumPy, Scipy, GeoPy.\nDeveloper Tools: Git, Github, PyCharm Professional, Jenkins, Jupyter Notebook, NET Beans IDE, Visual Studio\nCode.\nBusiness Intelligence and Analytics Tools: Power BI, MicroStrategy Workstation, Tableau.\nWorkflow management platform/ETL Pipeline Tools: Apache Airflow, Jira, Confluence.\nDatabase Management System: MySQL, MangoDB.\nWeb Based: Microsoft SharePoint\nBig Data Platform: Amazon EMR, Amazon S3.\nAPI: Rest API, Google Geocoding API.\nSoft Skills: Team Player, Time Management, Communication, Project Management, Client Management, Adaptable.\nEXPERIENCE\nQuantitative Analyst September 2022 - Present\nNJEDA Camden, NJ\n• Automated Geo Coding of local businesses by Machine Learning algorithm for data extraction from Excel, and\nGoogle Geocoding API in Python using Pandas and GeoPy library for Geocoding/analysis.\n• Using dimensional modeling techniques to develop concise data analytical reports on quarterly funds allotted to\ncompanies using MySQL with Tableau to visualize data, and SharePoint CRM for data extraction.\n• Created quarterly financial forecasting system using MLP neural network and MySQL to support financial\ndecision-making.\n• Implemented and preserved documentation techniques that improved team efficiency by 30% and enabled faster\ntroubleshooting and resolution using Excel.\nSkills: Geocoding, Machine Learning, Excel, Data extraction, Google Geocoding API, Python, Pandas, Geopy, MySQL,\nTableau, MLP neural network, Sharepoint CRM .\nSoftware Engineer September 2021 – September 2022\nRutgers University Camden, NJ\n• Designed and implemented the Learning Management System (LMS) for staff and students.\n• Formulated algorithm for issuing book from library which automatically updates libraries records backend data using\nPython, Apache spark, and MySQL.\n• Python–Jira integration using Rest API for web services/applications.\n• Developed and updated user signup interfaces and processes for users with Node.js and Angular.\nSkills: Jira, , Rest API, Python, Node.js, Angular, LMS, Python, Apache Spark, MySQL.\nData Science, Intern January 2021 – September 2021\nFetchr Dubai, U.A.E\n• Modeled data manipulation techniques, and analysis concepts to build algorithms for complex logistic delivery\nsystems.\n• Devised ETL pipeline using Python, Apache Spark, and Apache Airflow for Fetchr’s ERP system.\nCreated Data Mining algorithms in Python and Apache Spark using Amazon EMR job flow to store data in\nAmazon S3.\n• Designed and implemented Machine Learning models in Python using Pandas, GeoPy, Scikit-Learn, and Keras to\nautomatize extraction and plotting the location of clients for Navigation enhancement and monitored model\ndeployment using Jira.\nSkills: ETL, Python, Apache Spark & airflow, ERP systems, Python, Amazon EMR & S3, Keras, Scikit-learn, GeoPy, Jira.\n10/07/2024 09:57 Resume 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Data Science, Intern S h r i v a s t a v a , A b hJuudnaey 2a;0 D2O0 B–: D11e/c0e6m/20b0e2r; 2ID0:2 903 7487022\nDavidson.group Dubai, U.A.E\n• Collaborated with UX Styling business partners to prototype and develop solutions for the problems at hand.\n• Implemented AI concepts in Python using Matplotlib and Plotly for feature visualization, PyTorch, and Keras to\ndevelop machine learning model for Road Transport Authority Dubai’s transit system.\n• Formulated data mining models in Microstartegy workstation for wide-ranged native analytics and utilized MangoDB\nfor database management.\nSkills: UX styling, Python, Plotly, PyTorch, Keras, Microstrategy Workstation, MangoDB.\nEDUCATION\nRutgers University Camden, NJ\nBachelors in Sciences (Honors) in Computer Science, CGPA: 3.581/4.0 September 2019- May 2023\nRutgers University Camden, NJ\nCyber Security Affiliation September 2019- May 2023\nCertifications Camden, NJ\nBloomberg Market Concepts (BMC), Palo Alto Networks: Firewall 9.1 Essentials, IBM: Python for Data Science.\nPUBLICATIONS\nIEEE December 2022\n11th SMART Conference Moradabad, India\n• A.S. Rajawat et al., \"Security Analysis for Threats to Patient Data in the Medical Internet of Things,\" 2022 11th\nInternational Conference on System Modeling & Advancement in Research Trends (SMART), Moradabad, India,\n2022, pp. 248-253, doi: 10.1109/SMART55829.2022.10047322.\nIEEE November 2020\n7th ITT Conference Abu Dhabi, U.A.E\n• A. Shrivastava and D. P. Shrivastava, \"Using Deep Learning And Machine Learning In Space Network,\" 2020 Seventh\nInternational Conference on Information Technology Trends (ITT), Abu Dhabi, United Arab Emirates, 2020, pp. 83-\n88, doi: 10.1109/ITT51279.2020.9320781.\nRESEARCH EXPERIENCE\nResearcher July 2023-Present\nRutgers University Camden, NJ\n• Correlating indicators to be used when investing in multiple market indexes against volatility index/VIX.\n• Identifying how volatility index/VIX affects market bullish and bearish trends.\n• Testing and implementing different RNN models in Python and using live volatility index/VIX trend to forecast market\ntrends.\n• Analyzing the predictability and accuracy of different models for the best selection of model to forecast the trend.\nUndergraduate Researcher January 2021-June 2021\nRutgers University, supervised by Dr. Guy Kortsarz Camden, NJ\n• Implemented Design and Analysis of Algorithm concepts to formulate and design stack and queue related solutions for\ncomplex problems using C language.\n• Suggested alternative time complexities for stack and queue operations aiming to complete operations efficiently.\n• Achieved efficacy in creating stack and queue algorithm with O(1) time complexity.\n10/07/2024 09:57 Resume 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "PROJECTS Shrivastava, Abhudaya; DOB: 11/06/2002; ID: 937487022\nToxicity Classifier September 2023\nhttps://github.com/debugged-abh/LSTM_Toxicity_Classifier\n• Correlating indicators to be used when investing in multiple market indexes against volatility index/VIX.\n• Indentifying how volatility index/VIX affects market bullish and bearish trends.\n• Testing and implementing different RNN models in Python and using live volatility index/VIX trend to forecast market\ntrends.\n• Analyzing the predictability and accuracy of different models for the best selection of model to forecast the trend.\nSkills: UX styling, Python, Plotly, PyTorch, Keras, Microstrategy Workstation, MangoDB.\nConsumer Price Index (CPI) Forecast May 2023\nhttps://github.com/debugged-abh/CPI-Forecasting\n• Used data extraction techniques on U.S Bureau of Labor Statistics to obtain training Consumer Price Index data for\nmachine learning model.\n• Researched different neural networks to train model, and reaching LSTM-RNN model as most ideal neural network.\n• Created LSTM model and trained the model using data extracted in Jupyter Notebook using Python, Pandas, Numpy,\nScikit-learn, and Keras for data visualization and machine learning model development.\n• Forecasted the CPI value till November 2023 using LSTM model with high accuracy of 88% and recall percentage.\n• Formulated Tableau dashboard for better story telling of the forecast and forecasting methods using LSTM-RNN.\nSkills: Machine learning, Python, Pandas, Numpy, Scikit-learn, Keras, Jupyter Notebook, LSTM- RNN, Tableau.\nS&P 500 Trend Predictor January 2023\nhttps://github.com/debugged-abh/Stock-Prediction\n• Implemented Yahoo Finance API in Python on Jupyter Notebook for S&P500 live data extraction.\n• Studied data extracted for the years 20202, 2021, and 2022 to identify seasonal and non-seasonal trends using Pandas,\nSeaborne to visualize data and data slicing techniques in Python.\n• Testing and comparing different statistical techniques under Numpy and Scikit-learn to optimize running time of the\nmachine learning model through Tensorflow and Keras in Python.\n• Forecasted a week of S&P500 market trend into the future with an accuracy of 83%.\nSkills: Python, Numpy, Tensorflow, Keras, Scikit-learn, Jupyter Notebook, Yahoo Finance API, Pandas, Seaborne.\nAutomated Aircraft Selector November 2022\nhttps://github.com/debugged-abh/Stock-Prediction\n• Developed a GUI application using Python, Tkinter, Pandas, Numpy, and Object-Oriented Programming.\n• Committed web scrapping of data from Boeing and Airbus of commercial aircrafts.\n• Created an algorithm in Python using OOP and data structures from scratch to recommend aircraft based on the factors\nof distance between origin and destination, cruising speed requested by the airlines, and fuel to be used as per the\nairline’s regulations.\n• Ran multiple test cases to detect bugs and windows of improvement in the application.\nSkills: GUI development, Tkinter, Web scrapping, Python, Object Oriented Programing (OOP), Data structures, Pandas,\nand Numpy.\n10/07/2024 09:57 Resume 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}