{
  "document_name": "Kearns, Maxwell (978025776).pdf",
  "total_pages": 1,
  "pages": [
    {
      "page_number": 1,
      "content": "Kearns, Maxwell; DOB: 01/05/1998; ID: 978025776\nMAX KEARNS\n908-591-6571 | mwk2134@columbia.edu | https://www.linkedin.com/in/maxkearns\nEDUCATION\nColumbia University New York, NY\nMS Chemical Engineering, Concentration in Biotechnology Expected Dec. 2023\n• Current GPA: 4.00\n• Awarded Dean’s MS Academic Excellence Fellowship\nUniversity of Rochester Rochester, NY\nBS Chemical Engineering, Minor in Material Science Aug. 2016 – May 2020\n• Overall GPA: 3.95, Magna Cum Laude, Highest Distinction in Chemical Engineering\n• Elected to Phi Beta Kappa, Tau Beta Pi, awarded Donald M. Barnard Prize upon graduating for high achievement\n• Teaching Assistant: Heat and Mass Transfer, Reactor Design\nPROFESSIONAL EXPERIENCE\nJavlyn Process Systems Rochester, NY\nProcess Engineer June 2020 – July 2022\n• Provided robust engineering and automation solutions for large U.S food and beverage companies.\n• Lead engineer for water conservation project at prominent U.S dairy facility; designed new system capable of saving\nclient ~750,000 liters of water per day with RO membrane system.\nRESEARCH EXPERIENCE\nColumbia University New York, NY\nMS Researcher, Protein Based Materials (PI: Dr. Allie Obermeyer) Jan. 2023 – Present\n• Currently constructing a binodal phase diagram to map the effect of intracellular protein concentration and net charge\non formation of biomolecular condensates in E. coli.\n• Trained and tested a support vector machine (SVM) to filter incorrectly segmented E. coli cells from microscopy images.\nSVM achieved overall classification accuracy of 85%. Programmed MATLAB script to create training data from ~150\nimages and ~10,000 individual cells containing biomolecular condensates.\n• Programmed MATLAB script to automate the alignment of microscopy images taken on multiple fluorescent channels.\nUniversity of Rochester, Laboratory for Laser Energetics Rochester, NY\nResearch Assistant, Optical Materials & Technology (PI: Dr. Tanya Kosc) May 2019 – Dec. 2019\n• Created custom python script to quantify the laser gain of advanced optical glass doped with neodymium and ytterbium\nto support inertial confinement fusion efforts at the National Ignition Facility and Laboratory for Laser Energetics.\nU.S Department of Defense Picatinny, NJ\nChemical Engineering Intern, Explosives Research Branch June 2017 – Jan. 2018\n• Developed scale-up procedure for producing a DoD compound of interest using ion exchange column chromatography.\nOptimized process using JMP Design of Experiment software.\nLEADERSHIP\nAmerican Institute of Chemical Engineers – Undergraduate Chapter April 2017 – April 2020\n• President (senior year), Business Manager (junior year). Active Member (sophomore year). Awarded the annual\n“Gwennie” by the Greene Career Center for outstanding career development of undergraduate members.\nStudent Government Appropriations Committee Sept. 2016 – April 2019\n• Deputy Treasurer (junior year), Student Accountant (all years). Collaborated weekly with a committee of students and\nAssociate Dean of Students to allocate $1.2 million in funds to 200+ diverse student organizations.\nSKILLS\n• Cell Culture / Molecular Cloning • Machine Learning / Programming • Quantitative Image Analysis\n10/07/2024 09:57 Resume 1/1",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}