{
  "document_name": "Huang, Xi (993618511).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Huang, Xi; DOB: 12/28/1998; ID: 993618511\nXI HUANG\nlinkedin.com/in/xi-h\nBay Area, CA xihuang@andrew.cmu.edu\nEDUCATION\nCARNEGIE MELLON UNIVERSITY\nMaster of Science – GPA 3.67/4.0 Aug 2022 – Dec 2023\n▪ Software Engineering\n▪ GRE General Test: Verbal – 160; Quantitative – 169; Analytical – 4\nUNIVERSITY OF TORONTO\nBachelor of Science – GPA 3.81/4.0 (Upper years 3.97/4.0) Sep 2016 – Jun 2021\n▪ Computer Science Specialist - Focus in Artificial Intelligence & Computer Vision\n▪ Dean’s List Scholar (2017, 2018, 2019, 2021, University of Toronto)\nRESEARCH\nRESEARCH ASSISTANT Sep 2022 – present\nCarnegie Mellon University\n▪ Retail Object Recognition, with Dr. Marios Savvides:\no Collected and preprocessed image data to expand product detection model\nvalidation with unseen data\no Trained different visual transformers to categorize retail objects for an automated\ncheckout system for Walmart\n▪ Medical Image Analysis, with Dr. Asim Smailagic:\no Engineered an efficient solution that combines CNN and wavelet transformation\nfor a diverse set of medical image analysis tasks while preserving patient privacy\nand accuracy\nRESEARCH ASSISTANT May 2020 – Apr 2022\nThe Hospital for Sick Children, University of Toronto\n▪ Cardiac Arrest Prediction in the ICU, with Dr. Anna Goldenberg:\no Conducted software engineering and machine learning research for the testing\nand deployment of a cardiac arrest prediction ML model to decrease risks of life-\nthreatening events in the ICU\no Built data streaming pipeline using Microsoft Trill to perform data gathering and\nstream processing for both real-time data and offline data, and created bash\nscripts for performed testing and benchmarking\n▪ Medical Record De-identification, with Dr. Alistair Johnson:\no Explored novel NLP and data processing methods for efficiently de-identifying\npatient information in medical records to enable future medical research\no Created python scripts that automates a series of research tasks such as\nenvironment setup, model training, and data analysis, connecting Google Colab\nwith tools such as Google Sheets, Google Cloud Platform, and GitHub\nPROJECTS\nRESEARCH PROJECT LEADER Jan 2023 – May 2023\n“Bug Severity Classification”\n▪ Led a 5-member team in developing an automated bug severity classification\nsolution that surpasses current industry standards using NLP on code snippets.\nPresented course project with favorable feedback from the teaching team\n10/07/2024 09:57 Resume 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Huang, Xi; DOB: 12/28/1998; ID: 993618511\nRESEARCH PROJECT MEMBER Jul 2021 – Dec 2021\n“A Discriminative Transformer for Hate Speech Detection”\n▪ Experimented with applying transformers with an innovative loss function in hate\nspeech detection that outperforms existing solutions\n▪ Co-wrote and published a paper at an international conference\nINDUSTRY EXPERIENCES\nCLOUD ENGINEER Nov 2021 – Jul 2022\nState Street Corporation\n▪ Investigated and standardized network firewall for company's cloud environment on\nAWS, currently in use by application teams for secure cloud computing\n▪ Developed tools and infrastructure leveraging AWS resources including Lambda,\nCloudFormation to deploy, monitor, and manage production services and products in\nthe cloud, in use by the operations team\nSOFTWARE ENGINEER INTERN May 2019 – Apr 2020\nState Street Corporation\n▪ Designed and implemented a series of internal cloud-based environment-monitoring\nservices using AWS resources, deployed as infrastructure-as-a-service (IaaS) to both\nexternal and internal clients\n▪ Created a bash script to generate a report of every git branch in the team repository\nand associate their relevant Jira issues for team workflow management\n▪ Created a bootstrapping framework in bash for simplified and standardized\nenvironment setup in EC2 virtual machines for daily use by the development team\nPUBLICATIONS\n▪ Tonekaboni, S, Morgenshtern, G, Assadi, A, Pokhrel, A, Huang, X, Jayarajan, A,\nGreer, R, Pekhimenko, G, McCradden, M, Chevalier, F, Mazwi, M, Goldenberg, A.\n(2022). How to validate Machine Learning Models Prior to Deployment: Silent trial\nprotocol for evaluation of real-time models at the ICU. In: Proceedings of Machine\nLearning Research 174:169-182 Available from\nhttps://proceedings.mlr.press/v174/tonekaboni22a.html\n▪ Huang, X, Xu, M. (2021). An Inter and Intra Transformer for Hate Speech Detection.\nIn: 2021 3rd International Academic Exchange Conference on Science and Technology\nInnovation (IAECST) 346-349 Available from\nhttps://ieeexplore.ieee.org/document/9695652\nAWARDS\n▪ Undergraduate Student Research Awards (USRA) (2020, NSERC)\n▪ Innis College Alumni Association Scholarship (2019, University of Toronto)\n▪ Canada Chinese Computer Association Scholarship In Computer Science (2018,\nUniversity of Toronto)\nSKILLS\n▪ TEAMWORK: Communication, on-time delivery, remote work\n▪ LANGUAGES: Python, JavaScript, Java, C, C#, SQL, Bash\n▪ TECHNOLOGIES: AWS, PyTorch, Node.js, Express.js, Microsoft Trill, LaTeX\n10/07/2024 09:57 Resume 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}