[
  {
    "report": "### Project Summary: Membership Inference Attacks in Differential Privacy\n- **Description**:  The project focused on conducting evaluations of differential private stochastic gradient descent as a method for defending against membership inference attacks on deep neural networks. Key activities included the implementation of machine learning techniques and executing experiments aimed at deriving sound and replicable conclusions.\n\n### Summary of Applicants:\n1. **Applicant A**: \n   - **Expertise**: Machine Learning, Differential Privacy \n   - **Contribution**: Developed algorithms to enhance the effectiveness of differential privacy in deep learning frameworks. Conducted extensive experiments to test the viability of proposed methods in mitigating membership inference risks.\n\n2. **Applicant B**: \n   - **Expertise**: Data Security, Neural Networks \n   - **Contribution**: Focused on the security implications of deep learning models under membership inference attacks. Provided insights on the necessity of differential privacy techniques, contributing to the theoretical backing of the project.\n\n3. **Applicant C**: \n   - **Expertise**: Statistical Analysis, Experimental Design \n   - **Contribution**: Responsible for the design and execution of experiments that tested the robustness of the implemented techniques, ensuring results were sound and replicable, which was critical for project validation.",
    "area": "Security and Privacy",
    "applicant_id": "703313960",
    "_counts_prereduce_Untitled Reduce 31": 1
  },
  {
    "report": "### Project Summaries\n\n#### Project 1: Reinforcement Learning for CDN Caches\n**Description:** This project focuses on optimizing caching algorithms for Content Distribution Networks (CDNs) using Reinforcement Learning (RL). The main achievements include:\n- Development of a benchmarking platform for assessing RL algorithms.\n- Addressing long reward delays associated with large caching systems.\n- Creation of subsampling algorithms to facilitate efficient learning.\n- Published results showcased at NeurIPS 2020 and contributed to an open research platform called Park.\n\n#### Project 2: Building Infrastructure to Accelerate ML on Mobile\n**Description:** This project revolved around optimizing the inference stage of computer vision tasks on mobile devices. Key points include:\n- Internship at MEGVII focused on utilizing ARM GPUs for performance enhancement.\n- Design of an OpenCL framework that led to a significant reduction in latency (10x) compared to previous methods.\n- The system was deployed widely, showcasing its practicality and efficiency.  \n\n#### Project 3: Using Machine Learning to Generate Synthetic Workload\n**Description:** This project emphasized the creation of synthetic workloads to enhance ML-based database configuration tuning. Important aspects include:\n- Development of a Bayesian Optimization framework for parameter derivation.\n- Focus on generating workloads that closely mimic actual customer databases.\n- Research results presented at prestigious institutions including CMU, MIT, Harvard, and Columbia.\n\n#### Project 4: Building SaaS to Improve Customers' Database Performance\n**Description:** This project involved the development of features to enhance database performance for customers. Key accomplishments include:\n- Role as a software engineer at OtterTune to implement optimization features based on heuristic rules.\n- Contribution of Database Health Check and Query Health Check tools that provide actionable optimization suggestions.\n- Utilization of runtime metrics and static analysis for effective performance improvement.",
    "area": "Databases and Data Management",
    "applicant_id": "171318992",
    "_counts_prereduce_Untitled Reduce 31": 4
  },
  {
    "report": "**Summary of Projects and Applicant Contributions**\n\n---\n\n**1. Project: BlowfishDB: Interactive Database System for Sensitive Data Exploration**  \n- **Description:** This project involved the development of an interactive database system tailored for the exploration of sensitive data through the Blowfish privacy framework. The project aimed to establish a compromise between varying levels of privacy and the utility of query outputs.  \n- **Key Contributions:**  \n  - Developed significant algorithms for achieving trade-offs between privacy and utility.  \n  - Integrated these algorithms into a user-friendly query-answering interface.  \n  - Contributed to the writing and showcasing of the project at VLDB 2021, highlighting the importance and innovative aspects of the system.\n\n---\n\n**2. Project: Caching Responses for Differentially Private Queries**  \n- **Description:** This project focused on creating an efficient cache structure designed for processing incoming queries while ensuring differential privacy. It aimed to enhance the accuracy of query responses while maintaining privacy controls.  \n- **Key Contributions:**  \n  - Implemented a transformative algorithm to convert matrices into a suitable full-rank form for improved processing.  \n  - Developed a module dedicated to response selection, enhancing the precision and reliability of the responses provided to users.",
    "area": "Databases and Data Management",
    "applicant_id": "703313960",
    "_counts_prereduce_Untitled Reduce 31": 2
  }
]