{
    "ID": "021687000",
    "SOP": "Daniella Jimenez I was first introduced to biomedical engineering as a rising senior in high school as I participated in a six-week intensive summer program where I learned about applying engineering principles for clinical translation. Since this experience, I have felt an inclination towards the field and sought out opportunities such as internships to exercise biomedical engineering work. During my undergraduate career, I chose to achieve an understanding of the physical sciences and majored in biochemistry while minoring in mathematics; however, I always maintained biomedical engineering in sight. Thus, pursuing a Master’s degree seemed to be the most natural next step in my academic career. Upon enrolling at Columbia University for my Master of Science in biomedical engineering, I recalled my greatest learning experience at the Ultrasound & Elasticity Imaging Laboratory where I interned for almost two years as an undergraduate student. Here, I dabbled in both wet and dry laboratory skills as I executed experiments to assess the acoustic stability of lipid-shelled microbubbles under therapeutic ultrasound which are typically used for focused mediated blood-brain barrier opening. Specifically, I learned how to make microbubbles and prepare tissue mimicking phantoms to characterize the acoustic cavitation occurring within safe focused ultrasound parameters. Within this work, I was also exposed to coding as we used MATLAB to analyze the data acquired. This experience allowed me to learn beyond attaining a skill set. Among the life lessons I received, I recognized the importance of mentorship. I had the privilege to work with a postdoctoral mentor who, from the beginning, established his trust in me as a young researcher. As a result, I felt confident in my own thought processes and abilities to execute an experimental design and was more likely to ask questions and express concerns due to his approachability. Consequently, the following summer I was successfully able to lead nine interns in conducting their own individual projects as I channeled the mentorship that was Daniella Jimenez provided to me. I credit this experience for highlighting teaching as an unequivocal skill. I understood that the ability to simplify advanced concepts such that others can comprehend was necessary to impart knowledge and keep students encouraged and motivated. This was one of the most important skills I learned as an intern and that which I continue to embody as an instructor at the CCNY Stem Institute, as a tutor, and now as a mentor once more upon my return to UEIL. UEIL has taught me invaluable skills. In addition to the significance of mentorship, troubleshooting and optimization have also been emphasized. Upon my return to the lab, I have had the incredible opportunity to perform research as a Master’s student and grew to be independent rather rapidly. As my lab mentor graduated, I was given the rare opportunity to inherit her work and undertake work to be presented at one of the lab’s most prestigious ultrasound conferences. While this was an exciting experience, it was also quite daunting as I was tasked to design experiments and optimize factors such as staining and imaging protocols and perform in vivo murine research. I was entrusted to investigate the effects of focused ultrasound-mediated blood-brain barrier opening on the blood-cerebrospinal fluid barrier which has never been studied before. Here, it was inevitable to become overwhelmed as the research and the skills were incredibly novel, let alone with the anticipation of deadlines. Fortunately, I relied on my thought processes as well as the expertise of my colleagues whose collaboration facilitated the progress of the research. Through this experience, I recognized the difficulty of leading a project at first hand. However, I became confident in my ability to optimize factors in the workflow of an experiment. Moreover, I further emphasized the need for collaboration and teamwork in order to produce a fruitful outcome. At this point in my academic career, I am confident that the work I have executed and the experiences I have undergone have prepared me to take on the next step - to enroll in a doctoral Daniella Jimenez program for biomedical engineering. I envision myself practicing the skills I have attained thus far and building upon them such that I will continue to make advancements in the field. I look forward to mentorship opportunities where I can share what I have learned and inspire others, especially those resonating with my background, to conquer trailblazing experiences, including pursuing graduate studies. Specifically, I am excited to continue to explore the potential of ultrasound applications, promising potential for noninvasive resolutions to our most critical medical needs, including the treatment of Alzheimer’s disease. I am confident that I will be successful in achieving my goals within this endeavor as I strive toward becoming a doctoral student in Professor Elisa Konofagou’s Ultrasound & Elasticity Imaging Laboratory.",
    "Resume": "DANIELLA A. JIMENEZ New York, NY (347) 259-7724 | dj2357@columbia.edu | linkedin.com/in/daniellajimenez1 EDUCATION Columbia University, Fu Foundation School of Engineering and Applied Sciences, New York, NY Master of Science, Biomedical Engineering; GPA: 3.6 Expected December 2023 Macaulay Honors College, The City College of New York, New York, NY Bachelor of Science (B.S.), Magna Cum Laude; GPA: 3.59 Major: Biochemistry; Minor: Mathematics June 2022 RESEARCH EXPERIENCE Research Associate, Ultrasound & Elasticity Imaging Laboratory Columbia University, New York, NY August 2022 – Present • Serve as project leader to assess the potential effect of focused ultrasound-mediated blood-brain barrier opening on the blood-cerebrospinal fluid barrier primarily through fluorescence microscopy. Experimental design encompassed executing focused-ultrasound blood-brain barrier opening in an Alzheimer’s disease model for 10 mice which was confirmed through MRI. Immunofluorescence staining was performed for +50 sections which were then imaged through microscopy and analyzed through ImageJ. • Investigate effects of focused ultrasound-mediated blood-brain barrier opening on the gut microbiome and peripheral organs among Alzheimer’s disease murine models and wildtype mice - stool, blood, and spleen samples were collected pre and post-treatment then analyzed through 16s RNA sequencing and R. • Carry out maintenance, training, and responsible for troubleshooting for two laboratory microscopes. • Led 7 summer interns in executing independent projects to characterize microbubble stability over one-week post-activation and under various conditions induced through theranostic sonications. Intern, Grimm Lab Memorial Sloan Kettering Cancer Center, New York, NY June 2021 – May 2022 • Characterized the role of iron-oxide nanoparticles in reactive-oxygen species-mediated cell death in pancreatic cells through flow cytometry and confocal microscopy. • Analyzed mechanisms of uptake through fluorescence-labeled and radiolabeled Feraheme in vitro through viability assays and flow cytometry. Intern, Ultrasound & Elasticity Imaging Laboratory Columbia University, New York, NY June 2018 – October 2019 • Conducted in vitro experiments using a tissue mimicking phantom to investigate the temporal stability of lipid-shelled microbubbles under therapeutic parameters. • Mentored 9 interns in basic wet laboratory skills, the synthesis of microbubbles, and the preparation of gelatin phantoms. TEACHING EXPERIENCE Non-teaching Adjunct, CCNY Stem Institute The City College of New York, New York, NY June 2022 – Present • Taught PSAT Math to 15 NYC high school students on Saturdays for the Spring 2023 semester. • Taught general chemistry to 32 NYC high school students for the Fall 2022 semester. • Taught the precalculus course to 54 NYC high students participating in the Summer Institute where all 22 students who applied for college credit through College Now successfully met the requirements to receive credit for the course. • Led parent teacher conferences to discuss student progress through the course and collaborated with parents on how to achieve better student outcomes. Tutor, CUNY Tutors Corp The City College of New York, New York, NY Feb 2021 – Jan 2022 • Assisted 20 eighth-grade students one-on-one for homework help and test preparation for their algebra course once a week. • Graded student homework assignments and quizzes, providing feedback to the students and teacher on progress. PRESENTATIONS Journals Pouliopoulos et al., “Temporal Stability of Lipid-Shelled Microbubbles During Acoustically-Mediated Blood-Brain Barrier Opening.” Frontiers in Physics, vol.8,2020, doi:10.3389/fphy.2020.00137. Conferences Jimenez D.A., Kline-Schoder A.R., Bendig J., Noel R.L, Gorman, S. L., & Konofagou, E. E., Focused Ultrasound-Mediated Effect on the Blood-Cerebrospinal Fluid Barrier and its Impact in Reduction of Alzheimer’s Pathology, 2023 IEEE UFFC International Ultrasonics Symposium (IUS); September 3-8, 2023, Montreal, Canada (lecture) Kline-Schoder A.R., Bendig J., Gorman, S. L., Jimenez D.A., & Konofagou, E. E., Focused Ultrasound Blood-Brain Barrier Opening Alters Murine Microbiome, 2023 IEEE International Ultrasonics Symposium (IUS); September 3-8, 2023, Montreal, Canada (poster) Jimenez D.A., Pouliopoulos A.N., & Konofagou E.E., Acoustic Stability of Lipid-Shelled Microbubbles on Weekly Timescale, 2021 IEEE UFFC Latin American Ultrasonics Symposium (LAUS); October 4-5, 2021, virtual (lecture) VOLUNTEER WORK Child Life Volunteer Pediatric Oncology, Morgan Stanley Children’s Hospital, New York, NY Oct 2019 – Mar 2020 • Disinfected and prepared playroom for outpatients receiving treatment at the clinic. • Provided comfort to children by retrieving toys or crafts and playing games with them. TECHNICAL SKILLS Computational: Microsoft Excel, Word, PowerPoint; Google Suite; FlowJoTM; ImageJ; GraphPad Prism; MATLAB; R. Wet laboratory: Cell culture, immunofluorescence, microscopy, flow cytometry, proteomics, animal husbandry, in vivo mouse work (focused ultrasound-mediated blood-brain barrier opening), magnetic resonance imaging. HONORS AND AWARDS Fellow, Summer at SEAS, Columbia University, 2023. Fellow, Dept. of BME Summer Master’s Research Fellowship (SMRF), Columbia University, 2023. Fellow, Graduate Fellowship in Engineering for Change, Columbia University, 2022. Scholar, Hispanic Scholarship Fund, 2022. Rometty Fellow, Engineering Summer Program, Memorial Sloan Kettering Cancer Center, 2021. Dean’s List, The City College of New York, 2019 and 2020. Global Intern, Charles Steger Global Internship, Focused Ultrasound Foundation, 2019. LANGUAGES Spanish (fluent)"
}