{
    "ID": "961615821",
    "SOP": "Jose Antonio Tolentino Veliz Statement of Purpose My affinity for programming began back in 2013 when I took my first programming courses. I was amazed exactly the moment when I could write a small C++ snippet that could trick a game to make users always win. Apparently, it was nothing transcendental; however, I had to study the physical laws that govern the virtual game environment to elaborate an algorithm that could solve the puzzle. Undoubtedly, that must have been a milestone that defined my growing interest in computers. Driven by this enthusiasm, in 2015 I joined Smart Machines Lab in charge of Professor Jose Oliden at CTIC-UNI, a tech club specializing in autonomous robotics and microsatellites. In September 2016, my team participated in the ARLISS tournament, launching a two-meter rocket size with a small Rover inside. The objective was to deploy the rover mid-air and then navigate it autonomously to a specific GPS coordinate in the Rock desert of Reno, Nevada. Afterward, I was awarded a scholarship to receive training in the CanSat program at the University of Hokkaido, where the focus was to develop and launch a nanosatellite up to 500 feet to perform telemetry. In subsequent years, my research focus shifted to Control Systems and Artificial Intelligence. In 2018, I presented a research thesis to control the water level on a multi-tank system utilizing a coupled PID controller with a Genetic Algorithm, where I successfully improved the performance of traditional control techniques. The effectiveness and reliability of my control system apparatus prompted me to file a patent for this implementation. In 2020, I launched a Startup called QbAI. Initially, I began doing research in collaboration with my university in the area of autonomous vehicles. The purpose was to lay the groundwork for the software implementation of an urban VTOL (Rail), which later turned into two papers published in 2021 and 2022. Parallel to this project, I was developing front-end and back-end applications for local clients. In 2022, I decided to launch a startup based in New Mexico called Scryper, because I was getting more international clients and wanted to broaden my market niche. My focus by then was clearer, I wanted to target the development of Software as a Service that can leverage LLM/ML and AI. Jose Antonio Tolentino Veliz In consideration of the foregoing, I’m aiming to study for a Ph.D. in Computer Science because I would like to propose solutions to critical problems that society deals with on a daily basis. For instance, in the area of transport, I started a project to study the implementation of an urban autonomous electric aircraft (RAIL) that is able to navigate to a desired destination, just by booking a ride via a mobile application. This idea was presented to Y Combinator this present year 2023, where I submitted the autonomous navigation software, the booking mobile application, and the aircraft’s structure design. Although there are many areas in this project that need research and development, like computer vision, fluid dynamics simulation, FPGA circuit board design, etc. I perceive that it’s completely achievable because, in the past, I followed a similar engineering process when I built the control system apparatus of my patent that is now used by hundreds of students at my university. Moreover, in a robotics application like the autonomous aircraft, it’s necessary to lean on sensor fusion to collect as much data as possible from cameras and sensors, and then process it according to the aircraft’s motion using powerful FPGAs and computer vision-oriented software. Hence, it’s crucial to define and study flight paths to prevent collisions because VTOLs will usually fly below commercial flights. In addition to those challenges, it is important to also consider the impact of weather conditions on the safe navigation of autonomous cars. Professor Baishakhi Ray's research, titled \"DeepTest: Automated Testing of Deep-Neural-Network-driven Autonomous Cars,\" sheds light on this aspect. Their study revealed that traditional testing approaches often overlook critical faults in DNN models, leading to potential accidents in autonomous cars. Recognizing the significance of this issue, Professor Ray and her team introduced DeepTest as a solution to enhance the efficiency and code coverage of testing in autonomous cars, achieving an impressive 99.6% coverage, and contributing to making autonomous cars safer and more reliable on the road. Computer vision captivates my attention and I am eager to explore its diverse application areas, such as generating code, images, or realistic video and photo renders. For instance, Professor Carl Vondrick and his team, in their paper titled \"ViperGPT: Visual Inference via Python Execution for Reasoning,\" introduced an innovative model that improves visual inference accuracy by 87% precision. In their work, they demonstrated that their model leverages efficient Python execution that exhibits a remarkable 4.5x speed improvement compared to traditional processes. Surprisingly, these Jose Antonio Tolentino Veliz exceptional outcomes are attained with just an image as input, highlighting the model's versatility and potential impact across various applications. I have come across an application idea called UnrealCode, which is the line of the aforementioned research. UnrealCode aims to be a platform that creates code based on drawing blocks. Since I have been in the development of Front-end and Back- end, I have experienced the repetitive task of writing code for modules that are already defined. For instance, the code to create a user in Django is already implemented, so why not generate these models through front-end design? The procedure would be that a user draws blocks, for example, a login form and the LLM generates the front-end and back-end ready-to-use code according to the parameters of the form’s graphical design, such as font color, sizes, position of images, buttons, etc. To conclude, after my studies, I plan to put into practice my knowledge in the technology industry or by launching software services through a startup. I’m utterly sure my professional experience and academic research will fit in a Ph.D. in Computer Science like the one offered at Columbia University, where I have found that my projects are closely related to their recent publications.",
    "Resume": "JoseAntonioTolentinoVeliz joseatolentinov@gmail.com|joseatolentino.com|github.com/jatolentino|linkedin@joseatolentino|Lima,Peru|+51997008163 EXPERIENCE ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ Scryper,NewMexico,USA Jan.2022-Present SoftwareEngineer(remote) ● IntegrateLargeLanguageModels(LLMs)intowebandmobilesapplications,facilitatingadvancedsearchand recommendationfeaturesthatledtoa30%increaseinuserengagement(OpenAI,SpringBoot,Django,andFlutter) ● DevelopinteractiveandintuitiveuserinterfaceusingReactandReduxforadatavisualizationplatformandimplement dynamiccomponents,anduser-friendlynavigation,resultingina25%decreaseinbouncerates ● LeverageNLPtechniquestodevelopintelligentchatbotsforcustomersupport,reducingresponsetimesby50%and improvingcustomerflowby25%(OpenAIAPI) QbAI,Lima,Peru Jan.2020-Dec.2021 FullStackEngineer ● LedthedevelopmentofarobustRESTfulAPIusingDjangoandPythonforaSaaSplatform,achievinganaverage responsetimeofunder100msandhandlingover10,000requestsperminute.Implementedcachingmechanismsand loadbalancingstrategiestoensurehighavailabilityandfaulttoleranceofthesystem ● ImplementedascalablebackendsystemusingJavaandSpringBootforane-commerceplatform,resultingina50% increaseinconcurrentusersanda30%decreaseinresponsetime.Employeddatabaseindexingandcaching techniquestooptimizequeryperformance,enhancingoverallsystemefficiency AutomationLab,Lima,Peru Jan.2017-Dec.2019 ControlandBackendEngineer ● IntegratedFPGAboardswithKubernetesclusterstoenablehigh-speeddataprocessingforreal-timecontrolsystems andleveragedFPGA'shardware-levelparallelismandKubernetes'orchestrationcapabilitiestoachievesub-millisecond responsetimes,improvingsystemresponsivenessandensuringprecisecontrolintime-criticalapplications ● DesignedandimplementedascalableedgecomputinginfrastructureusingKubernetesandFPGA-basededgedevices, resultingina40%reductionindatatransferlatencyandimprovedreal-timedecision-makingcapabilities ● Implementedahighlyavailableandfault-tolerantIoTplatformusingKubernetesandDocker,resultingina50% decreaseinsystemdowntimeandimprovedreliabilityofdatacollectionfromthousandsofIoTdevices EDUCATION ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ NewYorkUniversity Sep.2022 MSc.inComputerEngineering(Droppedout) NationalUniversityofEngineering Mar.2012-Jul.2018 BS.inMechatronicsEngineering Thesis:“Design,andImplementationofaControlStrategyforNon-linearModelsAppliedtoanIndustrialProcessina Multi-TankSystem,BasedonaGeneticAlgorithm” RESEARCHEXPERIENCE ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ InformationTechnology,andCommunicationsCenter(CTIC-UNI),Lima,Peru Jan.2016-Aug.2016 EmbeddedSystemsIntern ● Developedandprototypedprintedcircuitboardsforroboticsapplications CanSatLeadershipTrainingProgram, UniversityofHokkaido,Japan Apr.2016-Oct.2016 ● Developed,launchedanddeployedananosatelliteinacanthatperformstelemetryat500ft ARLISSCompetition,Nevada,UnitedStates Sep2016-Oct.2016 ● DevelopedaminiaturizedroverthatnavigatesautonomouslytoaGPSpredefinedtargetinthedesert PROJECTS ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ Rover:AutonomousroverthatcanavoidobstaclesandnavigatetoaGPScoordinate.Status:completed CanSat:Nanosatelliteinacanthatperformstelemetry.Status:completed LittleVid:VideotoImageandTextsummarization.Status:beta DBot:AIchatbotthatcanqueryproduct'sstockonthedatabaseandreplybacktousers.Status:completed Rail:ElectricAutonomousUrbanVTOLforasinglepassengerwithmobileapp.Status:ondevelopment SmileMe:Transferasmileexpressiontoanonsmileyfacephoto.Status:beta Faang150:DrawandcodeonawebIDEwithastyluspenontouchscreendevices.Status:alpha AutoZoom:ApplyautomaticzoomondesiredareasinanX-raysurgeryprocedure.Status:ondevelopment NERF:SocialNetworkthatusesNERFtechnologiestoanimatefacephotos.Status:ondevelopment DubbAI:Dubbingvideostransferringemotionfromonelanguagetoanotherwithlipsync.Status:ondevelopment UnrealCode:Generatefront-endandback-endcodecomponentsfromgraphicsdesign.Status:ondevelopment PATENT ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ IoTIndustrialLiquidLevelControlSystem,002191-2019/DIN Issued:April2021 ApparatusthatcontrolsliquidlevelinacascadetanksystembymeansofanFPGAandenablesuserstoimplementtheir owncontrolstrategyorAIalgorithmapproach.Valuedat100thousandUSD. PAPERS ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ InternationalJournalofMechanicalandProductionEngineering,ICRAMM Published: July2021 Title:LPV-MPCcontrol,andself-tuningfeedbackgainsforthetrajectorytrackingofaquadcopterUAV 2022IEEE/SICEInternationalSymposiumonSystemIntegration Published: February2022 Title:Controldesignforamulti-rotorVTOLenhancedbyaGradientDescentalgorithmtooptimizethepositiontracking CERTIFICATIONS ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ Coursera,GoogleCloud IntroductiontoGenerativeAI IntroductiontoGenerativeAIStudio IntroductiontoImageGeneration IntroductiontoLargeLanguageModels TransformerModelsandBERTModel CreateImageCaptioningModels Coursera,DeepLearning.AI MachineLearningSpecialization TensorFlowDeveloperProfessionalCertificate TensorFlow:DataandDeploymentSpecialization TensorFlow:AdvancedTechniquesSpecialization MachineLearningEngineeringforProduction DeepLearningSpecialization RedHat RedHatCertifiedEngineer(RHCE) RedHatCertifiedSystemAdministrator(RHCSA) AxelosScrum ITInfrastructureLibrary-ITILV4(ID:GR671224267JT) OTHERS ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯ Languages:English(professional),Spanish(bilingual),andFrench(intermediate)"
}