{
    "ID": "134884402",
    "SOP": "Benjamin Wu Personal Statement God created our brains to be beautiful and complex, capable of understanding His own creation and the beginning of comprehending His glory. The brain fascinates me beyond any other area of science because as we study it, we inherently discover more about ourselves and the process of learning itself. As the field of computational neuroscience accelerates, I want to become an authority on neuroscience research so I can interface with an expanding network of similar minds who desire to understand how the brain works – in doing so, I want to transform my own mind and lift my own limitations when it comes to learning. From my time at Columbia, engaging with the Zuckerman Institute, and taking coursework under Professor Lazar, as well as my time working as an Air Force Research Lab Scholar, I am convinced that a career in this field will be intellectually exciting and transformative in how I think about the world. My goal in completing a Ph.D. is to develop a rigorous way of thinking and obtain the professional credentials that will enable me to understand, internalize, and build upon neuroscience literature and any other field of inquiry. At the beginning of my undergraduate studies, I set my eyes on the field of neuroscience but found that the neurobiology track was outdated – so I made my own. I entered the field of computational neuroscience through the study of computational science. As an undergraduate, I wedged my foot in the door of an HPC laboratory working on parallelizing jobs for computing clusters and then in the door of a quantum computing laboratory, where I wrote my first preprint on using quantum random walks to solve a class of sparse linear systems of equations. With my experience, I applied for a position at AFRL working in my current laboratory – my initial project in the summer of 2021 was using CNNs to track the motion of flying insects in high-quality video recordings. As I became more interested in the field and in making research my career, I began looking into graduate programs and discovered the remote Fly Circuits Journal Club at Columbia. I entered the master’s program, and in the summer of 2022, I returned to AFRL to work on programming a neural network on a custom neuromorphic multi-color optoelectronic synapse sensor, resulting in my first cross-institutional collaboration and peer-reviewed publication. As I entered the master’s program last fall, I undertook coursework with Aurel Lazar and enrolled in the theoretical neuroscience course at the Zuckerman Institute. Simultaneously, my boss invited me to Benjamin Wu propose my own project for my work with AFRL. I began to learn the visualization and execution tools of the Bionet Lab and interface with researchers at ZI to draft a project involving the computational modeling of the Drosophila visuomotor decision-making process for long versus short escape takeoff responses. After the project was approved, I began planning for the summer 2023 term. Throughout the spring, as I conducted the literature review, I took ECBM6070 under Professor Lazar, where I learned about the beautiful and intelligent alignment of the fruit fly retinal columns. Here, I knew that neuroscience was the right field for me. However, a hurdle presented itself in my project planning in that the simulation tools of the Bionet lab were limited and highly convoluted even for the medulla 7 columns simulation, let alone the downstream neurons. At the right time, as part of my advanced theory course at the Zuckerman Institute, I discovered work by Srini Turaga at Janelia that introduced the Deep Mechanistic Network, which is just what I needed. With the pieces in place, this summer, I led a small team of AFRL Scholars to carry out my project plan, leading to a successful department presentation, poster presentation, and technical engineering memorandum. This fall, I have continued fleshing out the project independently and have extended the model to account for multi-colored visual input. Throughout this process, I have solidified my desire to work in the research industry, and my purpose for pursuing the Ph.D. has further clarified: to gain the license necessary to autonomously manage my projects in the future instead of just working under others’ shifting timelines and funding. In the long term, I aim to become a leader in neuroscience research at the intersection of academia, industry, and defense. Within the engineering department at Columbia, I am excited by the prospect of applying what I have learned working with the Deep Mechanistic Network model to expand the simulation capabilities of the Bionet Lab tool infrastructure to recently added datasets such as the ventral nerve cord and optic lobe. At Columbia, more broadly, I am excited by the prospect of collaborating with researchers in the Zuckerman Institute whom I have previously conversed with during my coursework – particularly those doing connectomic research with the fruit fly. From my discussion with leaders in the field, there is a need for high-quality recording data processing pipelines for pose-tracking, and the engineering department at Columbia is well-positioned to fulfill this need. I am excited to be a liaison between professors within these two departments and employ my computational research experience to further the field of neuroscience. Benjamin Wu There have already been many times when I have had doors closed in my face. As I finished my final year of undergraduate and applied for the master’s at Columbia, I attended the Fly Circuits Journal Club at Columbia hosted by now assistant professor Gabrielle Gutierrez – but when I entered the program, the journal club shut down. As I worked with the AFRL on optoelectronic synapses and gained the opportunity to draft my own project description, I took it one step further and fleshed it out for an NDSEG fellowship application. However, after passing the initial rounds of subject-matter expert reviews, it was rejected in April by the DoD panelists. This fall, hoping to get a head-start on Ph.D. preparations, I asked about the possibility of a funded position but found out that AFOSR funding had fallen through. After completing my fall research commitment with the AFRL and applying for next spring and summer to finish this project, I have one last chance to knock on the door to fulfill this Ph.D. dream – but I am also not putting all my hope in it, as I apply for full-time defense research positions. Thank you for taking the time to consider my application. Benjamin Wu Personal Statement God created our brains to be beautiful and complex, capable of understanding His own creation and the beginning of comprehending His glory. The brain fascinates me beyond any other area of science because as we study it, we inherently discover more about ourselves and the process of learning itself. As the field of computational neuroscience accelerates, I want to become an authority on neuroscience research so I can interface with an expanding network of similar minds who desire to understand how the brain works – in doing so, I want to transform my own mind and lift my own limitations when it comes to learning. From my time at Columbia, engaging with the Zuckerman Institute and taking coursework under Professor Lazar, as well as my time working as an Air Force Research Lab Scholar, I am convinced that a career in this field will be intellectually exciting and also transformative in how I think about the world. My goal in completing a PhD is to develop a rigorous way of thinking and obtain the professional credentials that will enable me to understand, internalize, and build upon neuroscience literature and any other field of inquiry. At the beginning of my undergraduate studies, I set my eyes on the field of neuroscience but found that the neurobiology track was outdated – so I made my own. I entered the field of computational neuroscience through the study of computational science. As an undergraduate, I wedged my foot in the door of an HPC laboratory working on parallelizing jobs for computing clusters and then in the door of a quantum computing laboratory, where I wrote my first preprint on using quantum random walks to solve a class of sparse linear systems of equations. With my experience, I applied to a position at AFRL working in my current laboratory – my initial project in summer of 2021 was using CNNs to track motion of flying insects in high-quality video recordings. As I became more interested in the field and in making research my career, I began looking into graduate programs, and discovered the remote Fly Circuits Journal Club at Columbia. I entered the master’s program, and in the summer of 2022, I returned to AFRL to work on programming a neural network on a custom neuromorphic multi-color optoelectronic synapse sensor, resulting in my first cross-institutional collaboration and peer-reviewed publication. As I entered the master’s program last fall, I undertook coursework with Aurel Lazar and enrolled in the theoretical neuroscience course at the Zuckerman Institute. Simultaneously, my boss invited me to Benjamin Wu propose my own project for my work with AFRL. I began to learn the visualization and execution tools of the Bionet Lab and interface with researchers at ZI to draft a project involving the computational modeling of the Drosophila visuomotor decision-making process for long versus short escape takeoff responses. After the project was approved, I began planning for the summer 2023 term. Throughout the spring, as I conducted the literature review, I took ECBM6070 under Professor Lazar, where I learned about the beautiful and intelligent alignment of the fruit fly retinal columns. Here, I knew that neuroscience was the right field for me. However, a hurdle presented itself in my project planning in that the simulation tools of the Bionet lab were limited and highly convoluted even for the medulla seven columns simulation, let alone the downstream neurons. At the right time, as part of my advanced theory course at the Zuckerman Institute, I discovered work by Srini Turaga at Janelia that introduced the Deep Mechanistic Network, which is just what I needed. With the pieces in place, this summer, I led a small team of AFRL Scholars to carry out my project plan, leading to a successful department presentation, poster presentation, and technical engineering memorandum. This fall, I have continued fleshing out the project independently and have extended the model to account for multi-colored visual input. Throughout this process, I have solidified my desire to work in the research industry, and my purpose for pursuing the PhD has further clarified: to gain the license necessary to autonomously manage my projects in the future insted of just working under others’ shifting timelines and funding. In the long term, I aim to become a leader of neuroscience research at the intersection of academia, industry, and defense. Within the engineering department at Columbia, I am excited by the prospect of applying what I have learned working with Deep Mechanistic Network model to expand the simulation capabilities of the Bionet Lab tool infrastructure to recently added datasets such as the ventral nerve cord and optic lobe. At Columbia, more broadly, I am excited by the prospect of collaborating with researchers in the Zuckerman institute whom I have previously conversed with during my coursework – particularly those doing connectomic research with the fruit fly. From my discussion with leaders in the field, there is a need for high-quality recording data processing pipelines for the purposes of pose- tracking, and the engineering department at Columbia is well positioned to fulfill this need. I am excited to be a liaison between professors within these two departments and employ my computational research experience to further the field of neuroscience. Benjamin Wu There have already been many times where I have had doors closed in my face. As I finished my final year of undergraduate and applied for the master’s at Columbia, I attended the Fly Circuits Journal Club at Columbia hosted by now assistant professor Gabrielle Gutierrez – but when I entered the program, the journal club shut down. As I worked with the AFRL on optoelectronic synapses and gained the opportunity to draft my own project description, I took it one step further and fleshed it out for an NDSEG fellowship application. However, after passing the initial rounds of subject-matter expert reviews, it was rejected in April by the DoD panelists. This fall, hoping to get a head-start on PhD preparations, I asked about the possibility of a funded position, but found out that AFOSR funding had fallen through. After completing my fall research commitment with the AFRL and applying for next spring and summer to finish this project, I have one last chance to knock on the door to fulfill this PhD dream – but I am also not putting all my hope in it, as I apply for full-time defense research positions. Thank you for taking the time to consider my application.",
    "Resume": "Benjamin Wu benjamin.wu@columbia.edu | (732) 822-7243 | Google Scholar EDUCATION Columbia University – Nikola Tesla Scholar New York, NY M.S. Electrical Engineering, GPA 3.54/4.0 Aug 2022 – Dec 2023 Courses: Evolutionary Computation, Computational Neuroscience, Advanced Theoretical Neuroscience Stony Brook University – Presidential Scholar Stony Brook, NY B.Sc. Applied Mathematics and Statistics, GPA 3.77/4.0 Aug 2018 – May 2022 Courses: Numerical Analysis, Artificial Intelligence, Honors Computer Science, Analysis of Algorithms Honors Thesis: Transfer Learning for EEG Signal Classification using 3D Neural Networks EXPERIENCE Air Force Research Lab Eglin, FL AFRL Scholar May 2021 – Present · Lead team project starting from ideation to proposal drafting, to implementation · Expanded connectome-constrained convolutional neural network to predict optic flow on color video · Simulated pattern recognition on neuromorphic optoelectronic sensor using custom neural network · Programmed deep neural networks for multi-object video tracking · Presented technical briefings to program director and multiple department heads Institute for Advanced Computational Science Stony Brook, NY Student Researcher Mar 2020 – May 2022 · Simulated device computations on supercomputing cluster, parallelized code for over 20× speedup · Programmed quantum random walk linear solver (QRWLS) from scratch using Python, qiskit · Analyzed effect of matrix sparsity on QRWLS performance under noisy IBM-Q device conditions Northrop Grumman Manhattan Beach, CA Microelectronics Foundry Support Intern May – Jul 2021 · Created tool for organizing and graphing circuit test data, reduced time from hours to seconds · Queried database using SQL and Python pandas to trace missing wafer counts · Tested technician workflow management web client, communicated errors to external vendor Microelectronics Wafer Level Packaging Intern Jun – Aug 2020 · Designed database and data collection procedures for airtightness tests, merged with legacy systems · Analyzed correlation between circuit hermeticity and wafer position · Programmed script to maximize circuit yield via discrete wafer placement optimization Enlighting Corp. Princeton, NJ Software Developer Jun – Aug 2018 · Built data-processing system from scratch with self-taught HTTP requests, Apps Script, JavaScript · Proposed and designed new front-end for user intuitiveness TECHNICAL SKILLS Data analysis and visualization (Pandas, pyodbc, PySQL, Matplotlib SQL, R) Scientific programming (Python, NumPy, SciPy, MATLAB, C++, Linux command line) Artificial neural networks, machine learning (PyTorch, TensorFlow, scikit-learn)"
}