{
    "ID": "285518974",
    "SOP": "KORALLA NAGA VENKATA CHANDRASEKHAR Structural analysis and its application to perform optimisation is fast expanding its horizons with new methods used to precisely represent the geometry using splines and to perform analysis to determine the energy stored by the structure. Newer criteria have been identified to check for the safety of the structure. I am interested to continue on my research work in the area of the structural analysis with optimisation. The use of optimisation to determine the layout of the steel within the reinforced concrete domain is one of the significant application of optimisation. The distribution of material at the ultimate elastic limit is the result of the topology optimisation. The forces carried by the structure at this optimal point of convergence is of practical significance. For example, to determine the prestressing force in a bridge pier will help the Engineer to know the magnitude of the tensile forces at the elastic limit. The application of optimisation to determine the optimal water pipe line network for a city is also one of the best examples in Civil Engineering. I have worked for several years as a teaching faculty at my home place in Hyderabad, India teaching both Undergraduate and Graduate students in Civil Engineering. I have taught several subjects as Strength of Materials I & II, Structural Analysis I & II, Advance Structural Analysis, Numerical Methods in Structural Engineering, Finite Element analysis. Conducted laboratory for Undergraduate and Graduate students in Strength of Materials Laboratory, Finite Element Analysis Laboratory. I have worked in the area of Topology Optimisation of continuum structures. I have worked on finite element analysis to analyse continuum structures. I have published a few papers in the topology optimisation of continuum structures. My intent to pursue my further study and research work in the field of computational mechanics is never ending. I see there is no possibility of any funding. I have a strong intent to continue my research work and explore further areas of study. I cannot live without research work simply taking classwork and grading is not what I want to do. Life without exploring new avenues and challenges is a stand still. I would like to put my thoughts to work on new ideas is all I want to do. I have started studying on advamced structural analysis and structural optimisation in my first semester at IIT in the year 1998. Did not understand much at that time but it was something interesting and challenging. The problems were too lengthy to solve by hand and there is lot of mathematical work required for each problem to determine the area of steel required. There is lot of focus on mathematics in my education since my high school. Mathematics is an integral part of many subjects in some form and required to analyse and solve the problems. The subject of Structural Optimisation is quite interesting in the sense it is used in several fields of study. In reinforced concrete member, to determine the amount of steel satisfying the strength and serviceability conditions, to lower the cost of the steel required. In a two dimensional plate carrying in-plane loading, the plate is modelled using linear splines and the optimal distribution of material in the design domain is determined. I have worked with several people in India and outside India in the field of Structural Engineering and also from allied fields. I have seen people and students who are extremely talented and proven successful. I am not one of their kind but I am definitely hard working individual. I have been working on optimisation of different types of structures for several years now. Inverse buckling formulation to perform topology optimisation of continuum structures and determine the deformed profile at KORALLA NAGA VENKATA CHANDRASEKHAR KORALLA NAGA VENKATA CHANDRASEKHAR optimal state of convergence. The buckling criteria is used to check for statbility criteria to determine the buckling load factor. The buckling load factor can give us an information on how much load the structure can carry before the buckling occurs. The inverse of the buckling load is taken as the objective function and the deformed profile is determined at convergence. Cubic basis splines have been used to model the geometry of the structure and perform analysis to determine the nodal displacements at each node. The results of the nodal displacements were compared with the results obtained from finite element analysis using six node linear strain triangular elements. Structural mechanics, solid mechanics and materials division of Structural Engineering is the place I would like to work. I would like to do my work on computational analysis of structures, model the structures and determine the deflections and stresses. I will work on new methods to perform optimisation of continuum structures. I can continue my present work into non-linear analysis to determine the optimal distribution of material within the design domain. Computational analysis of structures is one area where I can use finite element analysis and I can do basic coding in ForTran, C, MatLab. I have worked on gradient methods and meta-heurisitic based methods to perform the analysis. I have used the conventional method such as first order sensitivity analysis using optimality criteria to perform optimisation of structures. Non-gradient based heurisitic methods to perform optimisation of structures using genetic algorithms, firefly algorithm are few methods which I have used to conduct my research work. I would like to pursue my research work in the area of reliablity based stochastic analysis of structures and perform non- linear topology optimisation to determine the optimal layout of material. About my background, I am born in a middle class family. My father is a state government employee and mother is a house wife. Monthly salary is the only source of income to live and I come from a modest background and education to prosper is the only way for me to live. I did my undergraduate in Civil Engineering at Hyderabad, India in the year 1994-98. I then continued to study my graduate study with Masters in Structural Enginerng at IIT Bombay in the year 1998-00. I pursued my graduate studies with Masters in Business Administration from Johns Hopkins University, Baltimore, MD in the year 2004-06. The applications of structural optimisation has to reach the day to day life of an individual. Not many people have any know-how in this area of study. I came across a few who say Topology optimisation is just theoretical study. The study of optimisation should be encouraged in the regular class work of Undergraduate and Graduate study. The application of optimisation to Civil Engineering should be the part of the course work. The modelling of different materials in a concrete mix to determine the material properties of the combined mix is one area where optimisation can be used. The use of machine learning algorithms, deep learning algorithms is showing a new way to the field of optimisation and structural optimisation as well. I would want to start a computational analysis laboratory along with the course work for Undergraduate and Graduate students in Engineering. Conduct research related to computational analysis in Engineering. The area of Structural Optimisation which is largely dependent on the using of computers to perform the analysis is one of the KORALLA NAGA VENKATA CHANDRASEKHAR KORALLA NAGA VENKATA CHANDRASEKHAR prime areas of Engineering where in the knowledge and insight into Civil Engineering, Mathematics and Computers are coming together. The idea to develop the computational analysis as a specialisation in Engineering which is across the disciplines of Engineering and which serves as an interdisciplinary. KORALLA NAGA VENKATA CHANDRASEKHAR",
    "Resume": "K N V CHANDRASEKHAR Permanent Address Plot No: 25, Road No: 2B, handrapuri colony, L.B.Nagar, Hyderabad, 500074 Telengana. Email-id: biml . koralla 1 @ gmail .com Mobile: 7036155043 Academic Qualification: Degree Name of the Institute University Year of passing Percentage SSC Presidency High School Board of Secondary 1991 80% education Intermediate Rajadhani Jr. College Board of Intermediate 1993 83% Education B.E. M.V.S.R.Engineering Osmania University 1998 85% College MTech IITBombay IITBombay 2000 9.15 GPA MBA Johns Hopkins University Johns Hopkins University 2006 3.6 CGPA USA Graduate Aptitude Test of Engineering (GATE) – All India Rank – 100+ Functional areas of expertise: Finite element analysis, structural analysis, solid mechanics, structural optimisation Technical Areas of expertise: Operating Systems: Win 10, UNIX Software: Marc Mentat®, RISA 3D®, MS Office, VC++, MatLab® Databases: MS SQL server, MS Access Tools: MS Word, MS Excel, MS Power Point Professional Life Memberships 1. Life Member of Indian Society for Theoretical and Applied Mechanics, IIT Kharagpur 2. Life Member of Indian Society for Applied Mechanics, IIT Madras GIAN Courses Attended 1. Isogeometric Analysis at IIT Varanasi 2. Isogeometric Analysis at NITWarangal CAREER PATH Total Experience of 23.5years of teaching, research and industry experience Mahaveer Institute of Science and Technology Hyderabad 2021 to tilldate Associate Professor in the Department of Civil Engineering CVR College of Engineering Hyderabad 2016 - 2021 Assistant Professor in the Department of Civil Engineering Teaching Strength of Materials, Structural Analysis, Numerical Methods, Finite Element Analysis Global Institute of Engineering and Technology Hyderabad 2016 Affiliated to JNTUH Associate Professor in the Department of Civil Engineering Sirindhorn International Institute of Technology, Thailand 2013 Research Scholar Aurora Technical & Research Institute Hyderabad 2011 Associate Professor & Head, Department of Civil Engineering Teaching Structural Analysis, Building Materials and Construction, RCC, Surveying Lab, SOM Lab Bentham Institute of Management 2009 Dean Academics, Quality Nominee, Finance Faculty AdamSmith Institute of Management 2008 Economics, Banking and Finance Faculty ICICI Bank Bandra-Kurla Complex, Mumbai 2006 Role: Senior Manager Cross selling and Up selling CITICORP Citibank London, United Kingdom 2001 Role: Project Lead Zero Balancing Accounting (ZBA) Account Server CITICORP 2000 Role: Team Member PERSONAL DETAILS: Father’s name: Shri. K. Eswara Rao Date of Birth: 25-07-1976 Age: 47 Years Marital Status: Married Scopus Author ID: 57209400740 ORCID 0000-0003-3930-1196 Publons Web of science Id ABB-3964-2020 AICTE Id 1-3199093162 JNTU Academic Audit ID 3060-160315-080646 New JNTU Faculty Registration ID 1050-210708-141630 Academic Bank of Credits ID 564-817-219-619 Reviewer 1. International Structural Engineering Conference, Chicago, USA, 2023 2. The Fourth European and Mediterranean Structural Engineering and Construction Conference June 20-25, 2022, Leipzig, Germany 3. IEEE Access 4. Advances in Structural Engineering Journal List of Publications International Journals (Scopus Indexed) 1. Sahithi, KNV Chandrasekhar, “Isogeometric Topology Optimisation of continuum structures using Evolutionary algorithms”, J. Appl. Comput. Mech, DOI: 10.22055/JACM.2018.26398.1330 2. KNV Chandrasekhar, V Bhikshma, Syed Abdul Mohi “On the six node hexagon elements to perform topology optimisation of plates carrying in plate loading and shells carrying out of plane loading” J. Appl. Comput. Mech., 6(3) (2020), DOI: 10.22055/JACM.2019.28993.1532 3. KNV Chandrasekhar, V Bhikshma, K Udaya Bhaskara Reddy “Topology optimisation of laminated composite shells” J. Appl. Comput. Mech, In the press 8(2), 2022 International Journals (Web of Science Indexed) 4. KNV Chandrasekhar, V.Bhikshma, Ch.Madhusudhana Chary, Maduri Venkatsai “Cubic B-splines for Isogeometric Analysis of Laminated Composite Plates Subjected to Hygroscopic Loading Using Classical Laminated Plate Theory,” Journal of Polymer & Composites, Vol.9, Issue 3, December 2021. ISSN: 2321-2810 (Online), ISSN: 2321-8525 (Print). DOI (Journal): 10.37591/JoPC Indexed in Civilica 1. KNV Chandrasekhar, V Bhikshma, N Rakesh, Swapna Reddy, C Rakesh “Isogeometric analysis for topology optimisation of two dimensional planar and laminated composite plate continuum structures,” J. Solid Mech., 13(2), 2021 International Conferences 1. B.Archana, K.N.V.Chandrasekhar, Dr. T. Muralidhara Rao \"Topology Optimization of Continuum Structures Using Firefly Algorithm\" Proceedings of 61st Congress of ISTAM (http://istam.iitkgp.ac.in) Held at: VITU - Vellore, India, Dec. 11-14, 2016 2. Sravali, Thulla, KNV Chandrasekhar, TMRao \"A study on Performance Based Indices to perform Topology Optimisation of Continuum Structures using Swarm Intelligence Firefly Algorithm - II\" 62nd Congress of ISTAM, IITKGP, To be held at: OU - Hyderabad, India, Dec. 15-18, 2017 3. NSS Sahithi, KNV Chandrasekhar,TM Rao \" Multi population parallel search engines to perform Isogeometric Topology Optimisation of continuum structures using Swarm Intelligence Aqua Search algorithm\" 62nd Congress of ISTAM, IITKGP, To be held at: OU - Hyderabad, India, Dec. 15-18, 2017. 5. KNV Chandrasekhar et.al. “Evolutionary algorithms for performance based topology optimisation of continuum structures,” MJCET 6. KNV Chandrasekhar, V Bhikshma, M VenkatSai “Cubic b-splines for isogeometric analysis of laminated composite plates subjected to hygroscopic loading” VSAM, January 2021 7. KNV Chandrasekhar et.al., “Isogeometric analysis to perform topology optimisation of planar reinforced concrete structures using first order b-splines,” VSAM May 2021 National Journals 1. KNV Chandrasekhar \"Second order sensitivity analysis and fundamental frequency based optimisation to perform topology optimisation of continuum structures using evolutionary algorithm,\" i-managers journal on structural engineering, vol. 9 l no. 2 l June - August 2020, ISSN 2278-7887 2. KNV Chandrasekhar “Static analysis of laminated composite plate using six node linear strain triangular elements,\" i-managers journal on structural engineering, vol. 8 l no. 4 l December 2019 - February 2020, ISSN 2278-7887 3. KNV Chandrasekhar “Design of reinforced cement concrete corbel and perform free vibration and buckling analysis,\" i-managers journal on structural engineering, vol. 9 l no. 1 l March - May 2020, ISSN 2278-7887 4. KNV Chandrasekhar “A study of free vibration and forced vibration characteristics of laminated composite elliptical paraboloid shells,\" i-managers journal on structural engineering, vol. 9 l no. 1 l March - May 2020, ISSN 2278-7887 5. KNV Chandrasekhar “Optimisation of steel transmission tower structure using firefly algorithm,\" i- managers journal on structural engineering, vol. 6 l no. 2 l June - August 2017, ISSN 2278-7887 6. KNV Chandrasekhar “Bending characteristics of reinforced concrete beams,\" i-managers journal on structural engineering, vol. 6 l no. 3 l September - November 2017, ISSN 2278-7887 7. KNV Chandrasekhar “A step by step procedure to perform isogeometric analysis of beam and bar problems in civil engineering including sizing optimisation of a beam,\" i-managers journal on structural engineering, Vol. 7 | no.1 | Mar - May 2017, ISSN 2278-7887structural engineering, Volume 6. no. 4 December 2017-February 2018, ISSN 2278-7887 8. KNV Chandrasekhar “A step by step procedure to perform hygroscopic analysis of laminated composite plate using six node linear strain triangular elements with coding in ForTran®,\" i-managers journal on structural engineering, Vol. 9 l no. 4 l December 2020 - February 2021, ISSN 2278-7887 9. KNV Chandrasekhar “A study on parameters of firefly algorithm for topology optimisation of continuum structures – II,\" i-managers journal on structural engineering, Vol. 6 l no. 1 l March - May 2017, ISSN 2278-7887 10. KNV Chandrasekhar “Free vibration analysis of laminated composite conoidal shells using six node linear strain triangle elements,\" i-managers journal on structural engineering, Vol. 8 l no. 3 l September - November 2019, ISSN 2278-7887. 11. KNV Chandrasekhar “A comparative study on evolutionary algorithms to perform isogeometric topology optimization of continuum structures using parallel computing,\" Journal of aerospace engineering & technology, Vol.8 Issue 1, 2018, ISSN 2348-7887 12. KNV Chandrasekhar “A step by step illustrative procedure to perform isogeometric analysis and find the nodal displacements for a two dimensional plate structure,\" i-managers journal on structural engineering 13. P. Srilatha, D.Narmada, D.Tarun Kumar, M.Arun, D.Yuva Kumar, KNV Chandrasekhar (2022) “First order basis splines to perform isogeometric topology optimisation to design the outline of the bridge pier and analyse using Idea Statica,” imanager Journal on Civil Engineering, Vol.12, Issue 2, May 2022 14. KNV Chandrasekhar, V.Bhikshma (2022) “Cubic basis splines to perform topology optimisation of laminated composite regular cylindrical and elliptical and hyperbolic thin shell structures using inverse buckling formulation,” imanager Journal on Civil Engineering, Vol.12, Issue 2, May 2022 15. KNV Chandrasekhar, V.Bhikshma (2022) “First Order Basis Splines to perform Isogeometric topology optimisation of three dimensional structures,” imanager journal on Civil Engineering, Vol.12, Issue 3, August 2022 16. KNV Chandrasekhar, V.Bhikshma (2022) “Cubic b-splines to perform topology optimisation with buckling load on carbon fibre nano reinforced simply supported cross ply laminated composite square plates using inverse buckling formulation,” imanager Journal of Civil Engineering, Vol.12, Issue 4, November 2022. List of Patents/Designs 1. Title: Interlocking Gabion Frame for Structural wall Design Application Number: 373584-001 Design application Granted Date: 04/11/2022 List of MTech Projects completed S. No. Project title Year 1 Response of structural components subjected to blast loading 2016 2 Topology optimisation of continuum structures using firefly algorithm 2016 3 A study on performance based indices to perform topology optimisation 2017 of continuum structures using swarm intelligence fire fly algorithm 4 Nurbs based isogeometric analysis to perform topology optimisation of 2018 continuum structures using evolutionary algorithms 5 Second order sensitivity analysis and fundamental frequency 2018 optimisation to perform topology optimisation of continuum structures using evolutionary algorithm 6 Free vibration and forced vibration 2019 characteristics of laminated composite elliptical paraboloid shells 7 Six node hexagon element to perform static analysis, vibration analysis 2019 and topology optimisation of continuum structures 8 Free vibration analysis of laminated composite conoidal shells using six 2019 node linear strain triangle elements 9 Strain Energy based and fundamental frequency based topology 2019 optimisation of laminated composite plates and shells 10 An experimental investigation on nano concrete for bubble deck slab 2019 mixed with graphene oxide 11 Bending characteristics of laminated composite plates and shells having 2020 cutouts subjected to hygroscopic loading 12 Cubic b-splines to perform topology optimisation with buckling analysis 2021 of simply supported cross ply laminated composite square plates 13 First order b-splines to perform topology optimisation of three 2021 dimensional continuum structures 14 First order b-splines to perform topology optimisation of two 2021 dimensional reinforced concrete structures using optimality criteria List of BTech Projects S.No. Title of the Project Year 1. Design and analysis of bridge pier using idea statica® 2022 2. Design and analysis of pratt truss bridge joint using idea statica® 2022 3. Residual compressive strength of concrete cubes mixed with nano alumina 2023 at high temperatures and estimate stress strain behavior using machine learning - wip"
}