{
    "ID": "779314189",
    "SOP": "Statement of Purpose Kaustubh Sapru Statement of Purpose – PhD Admissions, Spring 2024 Throughout my formative years I’ve harbored a singular focus - impacting the lives of millions. I have nurtured a deep curiosity about how thing’s work, taking an interest in a range of disciplines from the restaurant business to healthcare. An underlying thread across these interests is the shared applicability of problem definition, articulation, and problem solving. Focusing on the metrics surrounding seemingly disparate areas such as customer feedback to utilizing patient data to discern trends for blood cancer treatment led me into the realm of machine learning. Having applied machine learning techniques in different environments I began developing solutions to complex problems on a larger scale. My interests lie at the intersection of statistical decision making, generative AI, computer vision, and predictive modeling. I believe a multi-faceted approach involving advances in algorithms, probabilistic inference, and human-robot interactions has enormous potential to create large scale change and impact. I am motivated to address medical negligence, an issue that has been an underlying cause of personal loss and grief. Working toward the development of an equitable, accessible, and automated early disease diagnosis system is my best shot at achieving the goal of impacting millions of lives. My journey into AI began rather unconventionally in 2016 while running a takeout business of authentic Kashmiri cuisine. Initially meant to support mine and my brother’s education, it swiftly turned into a means of representing our lost cultural heritage. In 2019, I expanded operations by utilizing data analytics coupled with machine learning to target specific demographics and identify return customers. Simultaneously, I reached out to AI engineers from universities across India and the UK, pitching ideas for an AI powered early cancer detection system, which eventually led to a partnership with a local cancer treatment startup for the underprivileged. The startup maintained a database that housed HLA data used to match patients with potential donors for bone marrow transplants. To expand the database, I worked with a team of doctors and engineers to organize stem cell donation camps across the city where I educated people on the concepts and importance of transplants. I applied my newly acquired AI skills to identify probabilities of optimal patient-donor matches. To further my understanding of AI’s broader implications, I joined the Neural Engineering Lab as a graduate data scientist in June 2021 at the City College Center for Discovery and Innovation (CDI). At the Neural Engineering Lab, I found the AI community's strength lay in its openness to diverse ideas and collaborations. A pivotal relationship was fostered through mentorship from Prof. Lucas Parra, marked by daily brainstorming sessions exploring innovative concepts and strengthening my problem solving ability. I was able to enhance our team's analytical capabilities by developing a computer vision software analyzing human neural responses to facial stimuli. This addressed the larger goal of quantifying attention and engagement in humans. Widely adopted within the Parra Lab, this software supported independent research, overcoming challenges like class imbalance, improving network architecture, heightened accuracy despite scarce and uneven sampled training data, and identifying features that most accurately predict neural response. Statement of Purpose Kaustubh Sapru Since my foray into AI at City College, I have worked with leaders of financial trading companies and developers of AI powered applications. Here I had the opportunity to build upon my foundational work at CDI and I scaled my solutions. I have been inspired by the work done by Prof. Regina Barzilay at MIT, who is transforming automated early cancer detection. Her work, published in 2022 (EquiDock), raised important questions about protein flexibility for drug discovery. My most recent endeavor with Prof. Bruce Johnson, at the Advanced Science Research Center, New York, aimed at developing models that predict protein flexibility profiles using generative AI. I was able to integrate these models to NMRFx Analyst (NMR data processing software) after overcoming challenges such as saturating model accuracies, slow training times, and adding new variables to the training data. My academic training and intensive research experience has equipped me with skills such as data analysis, statistical inference, hypothesis testing, development of generative AI models, improving prediction accuracies, and data visualization. I am interested in building upon the important work of leaders in the field, including Prof. Vondrick, Prof. Zemel, Prof. Smith, Prof. Azizi, Prof. Elhadad, and Prof. Alquraishi at the Computer Science department, by devising AI models that utilize images, text, and structured data to identify trends that affect early diagnosis, treatment, and disease prevention. Computer Science at Columbia offers a unique setting where teaming up with individuals from diverse backgrounds pushes the boundaries of what is achievable. Capitalizing on industry partnerships and the interdisciplinary atmosphere, coupled with my entrepreneurial spirit, I am eager to harness my strong work ethic in pursuit of my mission: addressing the deficiencies in our current societal landscape. I bring to the table a strong sense of organization, self-motivation, and resourcefulness, along with a creative mindset that thrives in team settings. Columbia’s commitment to nurturing historically underrepresented communities fosters an environment conducive to open expression and innovation. Having witnessed firsthand the profound impact of small initiatives, whether with the kitchen or the lab, I am committed to not only pioneering groundbreaking solutions but ensuring their ethical deployment for the greater good. Yet, amidst these achievements, I've learned that true impact lies not just in the solutions we create, but in the communities we empower and the compassion we impart. As I stand at this career juncture, poised to apply past knowledge together with knowledge gained at Columbia, I'm reminded of the responsibility that accompanies expertise. It's not just about the technical advancements, but the ethical and societal implications ingrained within them. In conclusion, my journey is not solely about conquering technical challenges, but about leveraging AI as a tool for profound societal change. I am driven by a fervent desire to create solutions that innovate, empathize, and empower. This convergence of expertise and empathy, I believe, is the catalyst for true, enduring transformation. Personal Statement Kaustubh Sapru Personal Statement – PhD Admissions, Spring 2024 Entrepreneurship is the best source of community development. After running a takeaway of authentic Kashmiri cuisine for five years, connecting with various people from different backgrounds and cultures has been impactful beyond measure. Initially this venture was meant to support my and my brother’s education, however it quickly turned into a means of representing our lost language, culture, and identity. My homeland, Kashmir, had a long standing tradition of scholarship older than two millennia. A bloody genocide in the 1990s, due to terrorism in the region, not only uprooted that tradition but also displaced what was once a close knitted community and culture. With a family that was attacked and held captive by terrorists, the aftereffects of such a mass upheaval were not just economic but also emotional. Quintessentially, as resilient people, we rekindled a long lost camaraderie through connections made from our takeaway. In pursuit of providing our patrons with an authentic experience, I underwent an evolution in my personality wherein I learned my own language and the history of my homeland which originally spawned its scholarly tradition. This quest for knowledge prompted me to expand business operations by harnessing analytics over accumulated customer data to derive valuable consumer insights. Given my engineering background, I naturally gravitated towards machine learning backed data analytics. Subsequently, this fascination led me to pursue a diploma to focus on machine learning and data analytical approaches. Therein began my tryst with AI. As I began to delve into the foundations of AI, in an unfortunate turn of events, the passing of my grandfather due to medical negligence had me pondering on ‘Is there a way to predict indications of organ failure, expediting medical attention for its prevention?’. This question became the catalyst for my journey into AI driven healthcare, as I translated physiological medical records into machine readable features and applied the newly acquired fundamentals of machine learning to develop a universally applicable prediction system. To expand on the idea, I reached out to engineers and managers pitching ideas and receiving feedback that eventually led to my venture merging with a local startup also led by a fellow Kashmiri. This startup actively treated patients with blood disorders. I partnered with them to work on a remotely operated AI powered disease detection and prediction system. Owing to India’s large rural population, the patient to doctor ratio is highly skewed. It was imperative that reliable diagnosis from urban and suburban centers could reach people who did not have access to sufficient healthcare. As I progressed into the deployment stage, it became apparent that I had a long way to go before I could bridge the gap between theoretical concepts and practical application, especially if it entailed utilizing the rapid innovations in AI. Therefore, I registered for a master’s degree in biomedical engineering with a focus on data science at City College New York. Since my journey into AI at City College, I have worked with leaders of financial trading companies and developers of AI powered applications, allowing exposure to the intricacies of articulating problems followed by testing and automating solutions, and then scaling them. My most recent development with Prof. Bruce Johnson at the Advanced Science Research Center was a model predicting protein movement profiles using GANs based on experimental NMR data. Additionally, I designed a multi-cascaded architecture of FNet Auto-Encoders, Time to Vector Transformers, and Residual ConvNets trained on multi-channel time series NMR data to predict properties of sparsely populated protein conformations crucial to drug discovery. Having integrated both models with the NMRFx Analyst, a software that primarily processes experimental data, I honed Personal Statement Kaustubh Sapru my skills to include data analysis, statistical inference, hypothesis testing, development of machine learning/deep learning models, data manipulation and visualization. With these skills, I believe I can make constructive contributions to machine learning, artificial intelligence, computer vision, NLP or the computational biology groups at the Computer Science department at Columbia. One of the defining strengths of the AI community is its openness to diverse ideas and collaboration opportunities. One of the pivotal relationships that quickly propelled me towards becoming a proficient problem solver was the mentorship I received from my supervisor, Prof. Lucas Parra. Our interactions were marked by day to day brainstorming sessions, during which we consistently explored innovative concepts. Through these collaborative efforts, I enhanced the analytical capabilities of my research team by creating a computer vision software program designed to analyze the neural response of human subjects exposed to facial stimuli. This addressed the larger goal of quantifying attention and engagement in humans. My contribution ultimately culminated in the publication of our findings in Nature Communications and my thesis has had increasing viewership around the globe ever since. This accomplishment was further acknowledged and celebrated by both the Biomedical Engineering department and my advisor, who honored me with multiple prestigious awards for my dedicated work. With a comprehensive background in biomedical engineering, which encompasses intensive research experience and a solid three-year tenure as a professional data scientist, I find myself well-positioned to explore the intricacies of computer science at a deeper level. This endeavor promises to provide my ideas with a more substantial foundation, enhancing their potential for impactful outcomes. Nestled in the vibrant city of New York, Columbia University offers a unique setting where collaboration with individuals from diverse backgrounds pushes the boundaries of what is achievable. Capitalizing on industry partnerships and the interdisciplinary atmosphere, coupled with my entrepreneurial spirit, I aspire to make a meaningful difference in the lives of millions, which constitutes my ultimate goal. I bring to the table a strong sense of organization, self-motivation, and resourcefulness, along with a creative mindset that thrives in team settings. My ability to identify problems and collaborate with teams to propose efficient solutions is a testament to my skill set. In addition to my formal education and professional experience, I have also demonstrated my commitment to becoming a proficient code developer through multiple online courses and successful completion of various coding tests. Since my initial encounter with artificial intelligence, I have diligently pursued every opportunity to expand my knowledge, and my enthusiasm for continued growth in this cutting-edge domain intensifies with each passing day. My interactions with researchers, including instructors and fellow students at Columbia University, have deepened my appreciation for Columbia’s commitment to diversity and inclusion. I firmly believe that this dedication to historically underrepresented communities will afford me the freedom to express my ideas openly, brainstorm innovative solutions, and bring them to fruition. Having witnessed firsthand the profound impact even small initiatives can make, I am eager to harness my strong work ethic in pursuit of my mission: addressing the deficiencies in our current societal landscape to benefit the broader population. Consequently, I am at a juncture in my career where I am prepared to take the next significant stride and effectively apply the knowledge I acquire at Columbia University to positively shape our ever-evolving society.",
    "Resume": "KAUSTUBH SAPRU 646 417 4838|kaustubh.sapru@gmail.com|github.com/KaustubhSapru92|LinkedIn CAREERHIGHLIGHTS AI Researcher with 3 years of experience in writing production-ready code to develop, deploy and scale AI/ML systems. Passion for extracting meaningful insights driven by feature engineeringoncomplexdatasetsforbetter model learning backed with extensive statistical analyses and extensivedatavisualization.Workingknowledgein developing machine learning pipelines from inception to completion in areas of Computer Vision, Natural Language Processing (NLP) and Multi-modal systems. Ideated on new ML approaches to drive rapid prototyping andproductioncontracts.Highlymotivatedcuriositydrivenapproachwithabilitytoexploreunchartedterritory. TECHNICALSKILLS -Programminglanguages:Python,Matlab,C++,SQL,Tableau -Frameworks:PyTorch,TensorFlow,Keras,Git,OpenCV,ScikitLearn,Pandas,OpenCV,Docker,IntelliJ -CloudPlatforms:GoogleCloudPlatform,MicrosoftAzure,AWS,GitCodespace -Certifications:BigData-MySQL,DeepNetworks-PyTorch,AIWorkflow,TimeSeriesPrediction WORKEXPERIENCE ComputationalScientist–AdvancedScienceResearchCenter/RFCUNY Sep2022–Sep2023 PredictiveModelingforTimeSeriesMulti-ChannelExperimentalSignal ● Collaborated with stakeholders to identify opportunities for AI-driven solutions to drug discovery/manufacturing. Deployed scaled end-to-end standalone application that analyzes rare proteins throughtheNMRFxAnalystSoftware(nmrfx.org/analyst). ● Designed and trained bespoke multi-cascaded network architecture consisting of FNet Auto-Encoders, Time to Vector Transformers, Residual Convnets on multi-channel time domain experimental data to deliverpredictionsforpropertiesofrareproteins. ● Utilized GPU cluster backed parallel processing through TensorFlow for accelerated training efficiency on trainingdataandautomatedtraining,testingthroughDocker. ● Implemented evaluation metrics to test efficacy of deployed model and deployed statistical measures to comparemodelperformancewithothermodelarchitectures. GenerativeAIforPredictingProteinMovementPatterns ● Explored generative AI models like GANs and Diffusion models for predicting movement patterns for proteinstructuresviaself-supervisedlearningtoimprovedrugdiscovery. ● Created a multi-modal generator architecture to process signals and NMR data recorded at different magneticfieldstrengthstoestimateproteinmovement. ● Collaborated with interdisciplinary teams to employ bayesian weighted sampling of training data taken at differentfieldstrengthstoensurescalabilityandhigherpredictionaccuracy. Conference:ExperimentalNMRConference2023(Poster),NYStructuralBiologyDiscussionGroupConference DataScientist–CenterforDiscoveryandInnovation(NeuralEngineeringGroup) Jun 2021–Sep2022 ComputerVisionSoftwaretoAnalyzeNeuralResponsetoCartoonFacesinVideos ● Collaborated with cross functional teams to develop computervisionsoftwaretotrack,curateandprocess eyemovementsofhumansubjectsto facemovementsofcharactersinanimatedmovieclips. ● Spearheaded the strategy to track face movements of specific characters throughout movie clips using deep learningobjectdetectionnetworkssuchasDetectron2(byFacebook)on36000frames. ● Developed an application to automate identification of inaccurate face labels and their replacement with correctones.Thesis:https://academicworks.cuny.edu/cc_etds_theses/1066/ ● Engineered training data to improve baseline bounding box average precision of the model from 43% to a maximumof71%andaclassificationaccuracyof80%.Code:https://lnkd.in/dB2Z6vJ3 ● Transformed eye tracking data into machine-readable features, used machine learning to select most importantfeatures,trainingaclassifiertoclassify19,565datapointsasgoingtofaceorawayfromface. PredictiveModelingtoDetectAnomaliesinStockMarketData ● Developedamodeltopredictahaltinstockmarkettradingpreciselyoneminutebeforeitsonset. ● Analyzed multiple days of stock trading to generate insights on trading patterns to devise a strategy to understanddynamicsaroundastockmarkethalt(circuitbreakerevent). ● Deployed machine learning to establish the rate of price drop within each minute of the trading. Executed the trainedmodelondatafor20thMarch2020toaccuratelypredictthecircuitbreakereventforthedayand to testitsefficacy.Code:https://lnkd.in/dJaM88TC ImpactofCOVID-19onEducation:AMachineLearningandStatisticalAnalysis ● Organized and conducted a study on a group of 150 students to determine which group based on gender, ageandeducation levelwouldpreferonlineeducationtoin-personeducation. ● Performed statistical testing to determine that less than 50% students prefer online education with 99% confidence(p<0.01). ● Employed machine learning to determine probabilities of groups, based on gender, age and education, to prefer online education to in-person education. Two groups emerged with the highest probability: 1) Male, Age25-43withamaster’sdegreeand2)Female,Age:18-24havingabachelor’sdegree. ● Transformed the data to achieve accuracy of 86.3% compared to 69% on raw data revealing a 90.6%area undertheROCcurve.Code:https://lnkd.in/eQfMvCW Conferences: Neuroergonomics Conference and NYC Neuromodulation Conference 2022 ResearchScientist–ChimeraTranslationalResearchFraternityPvtLtd. Feb2019–Apr2019 ● Managed and expanded the Human Leukocyte Antigen (HLA) matchmaking database used for matching patientswithblooddisordersthroughstemcelltransplantswithpossiblesuitabledonors. ● Set up stem cell donation camps to attract future possible donors. Stored sequenced data in the matchmaking database for the donor’s chromosome 6, exon 1, exon 2 to determine HLA type (High resolutionHLAtyping). ● Utilized machine learning to identify best possible patient-donormatchesfor14HLAtypeshighlyprevalent intheIndianpopulation. ● Submitted a proposal to indigenously develop a HLA matching kit specifically for the 14 identified HLA types.(HLAmatchingkitisimported) JuniorResearchFellow–IndianInstituteofScience,Bangalore(IISc) Aug2016-Jan2019 ComputerAidedClassificationofDifferentStagesofBreastCancer ● Identified ICIAR2018 breast cancer histology dataset with 400 images attributed to four classes namely: normal,benign,insitucarcinoma,invasivecarcinoma ● TrainedaconvolutionalneuralnetclassifierusingPytorch,accuracy=80% ProjectAssociate–IndianInstituteofTechnology,Delhi Aug2015-Nov2015 ImageProcessingToolforNon-InvasiveGlucoseDetection ● Developed an open-source image processing tool to analyze optical biosensor data to determine glucose concentrationinasalivarysample ● ImplementedthealgorithmusingAndroidStudioanddevelopedanandroidapplication ACADEMICAWARDSANDHONORS ● RukinAwardForAcademic&ProfessionalPerseverance($2000)-BiomedicalEngineering(BME),CCNY ● NeuralEngineeringGroupScholarship($2000) ● AllIndiaRank62(99.4percentile),GraduateAptitudeTestofEngineering(GATE2016) ● ThaparUniversityScholarship2012(27,500IndianRupees) EDUCATION MS,BiomedicalEngineering–TheCityCollegeNewYork,CUNY(GPA:4.0) Aug2020- Sep2022 PostGraduateDiploma,ML&AI–AmityUniversityOnline(GPA:8.35/10) Jul2019 - Jul2020 BachelorofTechnology,Biotechnology–ThaparUniversity(GPA:6.81/10) Aug2011 -Jun2015 PUBLICATIONS Nentwich M, Leszczynski M,RussBE,HirschL,MarkowitzN,SapruK,SchroederCE,MehtaAD,BickelS,ParraLC. Semantic novelty modulates neural responses to visual change across the human brain. Nat Commun. 2023 May22;14(1):2910.doi:10.1038/s41467-023-38576-5.PMID:37217478;PMCID:PMC10203305. TEACHINGASSISTANTSHIP ● TA-ImageandSignalProcessing,BMECCNY(Spring2022),Instructor:Prof.LucasParra ● CUNYTutorCorps-ComputerScienceandComputerProgramming(Fall2021) OTHEREXPERIENCE/VOLUNTEERWORK ● ResearchInternship2014withProf.SheilaMacNeil-KrotoResearchInstitute,UniversityofSheffield,UK ● Traveled to Cold Spring Harbor Laboratory during June - July 2023 for interactive sessions on Machine LearningforSTAMPRbottlenecks. VolunteerWork: ● HighSchoolExamWritingforBlindStudents-2010 ● English,MathClassesforUnderPrivilegedHigh/MiddleSchoolStudents-2023 EXTRACURRICULARACTIVITIES ● Proficient Guitar player/Singer with a Youtube channel/blog which has accumulated views of over two million.https://www.youtube.com/user/metalgodmaiden ● Performed(withmybandPrithvi)andpartoftheorganizingteamofKashmiriPanditYouthFestival2011. ● Headlined SHUHUL TAAP III, a 3 day Kashmiri Pandit Cultural event, presided by Chief Minister of Delhi, Smt. Sheila Dixit and various renowned clubs such as Hard Rock Café, Café Morrison, Turquoise Cottage etcwithmybandPrithvi. ● Convener of the MUDRA (Music & Dramatics) Society of Thapar University. Led organizing committee of stageperformancesandallculturaleventsintheUniversity. ● Organizing team of Annual University Cultural Night 2012, 2013 and SUR (Intra- College Musical event) 2011,2012,2013,2014. ● FirstprizeinInstrumentalcompetition,IZHAAR2012(Intra-CollegeCulturalcompetition). ● FirstprizeinPunjabiSolo,PunjabiDuetinIZHAAR2013,HindiDuetinIZHAAR2014 ● Player of University Cricket Team, Winner of Inter-Engineering; Inter University Cricket Tournament 2015, heldatPunjabEngineeringCollege(PEC). SolutiondesignAI-drivensolutionsDataacquisitionPreprocessingFeatureengineeringModelselectionDeploymentAIalgorithmdevelopmentMachinelearningDatainsightsModeltrainingModelevaluationModelperformanceMetricsModeldeploymentSystemintegrationPerformanceoptimizationA/BtestingData analysisDatavisualizationExploratorydataanalysisPatterndiscoveryInsightsDashboardsCollaborationKnowledgesharingExperimentationPerformanceimprovementResourceutilizationDatascientistsSoftwareengineersDomainexpertsDocumentationReportingReproducibilityMaintainabilityProjectprogress. KAUSTUBH SAPRU 646 417 4838|kaustubh.sapru@gmail.com|github.com/KaustubhSapru92|LinkedIn CAREERHIGHLIGHTS AI Researcher with 3 years of experience in writing production-ready code to develop, deploy and scale AI/ML systems. Passion for extracting meaningful insights driven by feature engineeringoncomplexdatasetsforbetter model learning backed with extensive statistical analyses and extensivedatavisualization.Workingknowledgein developing machine learning pipelines from inception to completion in areas of Computer Vision, Natural Language Processing (NLP) and Multi-modal systems. Ideated on new ML approaches to drive rapid prototyping andproductioncontracts.Highlymotivatedcuriositydrivenapproachwithabilitytoexploreunchartedterritory. TECHNICALSKILLS -Programminglanguages:Python,Matlab,C++,SQL,Tableau -Frameworks:PyTorch,TensorFlow,Keras,Git,OpenCV,ScikitLearn,Pandas,OpenCV,Docker,IntelliJ -CloudPlatforms:GoogleCloudPlatform,MicrosoftAzure,AWS,GitCodespace -Certifications:BigData-MySQL,DeepNetworks-PyTorch,AIWorkflow,TimeSeriesPrediction WORKEXPERIENCE ComputationalScientist–AdvancedScienceResearchCenter/RFCUNY Sep2022–Sep2023 PredictiveModelingforTimeSeriesMulti-ChannelExperimentalSignal ● Collaborated with stakeholders to identify opportunities for AI-driven solutions to drug discovery/manufacturing. Deployed scaled end-to-end standalone application that analyzes rare proteins throughtheNMRFxAnalystSoftware(nmrfx.org/analyst). ● Designed and trained bespoke multi-cascaded network architecture consisting of FNet Auto-Encoders, Time to Vector Transformers, Residual Convnets on multi-channel time domain experimental data to deliverpredictionsforpropertiesofrareproteins. ● Utilized GPU cluster backed parallel processing through TensorFlow for accelerated training efficiency on trainingdataandautomatedtraining,testingthroughDocker. ● Implemented evaluation metrics to test efficacy of deployed model and deployed statistical measures to comparemodelperformancewithothermodelarchitectures. GenerativeAIforPredictingProteinMovementPatterns ● Explored generative AI models like GANs and Diffusion models for predicting movement patterns for proteinstructuresviaself-supervisedlearningtoimprovedrugdiscovery. ● Created a multi-modal generator architecture to process signals and NMR data recorded at different magneticfieldstrengthstoestimateproteinmovement. ● Collaborated with interdisciplinary teams to employ bayesian weighted sampling of training data taken at differentfieldstrengthstoensurescalabilityandhigherpredictionaccuracy. Conference:ExperimentalNMRConference2023(Poster),NYStructuralBiologyDiscussionGroupConference DataScientist–CenterforDiscoveryandInnovation(NeuralEngineeringGroup) Jun 2021–Sep2022 ComputerVisionSoftwaretoAnalyzeNeuralResponsetoCartoonFacesinVideos ● Collaborated with cross functional teams to develop computervisionsoftwaretotrack,curateandprocess eyemovementsofhumansubjectsto facemovementsofcharactersinanimatedmovieclips. ● Spearheaded the strategy to track face movements of specific characters throughout movie clips using deep learningobjectdetectionnetworkssuchasDetectron2(byFacebook)on36000frames. ● Developed an application to automate identification of inaccurate face labels and their replacement with correctones. ● Engineered training data to improve baseline bounding box average precision of the model from 43% to a maximumof71%andaclassificationaccuracyof80%.Code:https://lnkd.in/dB2Z6vJ3 ● Transformed eye tracking data into machine-readable features, used machine learning to select most importantfeatures,trainingaclassifiertoclassify19,565datapointsasgoingtofaceorawayfromface. PredictiveModelingtoDetectAnomaliesinStockMarketData ● Developedamodeltopredictahaltinstockmarkettradingpreciselyoneminutebeforeitsonset. ● Analyzed multiple days of stock trading to generate insights on trading patterns to devise a strategy to understanddynamicsaroundastockmarkethalt(circuitbreakerevent). ● Deployed machine learning to establish the rate of price drop within each minute of the trading. Executed the trainedmodelondatafor20thMarch2020toaccuratelypredictthecircuitbreakereventforthedayand to testitsefficacy.Code:https://lnkd.in/dJaM88TC ImpactofCOVID-19onEducation:AMachineLearningandStatisticalAnalysis ● Organized and conducted a study on a group of 150 students to determine which group based on gender, ageandeducation levelwouldpreferonlineeducationtoin-personeducation. ● Performed statistical testing to determine that less than 50% students prefer online education with 99% confidence(p<0.01). ● Employed machine learning to determine probabilities of groups, based on gender, age and education, to prefer online education to in-person education. Two groups emerged with the highest probability: 1) Male, Age25-43withamaster’sdegreeand2)Female,Age:18-24havingabachelor’sdegree. ● Transformed the data to achieve accuracy of 86.3% compared to 69% on raw data revealing a 90.6%area undertheROCcurve.Code:https://lnkd.in/eQfMvCW Conferences: Neuroergonomics Conference and NYC Neuromodulation Conference 2022 JuniorResearchFellow–IndianInstituteofScience,Bangalore(IISc) Aug2016-Jan2019 ComputerAidedClassificationofDifferentStagesofBreastCancer ● Identified ICIAR2018 breast cancer histology dataset with 400 images attributed to four classes namely: normal,benign,insitucarcinoma,invasivecarcinoma ● TrainedaconvolutionalneuralnetclassifierusingPytorch,accuracy=80% ProjectAssociate–IndianInstituteofTechnology,Delhi Aug2015-Nov2015 ImageProcessingToolforNon-InvasiveGlucoseDetection ● Developed an open-source image processing tool to analyze optical biosensor data to determine glucose concentrationinasalivarysample ● ImplementedthealgorithmusingAndroidStudioanddevelopedanandroidapplication ACADEMICAWARDSANDHONORS ● RukinAwardForAcademic&ProfessionalPerseverance($2000)-BiomedicalEngineering(BME),CCNY ● NeuralEngineeringGroupScholarship($2000) ● AllIndiaRank62(99.4percentile),GraduateAptitudeTestofEngineering(GATE2016) ● ThaparUniversityScholarship2012(27,500IndianRupees) EDUCATION MS,BiomedicalEngineering–TheCityCollegeNewYork,CUNY(GPA:4.0) Aug2020- Sep2022 PostGraduateDiploma,ML&AI–AmityUniversityOnline(GPA:8.35/10) Jul2019 - Jul2020 BachelorofTechnology,Biotechnology–ThaparUniversity(GPA:6.81/10) Aug2011 -Jun2015 PUBLICATIONS Nentwich M, Leszczynski M,RussBE,HirschL,MarkowitzN,SapruK,SchroederCE,MehtaAD,BickelS,ParraLC. Semantic novelty modulates neural responses to visual change across the human brain. Nat Commun. 2023 May22;14(1):2910.doi:10.1038/s41467-023-38576-5.PMID:37217478;PMCID:PMC10203305. TEACHINGASSISTANTSHIP ● TA-ImageandSignalProcessing,BMECCNY(Spring2022),Instructor:Prof.LucasParra ● CUNYTutorCorps-ComputerScienceandComputerProgramming(Fall2021) EXTRACURRICULARACTIVITIES ● Proficient Guitar player/Singer with a Youtube channel/blog which has accumulated views of over two million.https://www.youtube.com/user/metalgodmaiden ● Performed(withmybandPrithvi)andpartoftheorganizingteamofKashmiriPanditYouthFestival2011. ● Headlined SHUHUL TAAP III, a 3 day Kashmiri Pandit Cultural event, presided by Chief Minister of Delhi, Smt. Sheila Dixit and various renowned clubs such as Hard Rock Café, Café Morrison, Turquoise Cottage etcwithmybandPrithvi. ● Convener of the MUDRA (Music & Dramatics) Society of Thapar University. Led organizing committee of stageperformancesandallculturaleventsintheUniversity. ● Organizing team of Annual University Cultural Night 2012, 2013 and SUR (Intra- College Musical event) 2011,2012,2013,2014. ● FirstprizeinInstrumentalcompetition,IZHAAR2012(Intra-CollegeCulturalcompetition). ● FirstprizeinPunjabiSolo,PunjabiDuetinIZHAAR2013,HindiDuetinIZHAAR2014 ● Player of University Cricket Team, Winner of Inter-Engineering; Inter University Cricket Tournament 2015, heldatPunjabEngineeringCollege(PEC). SolutiondesignAI-drivensolutionsDataacquisitionPreprocessingFeatureengineeringModelselectionDeploymentAIalgorithmdevelopmentMachinelearningDatainsightsModeltrainingModelevaluationModelperformanceMetricsModeldeploymentSystemintegrationPerformanceoptimizationA/BtestingData analysisDatavisualizationExploratorydataanalysisPatterndiscoveryInsightsDashboardsCollaborationKnowledgesharingExperimentationPerformanceimprovementResourceutilizationDatascientistsSoftwareengineersDomainexpertsDocumentationReportingReproducibilityMaintainabilityProjectprogress."
}