{
    "ID": "467395093",
    "SOP": "PhDApplication inMechanical Engineering,Columbia University Yucheng Yang Personal Statement My fruitful academic journey commenced with a unique catalyst: Losartan, an ARB antihypertensive medication from Merck. My grandmother, a hypertension patient, relied on it. Regrettably, pharmaceutical companies in China were unable to independently develop this drug at that time, forcing patients to rely exclusively on imports. This situation imposed astronomical healthcare costs on my family and became a source of sorrow for my grandmother. I still remember independently seeking alternative medical products due to these financial upheavals, and as I delved deeper into the intricate world of chemical drugs and medical products, I realized chemistry, as a foundational discipline, underlies all drug synthesis, and the mechanisms of chemical reactions are crucial for novel medical products development. Consequently, I found a profound passion for the vast and divergent field, which guided me to Southeast University for a Bachelor’s in Chemistry,laying a solidbasis for future innovationsin medicalproducts. Recognizing the integral role of synthesis in medical product development, I joined Prof. Hao Wang’s group during my undergraduate studies to build a robust foundation in organic synthesis, focusing on silylene-related compounds. Due to the product’s sensitivity to water and oxygen, I proficiently operated a glovebox and Schlenk-line after mastering fundamental organic synthesis methods, such training in anhydrous and anaerobic operations greatly honed my skills in chemical synthesis. Subsequently, I applied my synthetic foundation to drug development, collaborating with enterprises on the process synthesis of omeprazole intermediates in Prof. Haibin Zhu’s group, bolstering skills in synthesis and characterization, and found my interest piqued by applying theoretical research to industrial production. However, the COVID-19 pandemic, presented disruptions to my wet-lab experiments. Undeterred, I pursued a project with Prof. Erik Liujten at Northwestern University to perform computational simulations on graphene PhDApplication inMechanical Engineering,Columbia University Yucheng Yang using software like LAMMPS, Moldy and Materials Studio to develop a model for graphene's thermal conductivity with various sizes and temperatures. This aided me in predicting material properties,thus enablingbetterdesign ofwet-lab experiments for medicalmaterials development. Theresultswere published inThe 2ndEuropean SymposiumonComputer andCommunications. As in-person teaching resumed, I joined Prof. Zhihai Ke’s group at the Chinese University of Hong Kong to further develop functional products with practical applications through organic synthesis. We aimed to synthesize graphdiyne (GDY) and HKUST-1 metal-organic framework (MOF) on copper foam to create a novel GDY-MOF catalyst, amplifying the catalytic effect of HKUST-1 by promoting its electron transfer efficacy. Tasked first with synthesizing high-purity GDY, my expertise in anhydrous and anaerobic handling proved to be invaluable. Although failing to grow ideal GDY initially, after literature research and improvisation, I got an optimal morphology GDY by decelerating solution-dropping rate from 3h to 12h. Subsequently, Prof. Ke and I probed the catalytic distinctions among MOF, GDY-MOF and GDY through the phenol oxidation reaction catalyzed by H O , and strategized to augment the yield of water-phase 2 2 catalysis reactions by attaching a polymer layer. I devised a potent method to attach polymer to MOF without disrupting GDY by suspending GDY-MOF with cotton threads and demonstrated the water-phase catalytic effect could be enhanced by attaching polymers, with the GDY-MOF- Polymer group showing the optimal catalytic yield. These findings were published on ACS Appl. Mater. Interfaces,and anotherpaper for GDY synthesis was submittedto Chemistry of Materials. This project enriched my comprehension of two-dimensional nanomaterials synthesis and potential applications,pivotal formy transition fromtheoretical to independentapplied research. My pursuit of applying theoretical research to generate applied results guided me to Columbia, where I pivoted my major to Chemical Engineering for its application-oriented focus. PhDApplication inMechanical Engineering,Columbia University Yucheng Yang Initially, I grappled with my direction, as my research honed my expertise in materials science, yet my interest leaned towards biotechnology. Fortuitously, meeting Prof. Qiao Lin clarified my path, revealing a direction melded my interests and skills by applying MOFs and nanomaterials to medical devices, notably Biosensors and BioMEMS. Recognizing my zeal for pursuing a Ph.D., he proposed two research topics: developing graphene-aptamer sensor for tacrolimus detection in collaboration with Prof. Stojanovic, and enhancing TNF-a aptamer sensor’s shelf- life—a challenging yet vital endeavor. After preliminary experiments, I identified sensor limited shelf-life issues from aptamer detachment, degradation and graphene surface damage. To mitigate this, I chose glass surface to firmly attach TNF-a aptamer via covalent GA-Coupling for developing long-time fluorescent TNF-a sensors. Another approach, using Ni (HITP) MOF to 3 2 covalently couple -NH on TNF-a aptamer to MOF’s organic framework, didn't work 2 significantly since aptamer still needs to be connected to Ni (HITP) via linkers. Nevertheless, 3 2 this effort proved intriguing, it allowed growing highly conductive MOF films on sensors rapidly and effortlessly via dropping and heating MOF particles, outpacing graphene's CVD method. Subsequently, I transitioned to ZIF-90 MOF, eliminating the demand for linkers by directly connecting -NH on aptamer to -CHO on ZIF-90 to enhance sensor shelf-life. However, ZIF-90's 2 conductivity required improvement to proficiently convert chemical signals to electrical ones. Leveraging my chemistry background, I increased ZIF-90’s conductivity to 2.26×10-2S·cm-1 by introducing sulfonic acid groups through an aldehyde group's addition reaction with bisulfite, while -CHO transformed into -OH, ensuring compatibility with -NH on aptamer. Currently, I’m 2 ardentlyengagedin this project,aiming to developstable andenduring biosensorsfor patients. My ventures thus far have staunchly affirmed the role of material science as the cornerstone of mechanical manufacturing. To deepen expertise in device manufacturing and electrochemical PhDApplication inMechanical Engineering,Columbia University Yucheng Yang sensor development, I engaged as a RA in Prof. Yuan Yang's lab in the APAM department. Coincidentally, this was also a shelf-life extension project. Herein, I crafted Covalent-organic framework (COF)films to inhibitLi dendrite growthon Cu in Li+ batteries, thereby safeguarding against punctures and extending battery shelf-life. After a meticulous literature review, I chose COF over MOF due to its lower conductivity, ensuring no diminution in cell efficiency due to charge transferon COF film. I thencompared TAPB-PDA and Tp-TTA COF, both boasting high mechanical strength and suitable pore sizes, ultimately selecting TAPB-PDA for its simpler synthesis. Through continuous adjustments in reaction time and concentration, I concluded that a 0.7μm COF film significantly enhanced battery shelf-life. This project sharpened my skills in nanosynthesis, cell assembly, electrochemical workstations, and characterization techniques like AFM, SEM, FIB—all crucial for fabricating sensor electrodes and analyzing electrical signal changes during sensor testing. It also inspired me on sensors shelf-life extension project with Prof.Lin byintroducingadditional covalentbonding sites foraptamers throughCOF. These experiences have ingrained in me a familiarity with mechanical engineering, a field seamlessly merges varied scientific and engineering ideas to troubleshoot practical challenges, defining my sustained emphasis on the interdisciplinary domain of MOF/graphene and biosensors, propelling me to devise BioMEMS for innovative clinical applications, and sparking myenthusiasm to develop affordableyet efficientmedical productsforchallenging diseases. I’m intrigued by Columbia ME Doctoral program, especially the MEMS & Nanotech and the Bioengineering & Biotech focus. The interdisciplinary approach combines nanomanufacture and biomedicaldevices enablesme to nanosynthesize MOFand graphene to innovate BioMEMS, tackling medical care problems. New York is the epicenter of the world, and Columbia stands as the focal point within the vibrant metropolis, offering an inclusive and diverse culture, cutting- PhDApplication inMechanical Engineering,Columbia University Yucheng Yang edge research facilities, and unparalleled collaboration opportunities with industrial companies, the advantages of which I have deeply appreciated in my master study. My goal within the program is to amplify my expertise, hone my skills, and engage in profound collaborations with healthcare sectors, globally disseminating my research on highly efficient and enduring biosensors for disease monitoring, advancing medical technology and positively impacting patients worldwide. Specifically, I am enthusiastic about developing unique fluorescence sensors on glass and addressing the short shelf-life issue of TNF-a aptamer sensors with Prof. Lin during my Ph.D. journey. Building upon improvements using ZIF-90 to covalently bind aptamers, my goal is to modify TNF-a aptamer’s chemical structure to mitigate its auto-degradation. Furthermore, I plan to collaborate closely with Prof. Stojanovic to craft robust MOF and graphene sensors for assorted drug assays. Additionally, I aspire to delve into electrochemical sensorswith Prof.Yang, investigatingalternative detectionmethods forbiomarkers. My ultimate aspiration is to forge an academic career, autonomously pioneering on novel biosensors for societal betterment. Although anticipated challenges loom, my robust foundation in chemistry, materials science, engineering, and data analytics thoroughly armors me to embrace them with open arms and overcome them with unwavering enthusiasm, diligence, and perseverance. Guided by our motto, 'In the light shall we see light,' my pursuit of knowledge's illumination will perpetually persist, aiming to shine light onpatient solutions through research. I eagerlyanticipateabsorbing knowledge atCUandzealously applying it tofuture endeavors.",
    "Resume": "Yucheng Yang (Jeremy Young) Tel:1(718)915-1526|E-mail:yy3280@columbia.edu|https://www.linkedin.com/in/yucheng-yang-6b3b3324a/ Address:ColumbiaUniversityintheCityofNewYork,NewYork,NY,US EDUCATION ColumbiaUniversity NewYork,NY MasterofScience-ChemicalEngineering 09/2022-12/2023(Expected) CoreCourses:Adv.Kenetics,Thermodynamics,TransportinFluidMixture,MathMethodsinChemE,Essentialsof ChemEA&B,PrincipleofGenomicTech,AtomisticSimulation,ElectrochemMatls&Devs,ProcessSafety SoutheastUniversity Nanjing,CN BachelorofScience-Chemistry 09/2018-06/2022 CoreCourses:PhysChem,InorgChem,AnalyChem,OrgChem,StructuralChem,Instrumental&SpectralAnalysis, PhysOrgChem,IntermediateInorgChem,PolymerChem,Biochemistry,Electrochemistry,PrincipleofChemE PUBLICATIONSANDPRESENTATIONS L.Tian, ...Y.Yang & Yuan Yang*. Designing Electrolytes with High Solubility of Sulfides and Disulfides for K-Na/SBatterieswithHighEnergyDensityandLowCost.Nat.Sustainability.(UnderReview). Y.Wu§, Y.Yang§ & Z.Ke*. Template-Induced Synthesis of 3D Curved Graphdiyne Membranes on Copper Foam.ChemistryofMaterials.(Underreview). Y.Wu,Y.Yang&Z.Ke*.ACSAppl.Mater.Interfaces.2023,15,34,40933–40941. J.Zhang,Y.Yang&H.Zhu*.GuangzhouChemicalIndustry.2022,50(18):92-93,131.(InChinese). Y.Yang.The10thUndergraduateSymposiumofSoutheastUniversity.May2021,ExcellentReport. Y.Yang*.ESCC’21:The2ndEuropeanSymposiumonComputerandCommunications.April2021,42-48. EXPERIENCE ApplicationofMOF,GrapheneandGlassElectrodesinBioMEMSandBiosensor NewYork,NY RA,Supervisor:Prof.QiaoLin,ColumbiaUniversity 09/2022-Present  SynthesizdNi 3(HITP) 2MOFparticlesandseperatedwith5%nafioninwater.Droppedandheatedtheliquild on SiO substrate to make a MOF film with great electricity conductivity, achieved convenient and rapid 2 preparationofMOFelectrodesforbiosensor.CharacterizeditwithXRDandSEM.  Attached graphene on SiO 2 substrate and characterized with SEM. Built tacrolimus aptamer on graphene to developasensorforsensitivedetectionoftacrolimus(cooperatewithColumbiaMedicineDepartment).  Attached TNF-a aptamer on Ni 3(HITP) 2MOF and graphene to test TNF-a sensor’s shelf-life, found the low shelf-life (4 cycles) is due to the detachment and degradation of aptamer. Used GA Coupling to build fluorescentTNF-aaptameronglassbeadstoachievealong-term(9cycles)fluorescencedetectionofTNF-a.  Synthesized ZIF-90 MOF on SiO 2 substrate and functionlized it with csulfonate group to improve its conductivityforasensor.AttachedTNF-aaptameronfunctionalizedZIF-90covalentlytoimproveshelf-life. 2D-COFFilmsInhibitsLiDendritesonCopperCollectorforAnode-freeLiBatteries NewYork,NY RA,Supervisor:Prof.YuanYang,ColumbiaUniversity 01/2023-Present  Synthesized TAPB-PDA and Tp-Tta COF film (self-assembly) on Cu foil (CF). Characterized with SEM, XRD, FIB, etc. Tested the mechanical property and chemical stability of the two COFs in electrolyte and choseCFwithTAPB-PDACOFascurrentcollectortomanufacturetheanode-freepouchcell. Adjusted morphology and thickness of COF film on CF with different reaction time and condition. Found  16h COF(0.7um) significantly increased the shelf-life of battery with essentially no reduction in work efficiency in 10g/Ah electrolyte. The mechanism is COF film allows Li+ to pass through it selectively with itsporesize(1.4nm)andinhibitstheLidendritegrowontheCuthroughitsmechanicalstrength.  Used 5wt% TMP-TMA polymer to solidify/lock the LiDFOB/LiBF 4(in FEC-DEC) dual-salt electrolyte to improve its resistance of puncture of Li dendrite to increase durability and safety of battery. Wet COF pore withelectrolytetoavoidpolymerblockage(whichpreventLi+topassthroughandincreasecellpolarization). ApplicationofMetal-OrganicFrameworksinCatalyzingOrganicReactions Shenzhen,CN RA,Supervisor:Prof.ZhihaiKe,TheChineseUniversityofHongKong,Shenzhen 06/2021-09/2021 YuchengYang,Page1 Prepared graphdiyne film (GDY) through Glaser-Hay Coupling with Me Si-C≡CH, ZnCl and n-BuLi,  3 purifiedthemedium(HEB-TMS)bycolumnchromatography.GrowedGDYoncopperfoam(CF)substrate, loaded Cu-MOF (HKUST-1) on GDY-CF through self-assembly, added polymer membrane on HKUST-1- GDY-CFtopreparecatalystHKUST-1-GDY-CF-Pforimprovingwater-phasecatalysiseffect.  Compared catalytic of HKUST-1-GDY-CF-P, GDY-CF-P, HKUST-1-CF-P and HKUST-1-CF on H 2O 2 oxidizing phenol to verify the catalysis-enhancement mechanism is GDY promotes electronic transfer and polymerenhancesstabilityinaqueouscatalysis. Catalyzed the reaction of NBS oxidizing benzyl alcohol and ring-opening reaction of ethylene oxide with  HKUST-1-GDY-CF,achievedayieldof>95%. INDEPENDENTPROJECTS StudyontheSynthesisandReactivityofN-,O-SubstitutedSilylene Nanjing,CN GraduationDissertation(Excellent,10%),Supervisor:Prof.HaoWang,SoutheastUniversity 02/2022-06/2022  Applied n-BuLi and NH(SiMe 3) 2 to get LiN(SiMe 3) 2 and reacted it with 2,6-(tBu) 2ArOH to prepare 2,6- (tBu) ArOLi (DBP Li-salt). Uesd C=(NtBu) and PhLi to get RLi (R:PhC(NtBu) ), synthesized RSiHCl 2 2 2 2 with RLi and SiHCl , removed LiCl and NH(TMS) by LiN(TMS) in toluene to obtain RSiCl. Synthesized 3 2 2 newandstablesilylene2,6-(tBu) ArO-Si-RwithRSiClandDBPLi-salt.CharacterizedwithXRDandNMR. 2  Reacted 2,6-(tBu) 2ArO-Si-R(LSiR) with O-N(CH 3) 3, PhC≡CPh, (Ph) 2C=O to obtain a series of new compoundsLRSi=Oester,C-Si-CringcompoundandC-Si-Oringcompound.CharacterizedwithNMR. ComputerModelingandAnalysisofTwo-dimensionGrapheneonNanoScale Chicago,IL Supervisor:Prof.ErikLuijten,NorthwesternUniversity 02/2021-05/2021  ConstructedcomputationalmodelsofarmchairandzigzaggraphenestructureparametersbyMaterialStudio.  Comparedandselectedpotentialenergy models(Tersoff,Rebo&Airebo) inLammpsandsimulatedthermal conductivity (TC) of graphene with its size based on MD simulation. Discovered TC increases with length andwidthduetoprotontransferintheheattransferprocess.  Set a rangeofinitial temperatures(T) andfitTgradient bythe leastsquaremethodin Origin. SimulatedTC withTwithsettledsize(8.52*4.92nm).FoundTCincreasedwithTduetotheplanestructureofgraphene. OptimizationofSynthesisRouteof2-hydroxymethylpyridineinOmeprazoleProduction Nanjing,CN Supervisor:Prof.HaibinZhu,SoutheastUniversity 09/2020-05/2022 SponsoredbytheChineseNationalInnovationProjectofUndergraduateStudents,20000ChinaYuan Conductednitrogenoxidation,nitration,methoxysubstitution,aceticanhydrideacylation,andrearrangement  reactionsof2,3,5-trimethylpyridine&3,5-dimethylpyridinetosynthesize2-hydroxymethylpyridine.Column chromatographyforpurificationandIR,NMRforqualitativeanalysis. Improved methylation activity of O=C(OCH ) (DMC) by introducing substituents, enhancing basicity,  3 2 increasing temperature etc. based on its B 2 methylation mechanism. Achieved a green route by replacing AL methylationreagent(CH O) SO withDMC,methanolsolventwithH OandtolueneextractantwithDCM. 3 2 2 2 SynthesisofSpecialStructuralSilyleneandStudyofReactivityofElectronsonSi Nanjing,CN Supervisor:Prof.HaoWang,SoutheastUniversity 10/2019-05/2021  Introduced -SiMe 3 on N atom of diisopropylaniline by n-BuLi and Me 3SiCl, used n-BuLi, SiHCl 3 and LiN(SiMe ) to obtain stable silylene with -N(SiMe ) substituent on the other side of N atom. Replaced 3 2 3 2 LiN(SiMe ) with LiN(Ph)SiMe , LiN(Ph) to explore the influence of higher steric hindrance on electron 3 2 3 2 reactivityandfrontierorbitalspropertiesonSiofsilylene.XRDandNMRforstructurecharacterizations.  Respectively reactedsynthesized silylenes with H 2, alkynes,CO 2 to activate small molecules andsynthesize silicon-containingderivatives.Successfullysynthesizedadisilenewithspecialstructurebysilylenes. LANGUAGESANDSKILLS Language:Mandarin(Native),English(Proficient),Cantonese(Basic),Japanese(Basic). Tool:C++,LAMMPS,Moldy,MestReNova,ChemDraw,Origin,Endnote,SciFinder,Jupyter,MSOffice. Lab:GloveBox,SchlenkLine,CleanRoom,SEM,EDS,IR&FT-IR,XRD,NMR,XPS,Raman,TEM,BET, EDX,TGA,AFM,FIB,UV-Vis,GC-MS,HPLC,TLC,CC,FL-Microscope,ElectrochemWorkstation. YuchengYang,Page2"
}