{
    "ID": "534470689",
    "SOP": "Bibhusa Rawal Department of Computer Science A desire to extend my knowledge and a curiosity to learn the significance of the inevitable arrival of quantum era is what motivated me to study Ph.D. in Computer Science with a focus in quantum cryptography. More than 20years ago it was proven that quantum cryptography is unconditionally secure and quantum algorithms can solve classical problems for which we don’t have efficient classical algorithms. In the present date, we are in the NISQ (Noisy intermediate scale quantum devices) era where quantum processors contain up to 1000 qubits which aren’t enough to make a quantum leap for being fault-tolerant or reached the stage of quantum supremacy. With the imminent arrival of quantum computing era, we must now begin to prepare our information security systems to be able to resist quantum computers. If quantum computers are built, they would pose a challenge to the Church-Turing Thesis. The Church–Turing Thesis says that a computing problem can be solved on any computer that we could hope to build, if and only if it is computable by Turing machine. My research focus is post-quantum cryptography where I dream to develop cryptographic systems that are secure against both quantum and classical computers with the goal of keeping existing public key infrastructure intact in a near future quantum era. Mathematics is so powerful with the perfect balance of patterns and structures in numbers. My enjoyment of the beauty of Mathematics is part of what motivates me toward innovation. It is also a guide when I am working on a problem: if I think of a few strategies, I will choose the one that seems most elegant first. I was initially in Electrical and Computer Engineering Ph.D. program at University of Maryland, College Park. However, during COVID-19, I had to drop out of school because of personal reasons. During my time in UMD, I took different classes ranging from Random Process, Information Theory, Estimation and Detection Theory, Systems Theory, Electromagnetic Theory, Compilers, Security, Machine Learning, Algorithms, Numerical Theory just in search of a course I find myself invested in and would like to spend the rest of my life working on. In my second year, I took Quantum Information Processing class and that is when I became really interested in theoretical areas of Quantum Information Science. Thereon, I’ve been interested in projects at the intersection of quantum computation, cryptography and Machine Learning. I earned my undergraduate degree in Electronics and Communication Engineering at Kathmandu Engineering College, Tribhuvan University. I was ranked first in B.E. in Electronics and Communication program of Tribhuvan University. I was highest scorer as a female student among all engineering students across all universities in Nepal. I was a merit-based scholarship holder for all semesters in B.E. program of my college. Bibhusa Rawal I was ranked first among all girl students in the Bachelor of Engineering Program – across all Engineering faculties - in Nepal and was conferred the “Nepal Chhatra Bidhya Padak (gold medal)” by the President of Nepal, Mrs. Bidya Devi Bhandari on 37th National Education Day and International Literacy Day-2016. During my second year in the undergraduate program, I became member of Robotics club of the college with a focus to build a community of open-source users and developers. As a member of this organization, I had the opportunity to assist my friends and mentor my juniors in their respective academic projects. Throughout my undergraduate program, I organized and conducted various workshops, exhibitions, robotics competitions, quizzes, and seminars. In the past, I’ve been an active member of Women in STEM Nepal which is a non-profit organization established to decrease the gender gap prevailing in STEM fields in Nepal. As its member, I’ve volunteered my free time to run classes under the project named “Children go coding” to expose and engage children of the age group 8-15 years to STEM education that includes logic development, building programming concepts, building design thinking concepts, and building hardware concepts via Arduino. Currently, I hold tuition classes on Math, Physics and Chemistry to high school students on weekdays. I teach kids on weekends under the STEM program. Columbia University is my choice for continuing my graduate education because I feel that the University can take a revolutionary step in the future of quantum computers, and I would be honored if I could be a part of it. I am aware of the commitment and resilience necessary for research work, but I also believe that my motivation and aptitude is strongest in this field. I aspire to build a career in teaching and research. I am positive that Columbia University will help establish a firm educational foundation needed to pursue this goal. My end target is to become a university professor and a competent researcher. I am sure that the stimulating educational ambiance and wisdom from distinguished teachers at Columbia University will help me grow immensely as a person as well as a proficient researcher in my field.",
    "Resume": "Bibhusa Rawal 128 Sangam Basti Email: bibhusa.r@gmail.com Dhobighat Phone: 9851107113 Lalitpur 44600 Education: 2011-2015 Kathmandu Engineering College, Tribhuvan University, Nepal Bachelor in Electronics and Communication Engineering 2009-2011 St. Xavier’s College, Maitighar, Nepal Intermediate in Science Academic Positions: • Research Assistant, University of Maryland College Park, August 2018-December 2019 • Teaching assistant, University of Maryland College Park, August 2017- May 2018. Professional Experience: • System Administrator, IT Department, Image Group of Companies Kathmandu, 12/01/2015– 05/31/2017. Awards and Honors: • Nepal Girl Student Education Medal (Nepal Chhatra Bidhya Padak) by Rt. Honorable President of Nepal, Mrs. Bidya Devi Bhandari for getting highest marks (girl side) in Bachelor of Engineering program of Nepal (09/08/2016). • First in Bachelor of Electronics and Communication Engineering Program of Institute of Engineering, Tribhuvan University (2015). • Merit-based scholarship holder for all 8 semesters during undergraduate study Professional Memberships: • WiSTEM (Women in Science, Technology, Engineering and Mathematics) Nepal"
}