{
    "ID": "017928671",
    "SOP": "Personal statement With strong interest and motivation, I am determined to apply to your PhD program in Computing and Data Sciences at your prestigious university and would like to use this brief personal statementtohighlightmyacademicbackgroundandresearchinterests.Beforethat,I should say how much I respect Columbia University, both for its well-knownreputationand for her great contributions to scientific research. My academic goals are properly metbythe competent program design and great faculty team there. I have solid grounds for believing that this Ph.D. program will help me grow professionally so that I can achieve my career goals of becoming an engineer, a senior researcher inatechnologycompany,oranacademia professor in the future, which is exactlyinlinewiththeprogram’sdesigngoalandconvinces methatImadetherightchoice. Since 2021, I have been enrolled inthemaster’sprogramofDataScienceatTuftsUniversity with an educational background in Statistics from GuangdongUniversityofForeignStudies. Therefore, it iseasytoseefrommypastacademicperformancethatIhaveestablishedasolid foundation of knowledge in the two areas mentionedabove,particularlyinregardtosubjects like Mathematical Statistics, Probability Theory, Advanced Mathematics, Applied Statistics, Algorithms, Statistics Pattern Recognition, Data Mining, Deep learning, Machine Learning andsoforth. In my past study, I have placed a special emphasis on the courses of Machine Learning Principles and its framework programming like Python & Java programming, in addition to my proficiency in Pytorch, and Scikit-learn machine learning framework. My PhD stage’s primary focuswillalsobeonmachinelearning.IintendtolearnmoreaboutFederallearning, Deep graph learning, Natural language processing, Generative model diffusion, Application of graph data, and Graph machine learning, and learn somemathematicscoursesinMachine Learning, such as Stochastic process, Information theory,Bayesianmachinelearning,etc.,to improve my mathematical derivation and my capacity to turn objective problems into mathematical problems. Besides, I want to conduct more projectprogramming,completethe project from scratch, increase my proficiency at translating mathematical issues into computer language, work on generative models/algorithms, and improve theinadequaciesof currentgraphgenerativemodels. What affected me mostwasthecourseStatisticPatternRecognitiontaughtbyDr.IsaacLage. Thisclasstaughtmemanyprobabilisticmodels,suchastheHiddenMarkovModel,Gaussian mixture model, and k-means algorithm. Also, I learned how to perform inference through MCMC and variational inference. I think theclasspavedasolidfoundationformystatistical learningbackground,whichhelpedmealotinmyfuturemachinelearningresearch. In the deep learning course taught by Prof. Liping Liu, I found myself veryintotheclasson generative modeling. In this class, I comprehensively learned about various neural networks such as RNN, transformer, and CNN. What excited me the most was the course project I worked on, in which I did style transformation by using cycleGAN. In thisproject,Itriedto innovate the loss function and discriminator architecture. Specifically, I reweighted adversarial loss, cycle consistent loss, and identity loss to see how the image style would change accordingly. Besides, I simplified the discriminator to make the optimization of the generator easier. Though my ideas did not improve over the original model, I became more interestedingenerativemodelsanddeeplearning. To better have hands-on experience, I have worked on two projects related to graph generation, one was to benchmark the generative performance over one-shot and sequential graph generative models, and the second was to develop graph generative models that meet differentialprivacy. The goal of the first project was to provide a fair comparison of two kinds of generative models in terms of the likelihood metrics. Since one-shot generative models are usually permutation-invariant and sequential generative model depends on the generating orders, these two models are not directly comparable due to the marginalization over the permutation. In this project, my first duty was to derive the log-likelihood for the one-shot generative models, by taking the permutation into consideration. This leads me to get familiar with the mechanism of flow-based generative models and how to model discrete data. While thelog-likelihoodcalculationiswell-establishedinsequentialgenerativemodels, my second duty is to run extensive experiments tocomparethesetwokindsofmethods,thus bridging the two models over this more universal metric. I am fortunate to be advised by Prof. Liu Li-ping on this project. I learned a lot about the basic techniques of Variational Inference, data dequantization, and a broad class of Graph Neural Networks. Furthermore, I learn how to code with graph data structure, which is more complicated than imageandtext dataasitsirregulardatarepresentation. The second project was accepted by ICML2023. Its main goal is to generate graphs that preserve the graph statistics without leaking the users’ privacy in the training graphs. However, current deep graph generative models cannot generate large networks with satisfying graph statistics. The first goal of this project is to developascalableandpowerful graph generative model, which leads us to first turn our attention to the diffusion model. During the development of the new diffusion graph model, I am responsible for implementing a batching training procedure, which speeds up the training and reduces the gradient variance. Besides, I derived the posterior of the non-uniform diffusion forward kernel. When working on the derivation, I had a deep understanding of how the diffusion models are derived, which [made me gain more understanding generative model. Besides, I read plenty of papers on differential privacy with graph data and papers about how to use differential privacyandcreatedata.Afterdevelopingsuchamodel,Iwillfocusongenerating largenetworkswithprivacyguarantees. Objectively speaking, I choose machine learning as the major topic of my Ph.D. research primarily due to my advantages in statistics, mathematics, and computer knowledge and skills. Considering statistics, as an illustration, Machine Learning uses techniques like Markov Monte Carlo Sampling, Bayesian inference, conditional probability in diffusion models, and ELBO derivation in variational auto-encoders, etc., which makes statistics applications extremely valuable and further piques my interest. Recently, machine learning has developed a number of extremely potent capabilities, such asthechatGPT3thatwasjust released, which has made me realize the enormous potential and development space in this field of study, and greatly inspired me to invest in further research and exploration of machinelearning. Becoming anexpertinthedomainsofgraphmachinelearninggenerativemodels,andnatural languageismyprofessionallife’sambition. In a sense, myresearchsupervisorandFeynmanarethetwopeoplewhohavehadthebiggest influences on my intense interest and motivation in scientific research. My mentor is a serious thinker, whose dedication to research and analytical approach has had a significant impact on me. He always challenges me to speak with mathematics, articulate ideas with mathematics, and approach issues with rigorous and abstract mathematical thinking during our academic sessions. My knowledge of the issue gradually deepened afterdiscoveringthis sophisticated mathematical statement, and I started to pay closer attention to my mathematical prowess. TheotherpersonisFeynman,whohadagreaterspiritualinfluenceon me, and whose quote I use as my motto. In aninterview,thehostquestionedFeynmanabout the significance of astronomical research. He responded that in truth, it may not have much significance or significantly improve people’s lives, but learning itself is the best purpose since it allows us to better understand the world and explore the unknown. Yes, seeking knowledge is the greatest purpose and joy, thus I believe conducting research calls for this kindofmindset.",
    "Resume": "Jiaxing He (781)539-3142 Meford,Massachusetts jiaxing0218@gmail.com linkedin.com/in/jiaxing-he-43b91523b/ EDUCATION MasterofDataScience GPA:3.73/4.0 Sep.2021-now TuftsUniversity BachelorofEconomicStatistic GPA:3.43/4.0 Sep.2016-Jun.2020 GuangdongUniversityofForeignStudy SKILLS ToolsandLanguages Python(Numpy,Pandas,Scipy),Spark,Pytorch,Java,Shell,Sk-learn,Git,LaTeX, QuantitativeResearch MachineLearning(cv2/pytorch-geometric/graphneuralnetwork/naturallanguageprocessing/computer vision/traditionalmachinelearning),MySQL,GoogleCloudPlatform,SPSS FinancialAnalysisskill CFAlevelIpassed,(straightApass) PUBLICATION 1.Chen,X.,He,J.,Han,X.,Liu,L.EfficientandDegree-GuidedGraphGenerationviaDiscreteDiffusionModeling,International ConferenceonMachineLearning(ICML)2023 EXPERIENCE StudentResearchAssistant(Pytorch,VariationalAutoEncoder,LatentVariableDistribution). Sep.2022—Feb.2023 TuftsUniversity Medford,Massachusetts • Generatinggraph(eg.Molecule,Network)byconductingDiffusionModel.Application:drugdiscovery,knowledgegraph completion,etc. • Writingcodefortheforwardprocessinadiscretediffusionmodel.Includingthesamplingfromthelatentcategorical distributionanddefiningtheconvergentstateofthediffusionmodel. • RunningexperimentinHPCtoevaluatemodelperformanceinthestandarddatasetincludingcaveman,grid,andego, etc.(python/diffusionmodel/shell) • Ourmodeloutperformedexistingbenchmarksintermsofbothmoleculelegalityandformationspeed.(alreadyacceptedin ICML2023) DataAnalyst May.2020–Sep.2020 ChinaInternationalCapitalCorporationLimited Guangzhou,China • Featureextraction,byusingtextembeddingfromtheRobertamodel.andthenTakeadvantageofthatfeatureandconcatenate thefeatureandoriginalnumericalfeatureofstock(like15daysaverageprice,andbuy-inamount)togetavectortorepresent thestockfeature.andthenutilizeLSTM(long-short-termmemory)todomulti-targetprediction. • DatapreprocessingbyusingNLTKandPysparktogetthestemwordandgetridoftheuselesswordandpunctuation. DataAnalyst/InternofFinancialLeasingDepartment May.2019–Sep.2019 ChinaBank Guangzhou,China • CustomercreditratingclassificationbyusingdecisiontreeandSVM.(technique:SVM/python/sk-learn/PCA/SQL) • UsingA/Btesttotestifytheperformancebetweendifferentmodels.(technique:z-test/t-test/pandas/python) • Assistedinleasingbusinessplannegotiation,datacollection,datavisualization,etc.(excel/powerBI/python) PROJECTS ComputerVisionproject/imagegenerationmodel(GAN) Jan.2022—May.2022 TuftsUniversity Medford,Massachusetts • Theproject’sobjectiveistoconvertlandscapeimagesintoartisticstylesinspiredbyrenownedartistslikeVanGoghandMonet. Additionally,theprojectaimstoexplorehowGenerativeAdversarialNetwork(GAN)modelscapturedatapatternsandmodify themodeltoimproveitsperformance. • participatingindevelopingcodetomodifyboththediscriminatorandgeneratorcomponentsoftheGANmodel.(relative technique:Pytorch/neuralnetwork/sampler) ComputerVisionproject/imageclassification Sep.2022—Dec.2022 TuftsUniversity Medford,Massachusetts • ImagedatapreprocessingbyusingGaussianfilter/medianfilter,andimageresize,etc.(technique:python/cv2/sk-learn) • ByusingensemblelearningtodoimageclassificationontheFMNISTdataset.andchecktheperformanceanddovisualization. (Technique:cv2,python,scikit-learn,SVM,decisiontree,Neuralnetwork) Jiaxing He (781)539-3142 Meford,Massachusetts jiaxing0218@gmail.com linkedin.com/in/jiaxing-he-43b91523b/ NaturalLanguageProcesscourseproject Sep.2021—Dec.2021 GuangdongUniversityofForeignStudy Medford,state • Theprimarygoalofthisprojectistocategorizecustomerreviewsintodistincttypesandperformsemanticanalysisonthe collecteddata.(technique:re/python/pytorch/multi-objectclassification) • WritingcodeaboutTextDataprocessing,LSTM/GRUModeling,andModeltuning.(Latex,recurrentneuralnetwork,textdata preprocessing,SQL,shell,GoogleCloudPlatform) RELATEDCOURSE MachineLearningandDataMining; Algorithm; StatisticalPatternRecognition; BayesianDeepLearning; Deep Learning; Statistic; BigData; C; MultipleVariableStatistic; DatabaseSystem;"
}