{
    "ID": "125307276",
    "SOP": "STATEMENT OF PURPOSE “I can accept failure. Everyone fails at something. But I can’t accept not trying.” I can say that this quote by Michael Jordan is the epitome of my coding endeavors and per my ideology are words to live by. During my undergraduate days, I developed a strong affinity towards mathematics which thereby strengthened even more while pursuing my Master's Degree in Financial Engineering from Stevens Institute of Technology. My master's journey, however, had a tumultuous start wherein I hit rock bottom from both an academic and a personal perspective. This was mainly because the type and the level of exposure I had in mathematics and computer science during my undergraduate days was different compared to that of the rigorous master's program. A major “eye-opening” experience was when I had taken this elective called “C++ Programming in Finance” wherein it had started at a novice level but progressed geometrically in terms of difficulty thereby getting into the depths of Object Oriented Programming. My entire summarization of this course can be equated to the quote that I referenced at the start of the paragraph. I worked hard to get each of my codes to compile and run as per the assignment’s expectations and the moment that happened it was always a euphoric feeling that cannot be described in words and I have experienced that feeling only a handful number of times in my lifetime. That was when I became extremely enamored and intrigued by the power of coding and its real-world application in the field of Quantitative Finance and Algorithmic Trading and there was no looking back, ever since then. Having then decided and aspired to a career as a Quantitative/Algorithmic Trader, I decided to shape my coursework as programming intensive as possible. While certain courses such as Market Microstructure & Trading Strategies, Portfolio Theory & Applications, and Algorithmic Trading Strategies required the usage of R and Python programming languages, other courses such as Advanced Derivatives and Computational Methods in Finance mostly required the usage of Object Oriented Programming in C++. My final project had two parts to it wherein the first part was Quantifying & Increasing Diversification in Investment Portfolios by employing certain concepts such as Effective Number of Bets, Principal Component Analysis, and Minimum Linear Torsion. The second part of the project was Asset Allocation Optimization using Clustering and Deep Learning Techniques. This multi-faceted curriculum thereby SHREYAS JAIKUMAR enabled me to study, comprehend and implement a wide array of quantitative skills and programming languages which served to be extremely beneficial during the onset and on to the later stages of my professional career as a data scientist and as a data analyst as well. After having graduated from my master's program by May 2020 wherein at that time almost any sort of job aspirations (let alone ambitious and high-paying jobs) were hindered due to the worldwide bleak economic climate, as a result of COVID-19. However, I did manage to capitalize on that scenario by trading options & derivatives in the stock market and thereby pragmatically applying all the knowledge and skills that I had learned so far in graduate school. I also secured a job as a consultant in Tata Consultancy Services Limited wherein my first role was as a data scientist at JetBlue Airways Corporation and my successive role as a data analyst for an online travel agency, Priceline. Both these diverse roles required me to learn a different set of skills and thereby required the usage of various programming languages. For example, R and mainly Python were used for predictive modeling, unit testing, and data warehousing processes such as extraction, transformation, curation, and loading. SQL was used for querying to analyze and extract data from various databases like Snowflake, Oracle DB, and Google Cloud Platform. I was also responsible for the conversion of SQL to Spark SQL queries to perform the necessary executions in Databricks’ clusters and to satisfy certain framework requirements. Lastly, Tableau and Spotfire were used to visually represent the exploratory and explanatory data analysis of the EMS (Even More Space) pricing module thereby identifying pricing opportunities, demand, booking behavior, and potential outliers. Whilst pursuing my former role in JetBlue, various Machine Learning and Ensemble models were modeled by us and also a good amount of computing power and clusters were required to run the respective models. That was when I realized that I only knew what had to be done when from an application point of view and consequently, I wanted to obtain a detailed working knowledge regarding the mechanics behind the associated hardware and software used. Having been a financial engineering student and a data scientist, I have realized the significance of Artificial Intelligence in both the financial and airline industries and its potential to revolutionize the way we approach complex situations and problems. I have also come to appreciate the importance of Computer Architecture and its impact on the performance of the algorithms SHREYAS JAIKUMAR we use. This motivated me to go on a brief learning path towards AI, GPUs, SSDs, and CUDA, which further led to the reading and comprehending of various research and white papers in the field of Computer Science and Engineering along with those papers which were overlapping with that of Algorithmic Trading as well. Having obtained an Undergraduate Degree in Electrical and Electronics Engineering, I believe that advancing to a Ph.D. in Computer Science from the world-renowned Columbia University will equip me with the necessary skills and knowledge to further explore these areas of interest and help tackle the associated problems. Consequently, I am interested in exploring the intersection of Artificial Intelligence and Computer Architecture, especially in the context of developing efficient algorithms for large-scale and multi- dimensional data processing. The rise of Big Data has led to a need for faster and more efficient computing, and I am excited to be a part of this rapidly evolving field. I am also interested in exploring the potential of AI in optimizing hardware performance and improving power efficiency. Furthermore, I am eager to contribute to ongoing research in these areas and work towards developing practical solutions that can be implemented in real-world scenarios. I also believe that a Ph.D. in Computer Science from Columbia University will provide me with the opportunity to conduct in-depth research and collaborate with leading experts in the field, allowing me to further explore my interests and contribute to the development of cutting- edge technologies. Should I be offered an opportunity to attend Columbia University, you can rest assured that I will take advantage of the academic excellence offered by the institution and its faculty whilst contributing to meaningful dialogue during lectures and workshops. In conclusion, my academic journey so far has been a culmination of challenges, hard work, and perseverance, which has ultimately led me to my passion for programming, quantitative finance & algorithmic trading, data science, and now, artificial intelligence and computer architecture. I am confident that this prospective degree will equip me with the necessary skills and knowledge to make significant contributions to the field, and I am eager to take on the challenges and opportunities that lie ahead. SHREYAS JAIKUMAR",
    "Resume": "SHREYAS JAIKUMAR 2/8 Manonmani Ammal St, Kilpauk, Chennai-600010 | Mobile: +91 9840912895 | Email: sjaikum1@stevens.edu EDUCATION 2018 - 2020 Stevens Institute of Technology, Hoboken, NJ Master of Science, Financial Engineering, GPA 3.6 / 4.0 2013 – 2017 SRM Institute of Science and Technology, Chennai, INDIA Bachelor of Technology, Electrical and Electronics Engineering, GPA 8.5 / 10.0 WORK EXPERIENCE Oct ‘20 – July ‘23 Tata Consultancy Services Limited, North America Analyst – Data Services • Assisted Priceline in design, development, and implementation of efficient information systems in support of core enterprise functions. • Experienced working with Python and SQL to implement data extraction, transformation, curation and loading (ETCL) processes. • Utilized Spark for leveraging distributed computing frameworks for large- scale data processing and analysis. • Familiarized with Google Cloud Platform thereby utilizing its services for scalable and efficient data processing. • Assisted JetBlue’s data science team with Exploratory and Explanatory data analysis of the EMS pricing module to identify pricing opportunities, demand, booking behavior and potential outliers. • Developed robust unit tests using assertions and wrote test cases to check the quality, reliability, functionality and performance of the respective codes and queries. • Leveraged Tableau and Spotfire by creating compelling visualizations that helped in driving actionable insights. Jul ‘19 – Aug ‘19 JetBlue Airways Corporation, Long Island City, NY JET Intern, IT Project Management Office • Analyzed the 1,3 and 5-year forecast reports based on projected growth, cash inflows and outflows pertaining to the various IT departments. • Assisted with the ongoing development of the Project Task Management tool . Oct ‘17 – Feb ‘18 Atyant Capital, Chennai, INDIA Financial Analyst (Intern) • Performed qualitative analysis and equity research to help improve the firm’s client portfolio performance. Aug ‘17 – Sep ‘17 ithought Financial Consulting LLP, Chennai, INDIA Summer Financial Analyst • Formulated individual financial plans for the firm’s high net-worth clients. SKILLS MS Office Suite, C++, Python, R, MATLAB, SQL, Spark, GCP, Tableau, Spotfire & Bloomberg Certification"
}