{
    "ID": "976927815",
    "SOP": "HariSanthanam My first exposure to a major research environment was in my junior year at Princeton University,whenI conducted researchinProfessor NirajJha’slab. Iwas taskedwithdetermining if a sparse ResNet-50 architecture could achieve similar levels of accuracy as a dense architecture when trained on a small retinal dataset of OCT scans. Through many binary classification experiments, between the healthy class and each retinal disease class, and multiclass classification experiments, I discovered that therewasan averagediscrepancyof only 0.5% in performance between the dense and sparse architectures. It was a great learning experience, as I discovered the intricacies of transferlearning andPyTorchmodel training. Most of all, I found within mea desiretoengage inresearch anddiscovernewknowledge. Ihave since become further fascinated by topics in computer vision, machine learning, and image analysis, through rewarding research opportunities as a B.S.E. student at Princeton and as an M.S.E. studentatUPenn. During my senior year at Princeton University, I completed my Undergraduate Senior Thesis under the guidance of Professor Niraj Jha. In my first foray into computer vision, I focused on applying an image synthesis technique called DeepInversion to an instance segmentation network, reducingthe needfor labeledvideo data infutureapplications.Todothis, I inverted a fixed Mask R-CNN architecture, from random noise, with additional image and feature distribution regularization terms to generate input frames fromthe DAVISdataset. Since this was the first application of DeepInversion to an instance segmentation network, I faced several development challenges in model design and TensorFlow implementation that required me to pose novel questions and form creative solutions. After months ofexperimentation, I was happy to finally synthesize DAVIS video frames and have my work featured by the Princeton HariSanthanam Statistics and Machine Learning Center. Through this research project, I understood the importance of persevering through challengesand appreciatingtherewarding, yetdifficult nature of research. In my first year as a Robotics Master’s student at UPenn, I pursued a newfound interest in Explainable Artificial Intelligence (XAI). Under the mentorship of Professor Lyle Ungar, I worked with doctors from the University of Utah on a Pediatric Sepsis study, presented in the form of Electronic Health Record (EHR) data. While XAI methods do exist to understand and analyze models trainedon EHRdata, ourcasestudy presentedmany casesof featurecollinearity, which XAI models work poorly on. As a result, I used Shapley values to illustrate the need for feature set creation and feature adjustments to remove collinearity and enhance model explainability. During this interdisciplinary endeavor, I was fortunate to be able to work with doctors, so I could gain agreaterunderstanding of themedical andbiologicaldrivers behind ML predictions. I am excited that these findings could contribute to the current XAIliterature inthe medical domain. This project provided me with a meaningful lens to explore the remarkable interplay between machine learning and healthcare, and showed me that scientific research can be usedinservice of others. In my second year atUPenn, Icompleted aMaster’sThesis inProfessorJianbo Shi’s lab, focused on computer vision research. Motivated by applications that need adaptable 3D shape models, usually with little training data, I automatically generated a contour labeled dataset that contains crucial information for basic 3D object understanding. With this novel dataset, I explored the performance of instance segmentation architectures on detecting and labeling the HariSanthanam contours, and additionally demonstrated a surprising improvement in 3D reconstruction from a 2D image. Not only did my work culminate in a co-first author publication in the Winter Conference on Applications of Computer Vision (WACV 2023), but it also gave me the opportunity to engage in discussions with researchers in industry and academia, and share my work with faculty in the field through thesisandconference presentations.From theseformative experiences, I have learned how to confidently communicate my research, think creatively and independently,andform strong relationshipsin aresearchcommunity. I have expanded my interests in machine learning and computer vision through industry research as well. As anAdvancedR&D Internat AmazonRobotics, Igenerated syntheticdata to improve the segmentation performance onanewwarehousesensorsetting. Tothisend, Ilearned transformations, using GANs, that realistically placed labeled foreground objects from a pre-existing sensor setting into the new setting. After a gratifying internship at Amazon, I am now working at Agility Robotics, where I develop perception models for human-centric robots. With these experiences, I have developed the ability to solve challenging, open-ended research problemsthat haverealworld applications. My past research and academic experiences motivate me to continue work in machine learning and computer vision, specifically for biomedical imaging analysis. For this reason, I have a strong interest to work with Professor Despina Kontos and contribute to her groundbreaking work in this field. I am especially excited by her research in the use of AI and machine learning for understanding and diagnosing cancer. I have read with great interest her work onDeep-LIBRA,whichuses CNNs,superpixel generation, andradiomic machinelearning, HariSanthanam to achieve an impressive AUC for breast density estimation on a multi-racial, multi-hospital dataset. Also, I am very interested in her work on identifying intrinsic phenotypes for breast cancer risk, using traditional machine learning techniques. More generally, I am drawn to work with Professor Kontos because of her use of imaging for enhanced disease diagnosis and non-invasive medical care. I believe my research experiences inmachine learningandcomputer vision, and my strong interest in biomedical imaging analysis, allow me to be a great fit for ProfessorKontos’ lab. I hope to join Columbia’s Ph.D. program and engage in collaborative work with researchers in the Vagelos College of Physiciansand Surgeons,anddevelop biomedical imaging models that benefit society. I am especially excited by the possibility of working with leading biomedical researchersinthe worldand contributingto theinterdisciplinary researchinthe BME department, by drawing from my background in electrical engineering, robotics, and computer science. I am also delighted to learnthat theprogram emphasizesteachingexperiencesfor Ph.D. students. One of my more memorable experiences as a Master’s student at UPenn was working as a teaching assistant for a graduate level computer vision course.Asa Ph.DstudentinBME, I look forward to forging more experiences as a teaching assistant and tutoring students from diverse backgrounds. In the future, I would like to lead an academic research lab, founded on innovation, collaboration, and service, and pioneer groundbreaking work in vision and ML for biomedical imaging applications. I look forwardtoembarking onthis journey,through the Ph.D. program atColumbiaUniversity.",
    "Resume": "Hari Santhanam 484-340-9848 | santhanam.hari@gmail.com | santhanamhari.github.io | santhanamhari | hsanthanam Education UniversityofPennsylvania Philadelphia,PA M.S.E.iNROBOTiCS,GPA:4.00 Sep2020‑May2022 SPECiALiZATiONiNCOMPUTERViSiON PrincetonUniversity Princeton,NJ B.S.E.WiTHHONORSiNELECTRiCALENGiNEERiNG,GPA:3.64,DEPARTMENTALGPA:3.85 Sep2016‑Jun2020 CERTiFiCATESiNSTATiSTiCSANDMACHiNELEARNiNG,ROBOTiCSANDINTELLiGENTSYSTEMS Coursework AdvancedTopicsinMachinePerception,ComputerVision&ComputationalPhotography,DeepLearning,MachineLearning,LinearAlgebra&Opti‑ mization,LinearSystemsTheory,DigitalSignalProcessing,BuildingRealSystems,Probability&StochasticSystems,Algorithms&DataStructures Skills Programming: Python,Java,C,C++,Matlab,R,Verilog Frameworks: PyTorch,Tensorflow,OpenCV,Numpy,Keras WorkExperience AgilityRobotics Tangent,OR OBJECTDETECTiONANDTRACKiNGPERCEPTiONENGiNEER Sep2022‑present • Creatinganddeployingdataaugmentationtechniquestoenhancetheobjectdetectionandtrackingsystemonhuman‑centricrobotDigit. AmazonRobotics Boston,MA ADVANCEDROBOTiCSR&DINTERN Jun2021‑Aug2021 • ImprovedMaskR‑CNNsegmentationperformanceinnewsensorsettingbyperformingdomainadaptationwithgeneratedsyntheticdata. • Placedforegroundobjectsintonewsensorsetting’sbackgroundbasedonderiveddistributionandusedaGANtocreaterealisticblending. PrincetonProjectX Princeton,NJ RESEARCHINTERN Jun2019‑Aug2019 • CombinedConvLSTMwithPReMVOS,asemi‑supervisedsegmentationnetworkthattracksanobjectbasedonvideo’sfirstframe. • Adaptednetworktotrackanobjectinvideobasedontemplateimage,ratherthanvideo’sfirstframe,andachievedpromisingJ&Fmeanscores. LighteningEnergy Dover,NJ ELECTRiCALENGiNEERiNGINTERN Jun2018‑Aug2018 • Developedanddesignedaprototypeforabatterypackconfigurationthatelectricallypowersanindustrialdevice. • Programmedabatterymanagementsystem(BMS)andpowersupplytoworkincohesionwiththepackforfactorysettings. PrincetonPlasmaPhysicsLaboratory Princeton,NJ RESEARCHINTERN Jun2017‑Aug2017 • DetectedoscillationsusingLangmuirprobesbyalteringthemagneticfieldstrengthandprobevoltagewithinacylindricalplasmatube. • DiscoveredionacousticwavescauseddetectedoscillationsusingMatLabandco‑wroteapaperfeaturedontheofficialPPPLwebsite. ResearchExperience LineLabellingandContourDetectionusingSOLOv2 Philadelphia,PA MSETHESiSADViSOR:PROFESSORJiANBOSHi Sep2021‑Aug2022 • Developedfirstconvexitylinelabelleddatasetusingnovelautomatedalgorithm,consistingofcontourextracting,labeling,andgrouping. • StudiedperformanceofSOAsegmentationalgorithmswithadditionalablations,anddemonstratedimprovementina3Dreconstructiontask. ExplainabilityofAIAlgorithmsinPediatricSepsisDetection Philadelphia,PA RESEARCHADViSOR:PROFESSORLYLEUNGAR Jan2021‑May2021 • Workedwithdoctorstodeveloprandomforest,logisticregression,andXGBoostmodelstopredictsepsiswithin4hoursofERadmission. • IdentifiedfeaturegroupsthataremostimportantdriversofpredictionusingShapleyvalues,anduniquelynormalizedage‑dependentfeatures. VideoSynthesis:BinaryMaskstoFramesviaDeepInversion Princeton,NJ UNDERGRADUATESENiORTHESiSADViSOR:PROFESSORNiRAJJHA Sep2019‑May2020 • Invertedapre‑trainedMaskR‑CNNarchitecturetoreverseengineerinputtrainingvideosequencesfromjustoutputbinarymasks. • OptimizednoiseasinputtensorandaddedweightedbatchnormalizationlossandpixelvariancelosstoexistingMaskR‑CNNarchitecture. UseofCompressedCNNstoDiagnoseDiseasesUsingSmallDatasets Princeton,NJ INDEPENDENTWORKADViSOR:PROFESSORNiRAJJHA Jan2019‑May2019 • TrainedcompressedResNet‑50models,pre‑trainedonImageNet,toclassifydiseasesfoundinsmallNIHChest‑XrayandOCTdatasets. • ComparedperformancewithdensemodelstrainedonthesameChest‑XrayandOCTdatasetsandachievedaveragediscrepancyofonly0.5%. Publication HariSanthanam*,NehalDoiphode*,JianboShi AutomatedLineLabelling:DatasetforContourDetectionand3DReconstruction WinterConferenceonApplicationsofComputerVision(WACV),2023 Honors&Awards 2020 CumLaudeHonors,PrincetonUniversity Princeton,NJ 2019 ProjectXSummerFundingAward,PrincetonUniversity Princeton,NJ 2018 PrincetonEnvironmentalInstituteFellowshipRecipient,LighteningEnergy Dover,NJ 2017 PrincetonPlasmaScienceandTechnologyInternshipRecipient,PrincetonPlasmaPhysicsLaboratory Princeton,NJ Leadership&Teaching UPennGraduateTeaching Philadelphia,PA TEACHiNGASSiSTANTFORCOMPUTERViSiONANDCOMPUTATiONALPHOTOGRAPHY Sep2021‑Dec2021 • Heldweeklyofficehoursandgroupcodingsessionsforlearningandimplementingtraditionalcomputervisionalgorithms. PrincetonMcGrawCenterforTeachingandLearning Princeton,NJ HEADUNDERGRADUATETUTORFORMULTiVARiATECALCULUSANDPHYSiCSMECHANiCS Jan2018‑May2020 • Ledateamoftutorsincoreengineeringclasses,andcommunicateddirectlywithprofessorsforeffectivetutoring. Extracurriculars PrincetonWindEnsemble Princeton,NJ CLARiNETiST Sep2017‑May2018 • AttendedbiweeklyrehearsalsandperformedatRichardsonAuditoriumwiththeOxfordWindEnsemble. PrincetonClubTravelTennis Princeton,NJ MEMBER Sep2017‑Jan2018 • PlayedonthetravelclubteamthatcompetesagainstotherclubteamsintheIvyLeague."
}