{
    "ID": "085892373",
    "SOP": "MaheshGaneshBhat It seemed like magic when I got my first video gaming console: an array of objects working together to provide a new experience made possible by something. I realised the science of that magic when I started understanding the world of electricals, electronics, and integrated circuits. The idea of a bunch of tiny devices being able to contain so much data and perform so many functions attracted me towards electronics. My strong academic foundation during my Pre-University studies facilitated my pursuit of an undergraduate degree in Electronics and Communications Engineering at The National Institute of Engineering. Participation in Robotics workshops and implementation of microcontroller-based projects, such as obstacle-avoiding bots, line-following bots, and DTMF-Controlled bots, piqued my interest in Microcontrollers, Control Systems, and Embedded Systems. This led me to undertake projects based on Arduino during my undergraduate studies, including the development of a Resistive Touchscreen-based Smart Wheelchair for the differently-abled. This project motivated me to delve deeper into microcontroller architecture. For my graduation team project, I designed a Visible Light Communication system using the System-on-Chip RaspberryPi for medium bit-rate data transmission of files. The system achieved speeds of a few Megabits per second and successfully transmitted data of up to 6 kilobytes with minimal errors. My fascination with the realm of technology has motivated me to further my education and pursue a graduate degree. After evaluating various academic institutions, I elected to enrol in the Communications Engineering master's program at the prestigious Technical University of Munich. Despite its nomenclature, the program is a culmination of diverse courses and electives that encompass a range of subjects relevant to communication technology, including hardware, software, and mathematical concepts. Based on my prior interests and current knowledge, I have identified two streams that are of particular interest to me: Embedded Systems and Security, and Data Networks and the Internet of Things (IoT). The German higher education system offers a valuable opportunity for students to gain practical experience in research through a structured course format that includes a research internship and a master's thesis. In this regard, I was fortunate to secure a research internship at the Fraunhofer Institute for Applied and Integrated Security (AISEC), where I worked for three months on integrating Compute Unified Device Architecture (CUDA) into the institute's secure virtualisation solution. During my time at the institute, I gained hands-on experience with the Yocto-based Linux distribution and acquired fundamental knowledge of operating system development. Building on my prior student project experiences, I was able to secure a research opportunity for my master's thesis at Huawei Munich Research Center, a leading industry player in telecommunications and data networks. During my time at Huawei, I conducted an investigation and comparison of Network Management Protocols for Industrial Networks. This involved the development of prototype implementations of complete RESTCONF and the newly proposed CORECONF stack in C, using standard GNU libraries. The performance of these protocols was then compared against the currently used NETCONF, with respect to key parameters. The test network was emulated MaheshGaneshBhat using a combination of mininet in docker virtualisation. This experience provided me with valuable technological and personal skill improvement and practical research skills related to literature survey, timeline and milestone determination, and documentation. The research has been submitted to the IEEE IoT Journal and is under review. These experiences have prepared me for the extensive effort required in successfully pursuing and completing a Doctoral research degree. I am a diligent and disciplined student who likes to keep simple goals and keep expanding along with newer add-ons. Being a part of various co-curricular student bodies like the quiz club and the Innovation and Multimedia committee, I have paid utmost attention to balancing academics and extra-curricular tasks, constantly trying to expand my knowledge of the core basic subjects of electronics. This is an important reason for me to take up this course to enhance my learning. I believe that with these experiences working on relatively niche concepts with little to no prior headstart, I have gained devotion towards dedicated research work to satiate my curiosity which might be a good fit for a doctoral research candidate. Columbia University is a highly esteemed academic institution renowned for its significant research contributions. The Department of Electrical Engineering covers a plethora of domains that intrigue me, given my interest and prior research experience in the Internet of Things (IoT). In particular, the research interests of Dr. Zoran Kostić seem very interesting and appealing given my affection towards the areas of Industrial IoT, Security and Embedded Systems and I would be glad to get an opportunity to work under his tutelage. I am eager to pursue my academic aspirations at Columbia University and contribute to the institution's legacy of excellence in research and education. The pursuit of a doctoral degree is of great interest to me as it would allow me to delve deeply into and broaden my understanding of the fundamental components that make daily living possible. Upon completion of the program, my primary objective is to join an organization and generate original ideas that satisfy people's curiosity. As a model student, I would enhance the reputation of the university. The academic knowledge and practical experience gained through the PhD program would enable me to add value to the esteemed institution. After a thorough examination of the available courses, I am confident that I will be guided towards a distinguished career path. In a nutshell, I yearn to be a part of the Ph.D. program at Columbia University. Being part of the elite and revered institute would be an honour. I look forward to having a great learning experience, and I greatly appreciate your consideration of my application. Thank you in advance for considering my application.",
    "Resume": "Mahesh Ganesh Bhat Experience Details Master Thesis , Huawei Munich Research Center, Munich MAY 2022 — APRIL 2023 55, 1st Cross, Bhuvaneshwari Nagar, Title: Investigation and Comparison of Network Management Protocols Bangalore, 560057, India for Industrial Networks Phone: +91 9035732962 Email: mahesh81196@gmail.com ● Grade - 1.3 ● Develop prototype implementation of complete RESTCONF and CORECONF stack in C using standard GNU libraries Skills ● A comparative study of configuration management protocols in C Programming Industry 4.0, namely NETCONF, RESTCONF, and CORECONF C++ Programming Work Student, Huawei Munich Research Center, Munich Python NOVEMBER 2021 — APRIL 2022 ● Integrated the existing Docker-based proxy solution for a Time- A ssembly Language Sensitive Networking switch for device management demo setup VHDL Work Student, Fraunhofer AISEC, Munich Linux FEBRUARY 2021 — MARCH 2021 Embedded Systems ● Investigate the integration of Fraunhofer's Trustme Distro onto NVIDIA Jetson boards Embedded C Intern, Fraunhofer AISEC, Munich Contiki-NG OS for IoT NOVEMBER 2020 — JANUARY 2021 Cryptography ● Integration of CUDA modules into a custom yocto-based Linux kernel Keras ● Created containerized solution for CUDA applications with relevant Docker access rights for memory isolation Yocto Work Student: Junior Embedded Systems Engineer, Motius GmbH, Munich S ecurity for Embedded Security OCTOBER 2019 — FEBRUARY 2020 Time-Sensitive Networking Worked on different protocols for inter-vehicle communication ● Implemented modules for MQTT, AMQP, and DDS Languages ● Developed an integrated test suite based on the use cases English Education Kannada Master of Science in Communications Engineering, The Technical Hindi University of Munich, Munich Tamil OCTOBER 2018 — JUNE 2023 ● Subjects: Embedded systems and Security, Project lab Secure SoC Telugu for IoT (AES-GCM), Physical Unclonable Functions, Advanced Cryptographic Implementation, Quantum Computing, and Quantum Secure Communication, Project Praktikum Smart Card Hobbies Lab Playing Chess, Reading Books ● Seminar: A Study of Different Horizontal and Single Trace Side- Channel Attacks on Post-Quantum Cryptographic Algorithms Links Linkedin Bachelor of Engineering in Electronics and Communications, The National Institute of Engineering, Mysuru AUGUST 2014 — JUNE 2018 CGPA - 9/10 ● Seminar: Event-Triggered Model Predictive Analysis for Artificial Pancreas Control ● Class A - Variable Modulation Index AM Generator Projects Undergraduate project - HERMES, Mysuru OCTOBER 2017 — MAY 2018 The current model in design is aimed to enable faster data transmission compared to the existing models by making use of visible light spectrum and various data encoding methods. Resistive Touch Screen Controlled Wheelchair, Mysuru NOVEMBER 2016 — JANUARY 2017 The goal of this project was to ease the use of wheelchairs by utilizing the touch-based system for control. Integrated Resistive Touch Screen to Arduino to control the motor function Extra-curricular activities Hub Lead,Mysuru at IEEE Bangalore SAC FEBRUARY 2017 — DECEMBER 2017 Chairperson IEEE Spark NOVEMBER 2016 Student Activities and Communications coordinator and Treasurer at NIE IEEE Student Branch AUGUST 2015 — JUNE 2016 Courses Fundamentals of Computer Network Security Specialization, Coursera Applied Cryptography Specialization, Coursera Introduction to Applied Cryptography Specialization, Coursera Publications Ganesh Bhat, Mahesh; Bhattacharjee, Sushmit; Gündoğan, Cenk; Alexandris, Konstantinos; Gogolev, Alexander (2023). “CORECONF, NETCONF, and RESTCONF: Benchmarking Network Orchestration in Constrained IIoT devices”. IEEE IoT Journal. Submitted* https://doi.org/10.36227/techrxiv.23987106.v1"
}