{
    "ID": "600922991",
    "SOP": "STATEMENT OF PURPOSE While pursuing my master’s degree in Biomedical Engineering (BME) at Duke University, I had the privilege of exploring a range of research domains in Machine Learning (ML) such as Digital Image Processing, Generative Modeling, Robustness and Bias in Artificial Intelligence (AI) and Signal Processing. Based on this experience, an intersection of biomedical signal processing and multimodal machine learning has emerged as a focal point for my PhD aspirations. ML research in BME has predominantly focused on unimodal learning tasks, usually using one type of modality (biomedical images, medical records, wearable sensor data, etc.) but real-world biomedical data is often a combination of multiple modalities in conjunction with abstract con- cepts (disease progression, treatment response, patient outcomes, etc.). Human learning is usually multimodal involving interpretation of complex entity relationships and interdependencies between variables and concepts from different modalities. To make machine learning models capable of such inference, we need to capture these complex interdependencies with multimodal learning into one model. With that in mind, I am interested in focusing my Ph.D. research on developing machine learning models for such multimodal learning with special emphasis on biomedical applications. During my first semester, I got captivated by the role of generative models in drug discovery, leading to my research project on “Reinforcement Learning for Generation of Novel Non-toxic Molecules” under the guidance of Prof. Daniel Reker. I used a generative model trained with the Chembl dataset and compared classifiers (Random Forest, SVM, MLP) on the Tox21 dataset, optimizing the network for non-toxic structure generation. SVM, with the highest recall, was integrated into a reinforcement learning pipeline, resulting in a bias towards non-toxic molecules in the generated compounds. This research project kindled my interest in generative modeling. Robustness in AI, is a new paradigm in machine learning that aims to develop AI systems that are resilient to noise, uncertainty, and unexpected changes in their environment. I was introduced to this concept while working on a research project to build ML models using microscopic image data that had spherical aberrations, which often hampers the precision of segmentation tasks under Prof. Roarke Horstmeyer. As a team, we developed a solution that involved integrating a trainable physical layer into the UNET network architecture. We evaluated three different versions of this solution and found that employing Zernike polynomials for correction demonstrated superior segmentation accuracy. It would be highly advantageous for healthcare AI models to possess the capability to autonomously correct themselves and maintain consistent, reliable performance, even when confronted with inherently aberrant or inconsistent datasets. Fairness and Bias in AI, especially in healthcare, is of paramount importance. I explored bias in clinical prediction models to study the effect of race on model performance under Prof. Jessilyn Dunn. I evaluated the predictive capabilities of machine learning algorithms for 30-day hospital readmission after hip fracture repair surgery, specifically examining potential performance dispari- ties by race. I employed random forest with lasso regression for this work. However, underrepresen- tation of minority classes in the existing datasets underscores the need for more diverse healthcare datasets for future research, a fact that I would like to be mindful of in my future research activities. I have been fortunate to be involved as a Research Assistant (RA) in two of Duke’s Biomedical Engineering laboratories. My experience as an RA in the Computational Optics Lab under Prof. 1 Roarke Horstmeyer has reinforced my interest to pursue further research in the vision and image processing domain for my PhD. I gained hands-on experience in cell image data acquisition, pro- cessing, and annotation. I acquired and processed this data using a microscopic system at various magnifications, and developed code to annotate cells in low-magnification images and transfer an- notations to higher-magnification counterparts. My work to transfer annotations between images of different resolutions could be used to develop new methods for multimodal learning that can handle data from different modalities with different resolutions. Since last summer, I have been actively working as an RA on building ML models using temporal biomedical signals for assessing Traumatic Brain Injuries (TBI) in mice models. This work is being done at Duke’s Applied Machine Learning Lab under the guidance of Prof. Leslie Collins, Prof. Boyla Mainsah, and Dr. Bradley Kolls. Our research introduced an automated approach for feature extraction from EEG data. We developed a convolutional autoencoder to condense EEG signals, preserving vital information while reducing dimensionality. These encoded features were then used in clustering and topic modeling techniques, including Latent Dirichlet Allocation (LDA), torevealhiddenpatternsinTBIdata. Thismethodologystreamlinesanalysisanduncoverscomplex relationships, offering valuable insights for TBI research and assessment. We are further exploring modern clustering methods like BertTopic to investigate TBI severity and recovery patterns in mice models. This work aims to develop machine learning tools that can be used to improve the diagnosis and prognosis of TBI, and to identify new therapeutic targets. During my undergraduate years, I have been fortunate to get an opportunity to do research under the guidance of many eminent researchers from University of Pennsylvania, Stony Brook University and MIT-ADT University Pune. One project that stands out is a project on transfer learning for oral cancer detection, a collaboration with Stony Brook University and a dental hospital1. With real patient data, I worked to use pre-trained image classification models (InceptionNet, MobileNet and ResNet) and applied transfer learning strategies to oral cancer data, achieving a 10-15% accuracy improvement. We summarized this work as a research paper uploaded on arXiv, and I was very delighted to learn that my first paper has been cited by various research groups several times. IhavealsobeenaTeaching AssistantfortwocourseswhileatDukeandIhavethoroughlyenjoyed my teaching experience. Each experience thus far has proven to be a great source of motivation leading me to decide to pursue a career in academic research. I strongly believe academia is one of the most impactful careers that provides an avenue to drive research and push the boundaries of knowledge. I would like to continue in academic research after my PhD. To embark upon an academic research career path, Ph.D. at Columbia University is undoubtedly the appropriate next step for me. Columbia is one of the esteemed research institutions in the world where Biomedical AI research is already underway. I want to be part of such research efforts that will certainly define the course of tomorrow’s AI research in healthcare going forward. I would be honored to have an opportunity to do research work under the guidance of Prof. Elham Azizi, Prof. Andrew Laine, Prof. Nima Mesgarani, Prof. Kaveri Thakoor, and Prof. Sanja Vickovic, as their work is highly synergistic to my PhD research interests as outlined above. I am confident that with my relevant research experience, intellectual curiosity and team spirit, I will be able to contribute effectively to Biomedical AI research and my research group. 1https://arxiv.org/abs/2011.11610 2",
    "Resume": "RUTWIK JAYANT PALASKAR rutwikpalaskar@gmail.com (cid:135) https://github.com/RutwikP (cid:140) https://rutwikp.github.io/ fl http://www.linkedin.com/in/RutwikPalaskar SUMMARY Interested in interdisciplinary research combining Machine Learning, Healthcare and Bioengineering. EDUCATION Duke University, Durham, USA Aug 2022 Master of Science (M.S.), Biomedical Engineering 3.5/4 MIT ADT University, Pune, India Aug 2018 - Jul 2022 B.Tech. Bioengineering 8.4/10 EXPERIENCE/INTERNSHIPS Duke University Graduate Research Assistant May 2023 - Present • Working on Automating Traumatic Brain Injury (TBI) Assessment in Mice. • Utilizing an autoencoder to extract features from the EEG signals and employing these features in clustering and topic modeling techniques, including Latent Dirichlet Allocation (LDA), to uncover TBI severity clustering. Duke University Graduate Teaching Assistant June 2023 - Aug 2023 • Graduate Teaching Assistant/Co-Pilot at The Fuqua School of Business. • Facilitated courses in Strategy, Financial Accounting, and Managerial Economics as a valuable member of the instructional team. Duke University Graduate Research Assistant Jan 2023 - May 2023 • Graduate Research Assistant in Computational Optics Lab under Prof. Roarke Horstmeyer. • Acquired and processed white blood cell image data using a microscopic system at various mag- nifications. • Developed code to annotate cells in low-magnification images and transfer annotations to higher- magnification counterparts. • Demonstrated proficiency in maintaining and updating the lab’s websites. Duke University Graduate Teaching Assistant Jan 2023 - May 2023 • Graduate Teaching Assistant for Medical Instrumentation course. Nihilent Technologies Pvt Ltd Intern Jan 2022 - Jul 2022 • Collaborated on developing a machine learning model aimed at detecting facial landmarks to enhance the precision of the company’s emotion analysis tool, Emoscape. University of Pennsylvania Intern Jun 2021 - Dec 2021 • Extended the capabilities of the large-scale deep learning framework GaNDLF for kidney tumor segmentation utilizing computed tomography (CT) scans. • Implementedalgorithmstoextractintensitydistributions,amplifyingkidneyandtumorstructures. Stony Brook University Intern Oct 2020 - May 2021 • Refined my work on oral cancer detection. • Implemented histogram matching augmentation as a generalization technique over multi-site data for cardiac image segmentation. • Extended histogram matching augmentation for generalization of machine learning models for Oral Cancer Detection. Tech Smart Systems Data Science Intern Mar 2019 - Apr 2019 • Trained machine learning models for classification and regression tasks on in-house housing prices dataset. PROJECTS Reinforcement Learning for Generation of Novel Non-toxic Molecules Duke University, Machine Learning in Pharmacology Dec 2022 • Generated non-toxic molecules from the Tox21 dataset. Employed Reinforcement Learning to enhance molecular generation, biasing it toward non-toxicity. • Successfully coupled a Support Vector Machine (SVM) predictive model with a Recurrent Neural Network (RNN) generative model to optimize molecule generation. • Demonstrated that reinforcement learning produced molecules biased towards non-toxicity. Analysis of Spherical Aberration Correction in Microscopic Images using Physical Layers Duke University, Machine Learning in Imaging May 2023 • The project aimed to enhance the robustness of machine learning models when applied to mi- croscopic image data affected by spherical aberrations, a factor known to disrupt the accuracy of segmentation tasks. • Developed an approach involving the integration of a trainable physical layer into the UNET net- work architecture. • This solution, utilizing Zernike polynomials for correction, significantly improved segmentation accuracy. Exploring Bias in Clinical Prediction Models: Does Race Effect Model Performance? Duke University, Intro to Biomedical Data Science May 2023 • Evaluated the predictive capabilities of machine learning algorithms for 30-day hospital readmis- sion after hip fracture repair surgery, specifically examining potential performance disparities by race • Model performance didn’t significantly differ when predicting minority patients. Shwaas: Social Distance Tracking and Health Monitoring App iBase Electrosoft LLP, Virtual Mar 2021 • An App that ensures social distancing during the Covid 19 pandemic where recording a person’s temperature and O2 saturation can be noted by just scanning a QR code to reduce contact and decrease the chances of the virus spread. • View Project Transfer Learning for Oral Cancer Detection using Microscopic Images Research Assistant, MIT ADT University Oct 2020 • Collaborated with medical professionals at a Pune hospital to curate one of the first datasets of microscopic images for oral cancer detection. • Evaluated and compared the performance of transfer learning models, including ResNet-50, In- ception V3, and MobileNet, against baseline CNNs, achieving a significant 10-15% performance enhancement. • Technical Report Predicting Urinary Incontinence in Elderly Medhacks Hackathon, Johns Hopkins School of Medicine Oct 2020 • Built an assistive technology for the elderly to predict urinary incontinence. • View Project Collection and Utilization of Single-Use Plastics and Various Other Industrial Wastes Smart India Hackathon Oct 2019 - Jul 2020 • Built a sustainable solid waste management system • Developed an online B2B e-commerce service for buying and selling of single-use plastics and var- ious types of industrial wastes. • Developed machine learning algorithms for real-time waste classification to segregate waste. • View Project ENTREPRENEURSHIP Prosthocentric Pvt Ltd Co-Founder Since 2019 We are developing innovative medical devices based on granted patents from the United States of America (USA), European Union (EU), France, Germany, United Kingdom and Finland. GRANT 1. Our start-up Prosthocentric Pvt Ltd received funding of Rs.50,00,000 ($62,500) from Biotechnol- ogy Industry Research Assistance Council (BIRAC), Government of India for early development of innovative medical devices. 2. We received another grant from Niti Aayog, Government of India of Rs. 1 Crore($1,25,000) for manufacturing of our devices. PUBLICATIONS 1. Rutwik Palaskar, Renu Vyas, Vilas Khedekar, Sangeeta Palaskar and Pranjal Sahu, “Transfer Learning for Oral Cancer Detection using Microscopic Images”, Under arXiv 2. Shreyas Patil, Mihir Kulkarni, Shubham Hajare, Tanvi Parkhe, Rutwik Palaskar, Diksha Zutshi, Reema Shyamsunder Shukla, Sameer Desai, “Assistive Device for Hemiplegic Pa- tients”, 3D Printing, Book Chapter SKILLS Platforms TensorFlow, PyTorch, Keras, Arduino, Django, Flask, Web Development Programming Languages Python, R, Java, C, C++, HTML, CSS RELEVANT COURSES Duke University Machine Learning in Pharmacology, Signal Processing and Applied Mathematics, Genome Tools and Technologies, Machine Learning in Imaging, Brain Computer Interfaces, Introduc- tion to Biomedical Data Science, Medical Electrical Equipment, Digital Image Processing, Introduction to Deep Learning MIT ADT C, Java, Advanced Java, Machine Learning, Python, Data Mining and Warehousing, Microcontrollers and Bioelectronics, Electrical engineering, Applied Mathematics, Genomics, Microbi- ology, Biostatistics, Genetics, Molecular Biology, Genetic/Pharmaceutical Engineering, Biochemistry HONORS AND AWARDS Smart India Hackathon, Finalist 2020 Represented my university at the all-India level in this hackathon Class Representative 2019 A mediator between students and teachers for communicating student welfare issues to the administration department. Team Player Award 2019 Dedication to Social Causes by Odser Charitable Trust, Pune"
}