{
    "ID": "715195754",
    "SOP": "ChrisZhuang My researchinterest liesinneuroimaging withafocusinimageprocessing andmachine learning.This fieldisexciting becauseI understandhow usefulmachinelearning andimage processing isasatool for medicalapplications.Whileneuroscienceapplicationsareespecially challenging,theyareimportant tohelp usunderstandthe brainbetterand developtechnologies that canbeusedin aclinicalsetting, suchas nervedetectionduring surgery. My initial interestinmachinelearning developedwhenItook DataSciencePrinciples and DataScienceLabatthe Universityof Texas atAustin. Mydesireto workon machine learningresearch developed whenIwas acceptedtoa computationalbiologyResearch Experiencefor Undergraduates (REU) atthe Universityof Tennesseeat Chattanooga.I worked under Dr.YuLiangand Dr.Dalei Wu onaproject developingagraph neuralnetwork tobetter predictCOVID-19 spread. Inthis experience,Ilearned theimportanceof goingthrough literature andtesting different neuralnetworkstogenerate betterresults. I realizedIenjoyed the multidisciplinary interface between machinelearningand biology. My fascinationwith thebrainfirst developedwhenI tookcoursesin neuroengineering and brain-computer interactions withDr.Jose Millan.I enjoyedlearning aboutdifferent neurotechnologiesthat improve thelivesof peoplewith disabilities.I decidedtocontinue exploring thefieldbyconductingaresearch projectwithDr.Millan ondecodingand classifying neural signalsfrom thehippocampus withthegoal ofrestoringmemory.I gained valuable experienceusingMATLAB toimplement filtersandmachinelearning algorithms onneuraldata. This alongwithmy appreciation for multidisciplinaryresearchled metopursueopportunities combiningmachine learning andneuroscienceresearch. ChrisZhuang A coursein digital imageprocessingestablishedmy specificinterestinneuroimaging. I was especiallyinterestedin denoisingandsuperresolution, andwanted toexplorethe applicationstowardsmedical images.Thefollowing semester, Iworked withDr. BoZhaoon inverseimagingproblemsusing magneticresonance imaging(MRI)data collected fromthe brain.I learnedto implementdifferentmachine learningmodelsfor imageprocessing like the U-Netand thedeepimage prior.Thisexperiencetaught methe importanceofunderstanding the mathematical intuitionbehind specificimageproblemslike MRInoise beforeapproaching it with machinelearning. I further explored image processing thispast summer intheWellman-HST Summer Institutefor Biomedical OpticsREUat MassachusettsGeneral Hospital(MGH).I internedunder Dr.Benjamin Vakoctoimplementa nervedetectionalgorithm usingdata collected from polarization sensitiveopticalcoherence tomography,anexciting imagingtechniquethat uses polarized lightto detectintensity,phase retardation, andoptic axisorientation.I wasable to implement theMaskR-CNN,aninstance segmentationmodel, andgothrough theentire process of creating adataset.In thisexperience,I learnedhow toimplement computer visionalgorithms, utilizedockerto setupa local hostfor annotations, andconnectresults tophysiological properties alongwithpropertiesof theimagingmodality.Towards the endofthe summer,Ihad theopportunity toprepare andpresent aresearchposteronmy workwhichI sharedwithmy peers andtheresearch community atMGH. Thisexperienceconfirmedmypassionfor research and myinterestin neuroimaging withafocusonimageprocessing andmachinelearning. Columbiaoffers the opportunitytoexplore machinelearningand imageprocessing though theVisionand Roboticstrack. Iplan todivedeep intomachine learningandcomputer vision, andthenbranchout intothe neuroimaging realm.I wanttodevelop theintuition and ChrisZhuang understanding of themachinelearning toolsthat I amusing beforeapplying them for neuroimaging clinicalapplications likeMRI superresolutionor nervedetection.I amexcited to take coursesinmathematicsfor machinelearning andsignalrecognition, deeplearning for computervision, andapplied machinelearning.I amalso excitedbyall the facultyinthe Vision and Roboticstrack,and I would hopetobe ableto workwithDr.Shih-FuChang. Dr.Chang’s work onfew-shotobjectdetectionexcites meas Ibelieve therecouldbe manyapplicationsfor neuroimaging wherecompleteimagescan bescarce. After graduation,Iplan topursueacareerin academia.My interestinteachingdeveloped whenI was ateaching assistantfor Probability andMultivariable Calculus. Myrole for both involved holding officehours andgradinghomework. Inorderto helpthe studentssucceed,I made suretoreviewthematerial, fillinknowledge gaps,and regularlyconsulttheprofessor. Collaboratingwith thegraduate teachingassistantsfor theseclasses helped mesee theirpassion for teaching andability toeasilydisseminate engineeringknowledge. Iam lookingforward to theopportunity of beingagraduate teachingassistantatColumbia, asI believeit willboost my ability tothrive inacademia.",
    "Resume": "Chris Zhuang (832) 670-5777 | chriszhuang0824@utexas.edu E DUCATION Bachelor of Science, Electrical and Computer Engineering, Mathematics, Dec/2023 The University of Texas at Austin Overall GPA: 3.64/4.00 Relevant Coursework: Data Science Lab and Principles, Brain Computer Interfaces, Neural Engineering, Genomic Signal Processing and Data Science, Real-Time Digital Signal Processing Lab, Digital Image Processing W ORK EXPERIENCE Undergraduate Researcher, HST-Wellman Biomedical Optics REU, 06/2023 – 08/2023 • Use OCT to image nerves and label dataset for computer vision. • Apply new computer vision and imaging algorithms to do object segmentation on nerves. • Analyze the results from object segmentation for OCT. U ndergraduate Researcher, Computational Biology REU, 05/2022 - 07/2022 • Implemented transformers and added parameters to neural network to predict covid cases. • Presented research to REU faculty and participants. • Communicated with professor to complete research. Undergraduate Researcher, University of Texas at Austin, 08/2022 – 12/2022 • Preprocess EEG data by filtering in gamma bands, using Fourier Transform, and calculating PSD. • Apply machine learning methods to try to predict spikes in the filtered data. • Analyze the results and discover reasons for data trends. U ndergraduate Course Assistant, University of Texas at Austin, 01/2023– 5/2023 • Held office hours and calculus lab sessions to assist students. • Help lead discussion sessions to review concepts for lectures. • Communicated with the professor and the rest of the teaching team. E CE Undergraduate Teaching Assistant, University of Texas at Austin, 08/2021 - 12/2021 • Held office hours to assist students in probability. • Coordinated with the teaching team. • Assisted professor in grading and checking quizzes. S KILLS Machine Learning implementation: Python, MATLAB Algorithm development: MATLAB, Java, Python, C++ High-Level languages: Python, C, C++ Assembly languages: LC3, ARM Cortex-M4F A CCOMPLISHMENTS Charles W. and Margaret A. Tolbert Endowed Scholarships and Fellowships in ECE, 2023 Active Member, Institute of Electrical and Electronic Engineers (IEEE), 2021–Present Active Member, Biomedical Engineering Society (BMES), 2020-Present"
}