{
    "ID": "751877557",
    "SOP": "HaoyuZhang Ph.D. inMechanicalEngineering,2024Spring Personal Statement I'm interested inColumbiaUniversity'sMechanicalEngineeringPhD programbecause Ihave a strongdesireto collaboratewithDr.Gerard Ateshian.Myresearchinterestrevolves around investigatingthemechanical propertiesofarticular cartilagetoadvancediagnostics and treatment for cartilage-related disorders.Thisinvolvesaspecificfocusonmechanismsof wear and resultantstructuralchanges toarticular cartilage.Iplan toleverage computationalmodeling, advancedimagingtechniques, andexperimentalmethodsto enhanceourunderstanding and improve patientoutcomes inmusculoskeletal health.Thisresearchdirection alignsperfectlywith Dr.Ateshian'swork onmusculoskeletal softtissuemechanics, withaparticular emphasison cartilage mechanics,lubrication,andtissue engineering.Therefore,I believeit'sinmy best interestto pursuemyPhD under hisguidance. My enthusiasmfor biomechanicsstemsfrom myundergraduateseniorcapstoneproject titled \"Marine-Life-Friendly PropulsionSystem.\" In thisproject, Icollaborated withfour teammatesto develop apropulsion system thatprioritized lownoise levels,marinelife safety,andenergy efficiency.It wasduring this projectthat Ifirst becameintrigued bybiomechanicsandgained an understanding of howbiomechanicalprinciplescan beappliedtoenhancemachine efficiency and structuraldesign.Our projectdrew inspirationfromobservingthe swimming techniqueof freestyleswimmers, andwe aimedtocreate ourown propulsionsystembased onthese observations.I took theleadinthe researchanddevelopment ofthe initialprototype thatcould recreatethepropelling forceof theswimmer withamechanicaldesign. Thisinvolved incorporating 3Dprinted 4-bar linkages,3D printedpinjoints,anda silicone-moldedflutter kick fin tosimulate theswimmingmotion of freestyleswimmers. Subsequently, weenhancedthe HaoyuZhang Ph.D. inMechanicalEngineering,2024Spring initial prototype byutilizingHDPE for increasedrobustness andintegratingpre-existing scuba diving finsthat wereoptimized inshape andmaterial.In theend,our propulsionsystemproved to bemoreefficient, produced lower noise,and wasmoremarine-life-friendlycompared to traditional models. In thefall of 2022,whenIbegan mymaster'sdegree atColumbia University,mydeveloping interestin biomechanicsdrew meto theresearchbeing conductedinDr.Ateshian's lab. Consequently,I became a partofthe MusculoskeletalBiomechanics Laboratory(MBL) under hisguidance,serving asa graduateresearchassistant. Within theMBL,I primarilyimmersedmyself inaresearch projectfocusedonthe propagation of wear inhumanarticular cartilage.Thisresearchaimsto investigatetheintricatemechanisms governingthewear andtear ofhuman articularcartilage duringdaily living, withaspecificfocus ondelaminationwear duetofatigue failure.Duringmy labhours, Iacquired variousvaluable skills, includingconductingmechanicaland frictionaltestsonarticular cartilageandanalyzing both qualitativeandquantitative methodsofassessmentto discernpotential sampledamage. During my initial twosemesters, spanning thefallof 2022andthe springof2023,myprimary focusrevolved aroundhoninga multitudeof skills.Thisencompassed acquiringpractices in dissecting humanandbovinetibiaeand femora,and familiarizingwiththe utilizationof PolarizedLight Microscopy (PLM)to observeandassess thedegreeof tissuedamageinarticular cartilage following frictional tests.Furthermore,I becameproficientin employingFujifilmand ImageJsoftware toprecisely evaluateinitial andfinalcontactareas between amechanical HaoyuZhang Ph.D. inMechanicalEngineering,2024Spring pendulum andcartilage, thereby facilitatingthe accuratequantificationof contactmechanics and frictional properties. Subsequently,inthesummerof 2023,Iundertookthe roleofastudentresearch fellowinMBL from JunetoAugust. During this period,Ibegan toeffectivelyapply theskillsetsI hadacquired, specifically inthecollectionof data for reciprocalslidingtestsonthe humanarticular cartilage. Theskills I cultivatedand thetests Iconductednotonly deepenedmyunderstanding ofarticular cartilage behaviorbut also broadenedmyperspectiveonthe progressionofosteoarthritis. In additionto myresearchexperiences, myacademic recordinboth graduateandundergraduate courseworkisexcellent. Duringmy undergraduatestudies,Isuccessfully completedall required courseworkwith ahigh GPA inthreeanda halfyears,despitethe demandingcourseloads I undertook.I was eventuallyawardedCum Laudeat theend ofmyundergraduatestudies. Furthermore, I havemaintainedasimilarly highGPAthroughout mymaster's levelstudies. Theseacademic achievements underscoremyabilitytograspcomplexconcepts andmy commitmentto learning.It demonstratesmyteachability andmygenuine enthusiasm for acquiringknowledge. Asa mechanicalengineeringstudent,I havealso beencaptivated bycomputationalmodeling.I amcontemplatinga hybrid approachfor myPhD studies,whichwouldintegrateaspects of computationalmodelingwithexperimental work.Withthis vision inmind, Ibelievethat Dr. Gerard Ateshian'slabismyultimate choice.Dr.Ateshian'sinvolvement inFEBio-related HaoyuZhang Ph.D. inMechanicalEngineering,2024Spring research alignsperfectlywith myaspirations,and Iam eagertocontinuelearning underhis mentorship. Thus,I amexcitedtoapply tothe MechanicalEngineeringPhDprogram. Throughout this PhD journey, myessentialgoalis tocontinuelearning andgrowingas aresearch scientist.I aspireto acquire theskills, knowledge,andexpertisenecessaryto leadindependent research endeavorsthatyieldsignificant findings.Sincemy priorexperienceshave been instrumentalin shapingmy careeraspirationswithin thefieldof musculoskeletal softtissue biomechanicsand orthopedics,venturinginto theindustry asaResearch andDevelopment(R&D) engineerismy envisioned pathuponcompleting thePhD program.Thisphase will offerme invaluablepractical experience andinsightinto cutting-edgedevelopmentsin thefield.AsI further evolve inmy career,myultimate objectiveis toestablish astartup companyfocused oncreating medicaldevices targetedat addressing musculoskeletaldiseases, such asosteoarthritisand osteoporosis.Theintentis tomake atangibleimpactonimproving thequalityof lifefor individualsafflicted bythese conditions.Ultimately, Iam drivenbythedesire tocontribute to advancementsin humanhealth, making ameaningful andlastingdifference inthefield of musculoskeletal biomechanics andorthopedics.",
    "Resume": "Haoyu Zhang 75SterlingBlvdApt315,Englewood,NJ07631·+1(413)362-6334·hz2831@columbia.edu RESEARCHINTEREST Investigating the mechanical properties of articular cartilage to advance diagnostics and treatment for cartilage-related disorders, with a focus on wear mechanisms and structural changes. Leveraging computational modeling, advanced imaging techniques, and experimental methods to enhance understandingandimprovepatientoutcomesinmusculoskeletalhealth. EDUCATION ColumbiaUniversity NewYork,NY MasterofScienceinMechanicalEngineering,concentrationinBiomechanics 09/2022-12/2023 ● GPA:3.8762/4.00 ● RelevantCourses:DataScienceforMechanicalSystems,IntroTheorytoElasticityI,Introductionto Robotics,SolidBiomechanics,MechanicsofFluid,AdvancedMachineDynamics,Soundand Hearing BostonUniversity Boston,MA BachelorofScienceinMechanicalEngineering 01/2019-05/2022 ● GPA:3.6/4.0|CumLaude(05/2022),Dean’sList(4timesduring2019and2022) ● RelevantCourses:EngineeringMechanics,FluidMechanics,ElectricCircuits,Mechanicsof Materials,ManufacturingProcesses,IntroductiontoMaterialsScience,EnergyandThermodynamics ● Honors:2020CGSTeamWCo-winningCapstoneAward(11/2020) RESEARCHEXPERIENCE InvestigatingtheImpactofMigratingContactArea(MCA)onInducingWearinHumanTissue andRefiningCartilageThicknessMeasurements,MusculoskeletalBiomechanicsLaboratory, ColumbiaUniversity NewYork,NY StudentResearchFellow 06/2023-08/2023 ● Employing advanced software applications including 3D Slicer, Geomagic Freeform, Geomagic Wrap, Creo, and MATLAB to develop and implement an improved testing protocol, resulting in enhancedaccuracyandstandardizedmeasurements. - Implementing the “Grow from Seeds” feature in 3D Slicer to isolate cartilage from bone and bariumsulfate,creatingprecisesegmentssavedinSTLformat. - Employing Geomagic Freeform to rectify imperfections and achieve a smooth surface for the cartilagemodel,ensuringhigh-qualitydataanalysis. - Demonstrating proficiency in using Geomagic Wrap to extract and refine bone and cartilage surfaces, leveraging features such as “Mesh Doctor” and “Remove Spikes,” and exporting them asIGESfiles. - Leveraging Creo to import IGES files and create a vertical plane for precise measurements, ensuringaccuratecartilagethicknesscalculations. - Utilizing MATLAB to generate visualizations,producingsurfacemapsthatdepictedvariationsin cartilageandbonethickness,contributingtocomprehensivedataanalysis. ● Contributing significantly to developing robust methodologies for measuring cartilage thickness, furthering understanding ofcartilagebiomechanics,andfacilitatingimproveddiagnosisandtreatment ofcartilage-relatedconditions. ● Performing data collection with various methods, including photography, surface scans, sample measurements, mechanical tests, Fuji film usage, friction tests, and post-mechanical tests, ensuring comprehensivedataacquisition. ● Conducting rigorous MCA vs. SCA tests on human femur cartilage to validate the wear induction capabilitiesofMCAtests,contributingtoadvancementsinthefield. InvestigatingMechanicalPropertiesandBehaviorofArticularCartilageforUnderstanding OsteoarthritisProgression,MusculoskeletalBiomechanicsLaboratory ColumbiaUniversity NewYork,NY GraduateResearchAssistant 10/2022-Present ● Collaborating with 3 graduate students to conduct mechanical tests onarticularcartilageandprovide insightsintofactorscontributingtocartilagedamageandosteoarthritisprogression. ● Successfully obtaining cartilage samples through dissections ofhumanandbovinetibiaeandfemora, facilitatingfurtheranalysis. ● Leveraging Polarized Light Microscopy (PLM) to observe and evaluate the degree of tissue damage in articular cartilage following frictional tests, providing crucial information for assessing cartilage behaviorunderstress. ● Employing Fuji film and Fiji software to accurately analyze initial and final contact areasbetweena mechanical pendulum and cartilage, enabling precise quantification of contact mechanics and frictionalproperties. ● Designing and integrating a specialized tensile tester grip into the existing compression tester, enablingefficientmechanicaltesting. ● Developing and implementingastandardizedphotorigthatensuresconsistentandaccurateimagesof cartilagesamplesandimprovestheefficiencyandreliabilityofdatacollection. ● Introducing a system that utilizes PET mirror sheets, resulting in enhanced profile shots for detailed cartilageanalysis,contributingtomorecomprehensiveresearchfindings. ResearchAchievements: ● Identified a volume error of approximately 8% to 9% compared to the actual object, improving the accuracyofvolumetricassessments. ● Progressed with the assembly and stability testing of the basic 3D-printed parts for the tensile tester grip,facilitatingadvancedmechanicalexperimentsandobtainingvaluableresults. InvestigatingtheEffectsofTestSolutionsonTectorialMembraneIntegrityinMouseCochlea, FowlerMemorialLaboratory,ColumbiaUniversityIrvingMedicalCenter,NewYork,NY StudentLaboratoryAssistant 10/2022-02/2023 ● Worked with a graduate student and the project supervisor to examine the impact of various test solutionsonthestructuralintegrityofthetectorialmembranewithinthemousecochlea. ● Performed precise dissections on mice using scissors, forceps, and a microscope to extract cochlear andtectorialmembranesamples. ● Conducted experiments immersing the tectorial membrane in various buffers, including TES, to investigate the specific test solutions that induce damage, providing crucial insights into the membrane’ssusceptibilitytodifferentconditions. ● Acquired proficient microscopy skills to facilitate accurate dissections, overcoming the challenge posedbythesmallsizeofthemousecochleaandensuringprecisesampleextraction. ● Developed an understanding of the mouse ear’s complex structures and demonstrated proficiency in extractingmousecochleaandisolatingthefragiletectorialmembrane. Development of Marine-Life-Friendly Boat Propulsion System, Boston University College of Engineering,Boston,MA UndergraduateStudentResearcher 09/2021-05/2022 ● Collaborated with a team of 5 students to develop amarine-life-friendlyboatpropulsionsystemwith afocusonlownoiselevels,marinelifesafety,andenergyefficiency. ● Led the R&D of the 1st prototype of the propulsion system by incorporating 3D printed 4-bar linkages,3Dprintedpinjoints,andasiliconemoldedflatterflutterkickfin. ● Enhanced the initial prototype by employing HDPE for increased robustness, implementing two connected 4-bar linkage mechanisms, using an assembly of 8020 Aluminum bars as the fixture, and integratingpre-existingscubadivingfinsoptimizedinshapeandmaterial. ● Devised a transistor-based power control circuit and a crankshaft design as a counterweight, further improvingthesystem’sefficiencyandperformance. ● Exhibited expertise in 3D printing, Computer-Aided Design (CAD), GibbsCAM, and materials selection,alongsideknowledgeinstructuralmechanics,fluidmechanics,andelectricalcircuits. ● Achieved a remarkable noise reduction of approximately 70% compared to conventional boats, highlightingthesystem’seffectivenessandenvironmentalbenefits. PUBLICATION Zhang,Haoyu.(2021).TaskOptimalSchedulingModelofMachiningSystemBasedonEntityModeling. JournalofPhysics:ConferenceSeries.Ser.1982012210. TEACHINGEXPERIENCE ColumbiaUniversitySEAS NewYork,NY GraduateCourseAssistant,Course:MECE-4606:DigitalManufacturing 01/2023-05/2023 ● Instructed and guided a diverse class of 110 undergraduate and graduate students within the Digital ManufacturingclassbycoordinatingcommunicationbetweenProfessorHodLipsonandstudents. ● Provided effective instruction, guidance, and support to students, ensuring their academic progress andcomprehensionofthecoursematerial. ● Offered timely feedback and clarification on homework assignments and projects, promoting a positiveandinclusivelearningenvironment. WORKEXPERIENCE ShenzhenBestoneCommunicationCo.,Ltd. Shenzhen,China MechanicalEngineeringIntern 05/2022-08/2022 ● Facilitated successful and timely project deliveries and after-sales services for 2 large communicationsequipmentprograms. ● Conducted weekly equipment inspections by remotely accessing themanagementinterfacethrougha laptopconnectedtothenetwork,identifyingandpromptlyresolvinghardwareissues. GRUE(Shenzhen)TechnologyCo.,Ltd. Shenzhen,China R&D&MechanicalDesignIntern 05/2021-08/2021 ● Independently programmed a PIC16F1718 microcontroller with various functionalities, including power on/off control, fan regulation, temperature sensing, status LED manipulation, and seamless communicationwiththemaincontrolchip. ● Demonstrated proficiency in programming and configuring the device, achieving strict alignment withtheprojectmanager’srequirementsandmeetingthecompany’srequirements. ChengduJiaodaGuangmangTechnologyCo.,Ltd. Chengdu,China MechanicalDesignIntern 05/2020-08/2020 ● Worked in a team of 3 to develop remote product designs by creating CAD drawings and actively contributingtocollaborativedesigndiscussions. ● Project1:Guangzhou-ZhuhaiIntercityCuihengStationRTU - Optimized the structure of the UPS power supply monitoring cabinet and lamp assembly using SOLIDWORKS and ZWCAD software, resulting in improved product layouts, early delivery, andheightenedcustomersatisfaction. ● Project2:RailwayTractionSubstationAuxiliaryMonitoringSystem - Enhanced the appearance and design of the inspection robot, boosting user acceptance and contributingtobusinessgrowthof5%. ● Project3:YawanHigh-SpeedRailSwitchControlDevice - Optimized the device using SOLIDWORKS and ZWCAD, achieving cost savings through materialandprocessimprovements. ● Project 4: Wuhan-Guangzhou High-Speed Rail Network Switch Remote Control Transformation - Demonstrated efficiency and precision in the on-site design of structural components, ensuring timelyprojectcompletion. ● Project5:ZhuzhouStationRenovation - Streamlined the design process and accelerated project delivery for the renovation project using ZWCADsoftwareforthelow-voltagesubstation’scommunicationscreen. VAPELPowerSupplyTechnologyCo.,Ltd. Shenzhen,China ProductionTestingTechnician 06/2018-12/2018 ● Conducted rigorous hardware and software testing for communicationdevicesanddelivered50+test reports,showcasingproficiencyinproductfunctionality,performance,andsafetyassessments. ● Maintained an optimized testing environment and developed innovative product testing methods, contributingtostreamlinedproductionprocessesandensuring100%issueresolution. ● Exhibited exceptional record-keeping skills, analyzing process conditions during production trial runs, identifying areas for improvement, and offering valuable suggestions to enhance product processes. ● Fostered seamless coordination and communication with over 10 departments, ensuring efficient workflowandsmoothcollaborationtoachieveproductionobjectives. ● Maintained a vigilant approach to monitor production progress, product quality, and efficiency, promptlyidentifyingandresolvinganomalies,thusfacilitatinguninterruptedproductionoperations. SKILLS ● LanguageSkills:English(fluent),MandarinChinese(native) ● ComputerSkills:Python,C++,MATLAB,Arduinocoding,SOLIDWORKS,word,GeomagicWrap, 3DSlicer,GibbsCAM,Creo,MSOfficeSuite"
}