{
    "ID": "937487022",
    "SOP": "Abhudaya Shrivastava From an early age, a profound passion for Computers and Technology began to take root within me. At the tender age of four, I was first introduced to Microsoft Paint through school, and my innate curiosity drove me to explore my initial encounter with a video game, \"Conflict: Desert Storm.\" As I progressed in my academic journey, I acquired valuable knowledge about various computer applications. During my penultimate and final years of schooling, I encountered a significant coding assignment that entailed utilizing NetBeans IDE, the C Programming language, and MYSQL. Drawing upon my creativity and understanding of management and organizational structures, I proposed the topic of an airline booking management system application for my group. This application encompassed numerous features, ranging from facilitating flight bookings on any given day to calculating miles and displaying paths on a globe. Engaging in this project provided me with a fresh perspective on the realm of computer science, enabling me to transcend mere enthusiasm and aspire toward true innovation. Prior to this experience, while my zeal for innovation and research was evident, I lacked the practical knowledge of how to pursue it effectively. However, the two years of my high school education served as a transformative period, opening doors for me to explore and delve into ideas that yield innovative solutions applicable to real-life scenarios. This newfound curiosity urged me to venture beyond the realm of Computers and delve into the scientific principles that underpin them, thereby empowering me to test novel ideas for practical applications. Consequently, at the age of fifteen, I took the decisive step of enrolling at Rutgers University Camden to pursue a ‘degree in Computer Science and Finance. This educational pursuit not only fueled my passion for technology but also paved the way for my future endeavors in the realms of innovation and research. My aspiration is to develop pragmatic solutions to real-world complex systems, thereby making a meaningful contribution to society. During my time at Rutgers University, I was awarded a merit-based scholarship due to an impressive CGPA in high school and SAT score. Throughout my studies, I encountered various challenging yet significant concepts across diverse courses. Additionally, I developed optimized solutions for stack and queue operations. Building on my skills and prior knowledge in Computer Science, I secured internships in Research and Development roles as a Data Scientist and Analyst, which is my career goal. These experiences allowed me to acquire technical and soft skills including but not limited to Advanced Python Programming, Tensor Flow, Geocoding, UI/UX Design, Tableau, ETL pipeline deployment, Apache Airflow, MYSQL Workbench, Microsoft SQL Server, Leadership, Teamwork, Optimization. While facing novel Abhudaya Shrivastava challenges. Daily, I worked with extensive datasets and prepared them for analysis and deploying AI engines. I am particularly proud of two internship projects. Firstly, I enhanced a navigation system by creating a data mining algorithm to transform data into a readable format, incorporating geocoding for precise location information. Secondly, I collaborated with the Road Transport Authority of Dubai to automate the Transit Line Monitoring System. I deployed a neural network-based machine learning model for a complex system to detect transit disruptions, and overcoming data formatting challenges through research and perseverance. While I worked my way up with professional experience, I remained steadfast in my goal to innovate using Computer Science concepts for the betterment of society and the future. This led me to delve into research, with a particular fascination for Artificial Intelligence (AI). Determined to contribute, I wrote my first paper, \"Using Deep Learning and Machine Learning in Space Network,\" published by IEEE at a conference in Abu Dhabi, U.A.E. The paper explores Transfer and Data Relay Systems (TDRS), which transmit space data from rovers and telescopic satellites. I employed neural network models: Data Belief Network for probabilistic reasoning in decision-making for rovers and satellites, and Restricted Boltzmann Machine for feature learning and generative modeling based on data from satellites and rovers. The RBM also supports the DBN in decision-making with feature learning and planetary object analysis. My interest in research deepened, leading to my recent IEEE paper, \"Security Analysis for Threats to Patient Data in the Medical Internet of Things\". It addresses the security of Medical IoT, used for multiple applications to record and transmit data all over the hospital network. To counter security threats, I proposed implementing Transport Layer Security, Virtual Private Networks, and Cryptography for data transmission. Additionally, I suggested using neural networks for daily encryption updates and traffic analysis. Through contributions in the field of research and innovation, I aim to advance in AI and its applications by contributing as Data Scientist and/or Machine Learning technology evangelist. Based on my prior experiences, I am aware of the path I wish to pursue. Seeking mentorship and guidance, I am determined to embark on a Ph.D. journey in Computer Science, focusing on Artificial Intelligence and its Applications. During my junior year of Undergrad, I explored some of very prestigious universities which offers unique research opportunities. I found the Columbia University courses and research opportunities Abhudaya Shrivastava in Artificial Intelligence, Machine learning, and Security & Privacy to capture my interest, especially the ongoing projects in different labs and multiple publications across labs via faculties. Their brief description of projects and admiration towards many publications in the above three fields resonated with my desired knowledge and skill development. Confident in my decision, I believe Columbia University offers the best academic environment for my aspirations. With mentorship and the comprehensive course offerings, I am optimistic about making significant contributions to the fields of Artificial Intelligence, Machine Learning and Security & Privacy pursuing my Ph.D. in Computer Science.",
    "Resume": "Shrivastava, Abhudaya; DOB: 11/06/2002; ID: 937487022 917-774-1358 | abhudaya.shrivastava@outlook.com | linkedin.com/in/abhudaya-shrivastava-a085711b2 | github.com/debugged-abh TECHNICAL SKILLS Languages: Python, MySQL, C, JavaScript, HTML/CSS. Framework/Libraries: Apache Spark, Pandas, Matplotlib, Plotly, TensorFlow, Keras, PyTorch, and Scikit-learn, NumPy, Scipy, GeoPy. Developer Tools: Git, Github, PyCharm Professional, Jenkins, Jupyter Notebook, NET Beans IDE, Visual Studio Code. Business Intelligence and Analytics Tools: Power BI, MicroStrategy Workstation, Tableau. Workflow management platform/ETL Pipeline Tools: Apache Airflow, Jira, Confluence. Database Management System: MySQL, MangoDB. Web Based: Microsoft SharePoint Big Data Platform: Amazon EMR, Amazon S3. API: Rest API, Google Geocoding API. Soft Skills: Team Player, Time Management, Communication, Project Management, Client Management, Adaptable. EXPERIENCE Quantitative Analyst September 2022 - Present NJEDA Camden, NJ • Automated Geo Coding of local businesses by Machine Learning algorithm for data extraction from Excel, and Google Geocoding API in Python using Pandas and GeoPy library for Geocoding/analysis. • Using dimensional modeling techniques to develop concise data analytical reports on quarterly funds allotted to companies using MySQL with Tableau to visualize data, and SharePoint CRM for data extraction. • Created quarterly financial forecasting system using MLP neural network and MySQL to support financial decision-making. • Implemented and preserved documentation techniques that improved team efficiency by 30% and enabled faster troubleshooting and resolution using Excel. Skills: Geocoding, Machine Learning, Excel, Data extraction, Google Geocoding API, Python, Pandas, Geopy, MySQL, Tableau, MLP neural network, Sharepoint CRM . Software Engineer September 2021 – September 2022 Rutgers University Camden, NJ • Designed and implemented the Learning Management System (LMS) for staff and students. • Formulated algorithm for issuing book from library which automatically updates libraries records backend data using Python, Apache spark, and MySQL. • Python–Jira integration using Rest API for web services/applications. • Developed and updated user signup interfaces and processes for users with Node.js and Angular. Skills: Jira, , Rest API, Python, Node.js, Angular, LMS, Python, Apache Spark, MySQL. Data Science, Intern January 2021 – September 2021 Fetchr Dubai, U.A.E • Modeled data manipulation techniques, and analysis concepts to build algorithms for complex logistic delivery systems. • Devised ETL pipeline using Python, Apache Spark, and Apache Airflow for Fetchr’s ERP system. Created Data Mining algorithms in Python and Apache Spark using Amazon EMR job flow to store data in Amazon S3. • Designed and implemented Machine Learning models in Python using Pandas, GeoPy, Scikit-Learn, and Keras to automatize extraction and plotting the location of clients for Navigation enhancement and monitored model deployment using Jira. Skills: ETL, Python, Apache Spark & airflow, ERP systems, Python, Amazon EMR & S3, Keras, Scikit-learn, GeoPy, Jira. Davidson.group Dubai, U.A.E • Collaborated with UX Styling business partners to prototype and develop solutions for the problems at hand. • Implemented AI concepts in Python using Matplotlib and Plotly for feature visualization, PyTorch, and Keras to develop machine learning model for Road Transport Authority Dubai’s transit system. • Formulated data mining models in Microstartegy workstation for wide-ranged native analytics and utilized MangoDB for database management. Skills: UX styling, Python, Plotly, PyTorch, Keras, Microstrategy Workstation, MangoDB. EDUCATION Rutgers University Camden, NJ Bachelors in Sciences (Honors) in Computer Science, CGPA: 3.581/4.0 September 2019- May 2023 Rutgers University Camden, NJ Cyber Security Affiliation September 2019- May 2023 Certifications Camden, NJ Bloomberg Market Concepts (BMC), Palo Alto Networks: Firewall 9.1 Essentials, IBM: Python for Data Science. PUBLICATIONS IEEE December 2022 11th SMART Conference Moradabad, India • A.S. Rajawat et al., \"Security Analysis for Threats to Patient Data in the Medical Internet of Things,\" 2022 11th International Conference on System Modeling & Advancement in Research Trends (SMART), Moradabad, India, 2022, pp. 248-253, doi: 10.1109/SMART55829.2022.10047322. IEEE November 2020 7th ITT Conference Abu Dhabi, U.A.E • A. Shrivastava and D. P. Shrivastava, \"Using Deep Learning And Machine Learning In Space Network,\" 2020 Seventh International Conference on Information Technology Trends (ITT), Abu Dhabi, United Arab Emirates, 2020, pp. 83- 88, doi: 10.1109/ITT51279.2020.9320781. RESEARCH EXPERIENCE Researcher July 2023-Present Rutgers University Camden, NJ • Correlating indicators to be used when investing in multiple market indexes against volatility index/VIX. • Identifying how volatility index/VIX affects market bullish and bearish trends. • Testing and implementing different RNN models in Python and using live volatility index/VIX trend to forecast market trends. • Analyzing the predictability and accuracy of different models for the best selection of model to forecast the trend. Undergraduate Researcher January 2021-June 2021 Rutgers University, supervised by Dr. Guy Kortsarz Camden, NJ • Implemented Design and Analysis of Algorithm concepts to formulate and design stack and queue related solutions for complex problems using C language. • Suggested alternative time complexities for stack and queue operations aiming to complete operations efficiently. • Achieved efficacy in creating stack and queue algorithm with O(1) time complexity. Toxicity Classifier September 2023 https://github.com/debugged-abh/LSTM_Toxicity_Classifier • Correlating indicators to be used when investing in multiple market indexes against volatility index/VIX. • Indentifying how volatility index/VIX affects market bullish and bearish trends. • Testing and implementing different RNN models in Python and using live volatility index/VIX trend to forecast market trends. • Analyzing the predictability and accuracy of different models for the best selection of model to forecast the trend. Skills: UX styling, Python, Plotly, PyTorch, Keras, Microstrategy Workstation, MangoDB. Consumer Price Index (CPI) Forecast May 2023 https://github.com/debugged-abh/CPI-Forecasting • Used data extraction techniques on U.S Bureau of Labor Statistics to obtain training Consumer Price Index data for machine learning model. • Researched different neural networks to train model, and reaching LSTM-RNN model as most ideal neural network. • Created LSTM model and trained the model using data extracted in Jupyter Notebook using Python, Pandas, Numpy, Scikit-learn, and Keras for data visualization and machine learning model development. • Forecasted the CPI value till November 2023 using LSTM model with high accuracy of 88% and recall percentage. • Formulated Tableau dashboard for better story telling of the forecast and forecasting methods using LSTM-RNN. Skills: Machine learning, Python, Pandas, Numpy, Scikit-learn, Keras, Jupyter Notebook, LSTM- RNN, Tableau. S&P 500 Trend Predictor January 2023 https://github.com/debugged-abh/Stock-Prediction • Implemented Yahoo Finance API in Python on Jupyter Notebook for S&P500 live data extraction. • Studied data extracted for the years 20202, 2021, and 2022 to identify seasonal and non-seasonal trends using Pandas, Seaborne to visualize data and data slicing techniques in Python. • Testing and comparing different statistical techniques under Numpy and Scikit-learn to optimize running time of the machine learning model through Tensorflow and Keras in Python. • Forecasted a week of S&P500 market trend into the future with an accuracy of 83%. Skills: Python, Numpy, Tensorflow, Keras, Scikit-learn, Jupyter Notebook, Yahoo Finance API, Pandas, Seaborne. Automated Aircraft Selector November 2022 https://github.com/debugged-abh/Stock-Prediction • Developed a GUI application using Python, Tkinter, Pandas, Numpy, and Object-Oriented Programming. • Committed web scrapping of data from Boeing and Airbus of commercial aircrafts. • Created an algorithm in Python using OOP and data structures from scratch to recommend aircraft based on the factors of distance between origin and destination, cruising speed requested by the airlines, and fuel to be used as per the airline’s regulations. • Ran multiple test cases to detect bugs and windows of improvement in the application. Skills: GUI development, Tkinter, Web scrapping, Python, Object Oriented Programing (OOP), Data structures, Pandas, and Numpy."
}