{
    "ID": "670921615",
    "SOP": "PERSONAL STATEMENT | ADEDEJI S ADEDIRAN PERSONAL STATEMENT Adedeji Adediran's aspiration to embark on a journey towards a combined M.S./Ph.D. program in Computer Science at Columbia University is deeply rooted in his unwavering ardor for technology and his unshakable belief in the transformative potential of education and research. His upbringing in a remote region of Nigeria, where opportunities for advancement were limited, instilled in him vital qualities such as resilience, adaptability, and resourcefulness, all of which are pivotal for success in this demanding program. These attributes have empowered him to surmount obstacles and devise innovative solutions, a testament to his innate ingenuity. Adedeji's personal odyssey has cultivated his unwavering determination to harness computer science as a catalyst for global progress. His formative years exposed him to the potential of technology as a driver of positive change. Motivated by futuristic portrayals of advanced technology in cinema, Adedeji recognizes the immense possibilities that computer science holds for driving societal transformation. This inspiration fueled his unwavering commitment to pursuing a career in the field. A pivotal turning point in Adedeji's educational journey occurred when he enrolled in the computer science program with an economics focus at Obafemi Awolowo University (OAU). At OAU, he was granted the opportunity to delve into the practical applications of artificial intelligence, particularly evident in courses like \"Introduction to Artificial Intelligence.\" One particularly notable class project involved the modeling of ant movement using Python, offering invaluable insights into replicating natural mechanisms through programming. This experience further ignited Adedeji's inspiration as he realized the potential for similar principles to be employed in developing innovative solutions, such as sensor-driven robotic vacuums. Adedeji's ability to bridge the gap between theoretical PERSONAL STATEMENT ADEDEJI S ADEDIRAN PERSONAL STATEMENT | ADEDEJI S ADEDIRAN knowledge and practical application underscores his aptitude for connecting research with problem-solving. Throughout this program, Adedeji's central focus will be on the captivating realm of artificial intelligence as it intersects with advanced statistical methodologies, holding immense promise for addressing multifaceted challenges, reshaping industries, and fostering innovation. Post-program, Adedeji's primary mission will be to advance the field through academic instruction and cutting-edge research. With fervent enthusiasm, he anticipates actively contributing to ongoing research initiatives, engaging in advanced coursework, and harnessing Columbia's state-of-the-art research infrastructure and collaborative milieu to deepen his mastery of these transformative disciplines. His aspirations encompass unraveling the intricacies of deep learning, perception, and manipulation, while innovating novel statistical algorithms within the sphere of artificial intelligence. Adedeji envisions spearheading foundational research in artificial intelligence with a specific emphasis on the core facets of social interaction within AI systems, including perception and manipulation. Recent studies by Li et al. (2022) and Ma and Xiao (2023) underscore the evolving landscape of social interactions, extending from human-human interactions to human-robot interactions. While the latter falls under the domain of artificial intelligence, the central challenge extends beyond imparting speech to robots – it lies in fostering a profound understanding of meanings and the intricate nuances of our real-world milieu (Bamdale et al., 2019). Andronie et al. (2022) affirm that robots leverage perception technologies, deep learning frameworks, and integrated sensory data to engage in social interactions. Additionally, Huang et al. (2022) emphasize the significance of training robots using extensive datasets to formulate adaptable algorithms for effective human-robot interactions. PERSONAL STATEMENT ADEDEJI S ADEDIRAN PERSONAL STATEMENT | ADEDEJI S ADEDIRAN In addressing the variance in perception and manipulation that influences social interactions among robots, the recommendations set forth by Li et al. (2022) and Shah et al. (2022) illuminate the path for future exploration in human-robot interaction. Adedeji envisions collaborating with diverse cohorts at Columbia to scrutinize these variations. Drawing upon the insights of Łukasik et al. (2021), he aspires to forge or collaborate with interdisciplinary research collectives to undertake comprehensive studies on human-robot interactions. Backed by a profound comprehension of big data technologies, fundamental principles of computer science, and advanced statistical methodologies, Adedeji is resolute in his capacity to lead teams and catalyze transformative initiatives within the realm of social interactions within artificial intelligence. Furthermore, Adedeji acknowledges the power of diverse perspectives in driving innovation and fostering a just community. He is acutely aware of the underrepresentation of marginalized groups within the tech sphere and often assumes the role of the sole African- American contributor, infusing teams with a much-needed diverse viewpoint. Adedeji passionately asserts that Columbia's comprehensive approach and concerted efforts to enhance diversity within its academic ranks are instrumental in shaping a technologically advanced world that is socially conscientious. In addition, he champions the development of AI solutions that prioritize inclusivity. Currently, Adedeji occupies a prominent role at Visa, where he voluntarily serves as a Diversity, Equity, and Inclusion pillar lead. Since joining the company, he has actively collaborated with senior leadership to establish processes and procedures that promote a more inclusive work environment. One notable initiative involved working with multiple stakeholders to create a bi-annual training module aimed at raising awareness among Visa employees about the importance of inclusion in the hiring process. The implementation of this module has resulted in substantial changes in Visa's hiring practices, with employee PERSONAL STATEMENT ADEDEJI S ADEDIRAN PERSONAL STATEMENT | ADEDEJI S ADEDIRAN engagement surveys indicating increased awareness among Visa employees regarding potential biases during the hiring process. Adedeji's alignment with Columbia University's values and objectives, emphasizing academic excellence and intellectual inquiry, positions him to contribute significantly to computer science research. His belief in the transformative potential of artificial intelligence aligns with Columbia's mission to bridge societal divides. Adedeji is eager to leverage the university's innovative environment, dedication to public service, and extensive resources to develop AI solutions with a global impact, fostering positive changes in local and global communities. In essence, Adedeji Adediran's pursuit of a combined M.S./Ph.D. in Computer Science at Columbia University signifies the convergence of personal passion, educational growth, and professional experience, all driven by a vision to leverage technology for societal improvement. His dedication to AI research aims to enrich Columbia's intellectual community and develop globally impactful solutions. Adedeji's choice is propelled by his profound passion for technology, commitment to global betterment, and unwavering dedication to diversity, inclusion, and social responsibility, aligning seamlessly with Columbia's values. PERSONAL STATEMENT ADEDEJI S ADEDIRAN PERSONAL STATEMENT | ADEDEJI S ADEDIRAN REFERENCES Andronie, M., Lăzăroiu, G., Karabolevski, O., Ștefănescu, R., Hurloiu, I., Dijmărescu, A., & Dijmărescu, I. (2022). Remote Big Data Management Tools, Sensing and Computing Technologies, and Visual Perception and Environment Mapping Algorithms in the Internet of Robotic Things. Electronics, 12(22), 22. https://doi-org.lopes.idm.oclc.org/ 10.3390/electronics12010022 Bamdale, R., Sahay, S., & Khandekar, V. (2019). Natural Human Robot Interaction Using Artificial Intelligence: A Survey. In 2019 9th Annual Information Technology, Electromechanical Engineering and Microelectronics Conference (IEMECON), 297- 302. Jaipur, India. doi:10.1109/IEMECONX.2019.8877044. Huang, J., Shen, S., Zhou, Z., Zhang, P., & Fan, K. (2022). Discriminative distribution alignment for domain adaptive object detection. Neurocomputing, 474, 48–59. https:// doi-org.lopes.idm.oclc.org/10.1016/j.neucom.2021.12.009 Krishna, S., & Sidharth, S. (2022). Analyzing Employee Attrition Using Machine Learning: The New AI Approach. In Proceedings of the 2022 IEEE 7th International Conference for Convergence in Technology (I2CT), 1-14. doi:10.1109/I2CT54291.2022.9825342. Li, Z., Terfurth, L., Woller, J. P., & Wiese, E. (2022). Mind the Machines: Applying Implicit Measures of Mind Perception to Social Robotics. 2022 17th ACM/IEEE International Conference on Human-Robot Interaction (HRI), Human-Robot Interaction (HRI), 2022 17th ACM/IEEE International Conference On, 236–245. https://doi- org.lopes.idm.oclc.org/10.1109/HRI53351.2022.9889356 Łukasik, S., Tobis, S., Suwalska, J., Łojko, D., Napierała, M., Proch, M., Neumann- Podczaska, A., & Suwalska, A. (2021). The Role of Socially Assistive Robots in the Care of Older People: To Assist in Cognitive Training, to Remind or to Accompany? PERSONAL STATEMENT ADEDEJI S ADEDIRAN PERSONAL STATEMENT | ADEDEJI S ADEDIRAN Sustainability, 13(10394), 10394. https://doi-org.lopes.idm.oclc.org/10.3390/su131810394 Ma, Z., & Xiao, J. (2023). Robotic Perception-Motion Synergy for Novel Rope Wrapping Tasks. IEEE Robotics and Automation Letters, Robotics and Automation Letters, IEEE, IEEE Robot. Autom. Lett, 8(7), 4131–4138. https://doi-org.lopes.idm.oclc.org/10.1109/LRA.2023.3280808 Shah, D., Sridhar, A.K., Bhorkar, A., Hirose, N., & Levine, S. (2022). GNM: A General Navigation Model to Drive Any Robot. 2023 IEEE International Conference on Robotics and Automation (ICRA), 7226-7233. PERSONAL STATEMENT ADEDEJI S ADEDIRAN",
    "Resume": "ADEDEJI ADEDIRAN (DJ) Hayward, CA | aadediran2010@gmail.com | (415) 936-3622| https://www.linkedin.com/in/aadediran2010/ Bringing over 8 years of professional expertise in analytics and management, coupled with a proven ability to think analytically, collect, and analyze data to initiate world-class AI solutions that drive impactful outcomes. EDUCATION 2018 Master of Business Administration (MBA) Texas A&M University-Commerce 2015 B.Sc. Computer Science/Economics Obafemi Awolowo University WORK & LEADERSHIP EXPERIENCE Program Manager, Global Sales Operations and Analytics Visa Inc. ❏ Define and implement automated executive reporting solutions, measuring key performance indicators (KPIs), providing comprehensive pipeline and product reviews, and supporting sales planning. ❏ Lead and manage a team of data analysts, data scientists, and business intelligence professionals, providing guidance, mentorship, and career growth opportunities. San Nov 2019 – ❏ Oversee the creation of tailored monthly reports and interactive dashboards using tools like PowerBI, Francisco, Present Tableau, and PowerPoint, enabling executives to make informed business decisions based on data-driven CA (USA) insights. ❏ Ensure data governance and quality standards are implemented and continuously improved, maintaining the integrity and reliability of analytics outputs. ❏ Drive the adoption and utilization of advanced analytics techniques, including machine learning algorithms, to develop innovative solutions addressing complex business challenges and driving 23% revenue growth. ❏ Stay updated with industry trends, emerging technologies, and best practices in analytics to recommend advancements that enhance the organization's analytics capabilities. Sales Strategy & Operations Analyst Google ❏ Collaborated with program managers to generate valuable business insights, drive process improvement, and formulate effective strategies using Google Doc, Google Sheets, and Plx Dashboards. Redwood Jan 2019 – ❏ Designed and implemented data pipelines and monitoring systems to track key performance indicators City, CA Oct 2019 (KPIs) at the business and representative levels, resulting in a notable 7% quarter-over-quarter increase in (USA) pitch rate. ❏ Provided leadership in project management and successfully managed global projects, resulting in significant time and resource savings of 40 hours per vendor headcount within the program. ❏ Recommended, developed, tracked, and reported performance metrics using PLX dashboard, Trix, and Google Doc, ensuring accurate measurement and evaluation of business performance. Data Analyst & Business Consultant Xerox ❏ Partnered with cross-functional stakeholders to identify and define strategic business issues that required Jun 2015 – Lagos analysis. Jul 2017 (Nigeria) ❏ Synthesized and consolidated findings and recommendations into concise and visually compelling presentations using Excel and PowerPoint. ❏ Utilized A/B testing techniques with Optimizely to enhance customer engagement and achieve a notable 12% increase in sales conversion rate. Lecturer Hassan Usman Katsina Polytechnic ❏ Developed and delivered engaging lectures on various computer science topics, including programming Apr 2016 – Katsina languages like Python, R, and Excel. Mar 2017 (Nigeria) ❏ Prepared and implemented lesson plans, assignments, and assessments to evaluate student learning and progress. ❏ Fostered an inclusive and supportive classroom environment that encourages active participation and collaboration. SKILLS SQL/VQL/DremelSQL Communication/PowerPoint Salesforce/Dynamics Machine Learning Alg./ Python/R Data Analysis/Research Business Intelligence/Excel Data Visualization/Tableau/Power BI Google Sheets/Doc/Slide Google SQL/Plx/Hue/Hive/Hadoop PROFESSIONAL QUALIFICATIONS Massachusetts Institute of Technology June 2017 Machine Learning for Big Data and Text Processing (MIT)"
}