{
    "ID": "819282904",
    "SOP": "MohammedSazzadYousufSourab Personal Statement I have been wowed by the compactness of electronic equipment and gadgets like handheld mobile phones or media players since I was a child. I used to wonder how a small device the size of a human palm can perform so many tasks. I think sincethen,somewhereinthebackofmymind,Ialwayswanted to study a subject that would make me one of those brilliant minds who are involved in the design and development of electronic equipment and programming them. Later in high school, I showed aptitude in math and science, especiallyphysics.Soitisnoaccidentthatin2017whenIgotmyselfadmittedintothe country's top technological institution,ChittagongUniversityofEngineeringandTechnology(CUET),after clearing arguably the toughest entrance exam in the country with flying colors, I chose to study ElectronicsandTelecommunicationEngineering. I was born and raised in an urban environment where I sawtechnologicaladvancementsandtheimpact of technology and devices. I was thrilled while using the devices and thought of developingthoseonmy own. I was making a dream while I understood that choosing Engineering as an academic career could lead me to pursue my goal of becoming a developer of technologies that change the world.Whiledoing myundergraduateIcametoknowthatdoingPh.D.researchcangivemetheopportunitytodowhatIwas dreamingaboutfrommychildhood. During my four years of undergraduate studies, I have had the privilege to be introduced to someofthe most captivating topics of electronics and telecommunication engineering to my heart's content, that too by the best academicians and research figures of the country. I discovered my interest in Computer Programming later it turned into a fascination with Artificial Intelligence and Computer vision. First I started with the course named “Project Design and Development” whereIusedMATLABtodoanImage Processing project named “Vehicle Licence Plate Detection and Recognition using MSER Algorithm”. This created my firm interest in Computer Vision and later I discovered that Artificial Intelligence playsa vital role in Computer Vision and ended up doing my undergraduate research thesis in combination of Deep Learning and Machine Learning. I find fascinationinworkingwithBiomedicalImagedataforimage diagnosis purposes. My grades in related courses like Neural and Fuzzy in Communication and Project MohammedSazzadYousufSourab MohammedSazzadYousufSourab and Thesis all are A+ which goes to demonstrate my strong grip in Computer vision and Artificial Intelligence. Undoubtedly the most memorable part ofmyUGstudieswasthe4.75credit-hourthesisdonethroughout my senior year. This is when Ifirstgotintoresearchandseriouslystartedtoconsideraresearchcareer.I used my course knowledge and also I invested a lot of time in learning the basic topics in Machine learning and Deep Learning are cost function, backpropagation, multilevel perceptrons, convolutional neural network layers, activation functions, classification functions, loss function, regularization, feature extraction, overfitting and underfitting problems andtheirsolutions,differentmachinelearningalgorithms, and their learning procedures. I liked to work with Tensorflow and Keras whichledmetogetexpertisein Python and R language. Under the guidance of my undergraduate thesis supervisor, I started reading high-quality research papers understanding their methodologies, and learned to implement them in my thesis work. I aimed to develop a highly accurate classification and diagnosis method for Pneumonia using the Chest Radiogram dataset. The main challenge in this type of work in biomedicaliswehaveto maintain higher accuracy than any other research because the research is directly related to human health.plasmonics.UndertheguidanceofmyUGthesissupervisor,Istartedmyresearchinamethodical way. We decided on a topic at our firstmeetingwhichwasrelatedtobiomedicalimages,especiallychest radiograms. The performance of my research output was comparable with otherexistingrelatedworks.I was awarded an A+ formythesiswork.Iinitiallystruggledalotwiththecomplexityofthesimulationwork but overcame it by diligently studying. I also published a Journal Article before my thesis was defended andtheJournalwasatop-rankedone.Thoughthepublishedarticlerepresentsonlyaportionofmythesis work. The article is named, \"A comparison of hybrid deeplearningmodelsforpneumoniadiagnosisfrom chest radiograms.\", published in Sensors International journal in Volume 3. I believe it is just the beginning and I look forward to producing more high-quality publications in my career. My thesis was a journey full of ups and downs, lots of adrenalinerushes,momentsofeuphoriaandfrustration.Ilovedthe rollercoasterrideandsomewhereinthemiddleofitIdecidedIwantedtobearesearchpersoninmylife. MohammedSazzadYousufSourab MohammedSazzadYousufSourab In addition to academics, I was also involved with several volunteerorganizations.Ihadbeenservingas a President of “CUET Photographic Society” and with several other organizations. I have gained responsibilityandworkedwithateamwhileservingtheorganization. After graduating from CUET, IstartedworkinginaGlobalTechgiantcompany“HuaweiTechnologiesLtd” where I worked as Cloud Solution Architect for a few days and learned a lot about how enterprisesare using Cloud for their Enterprise Resource Planning (ERP) and learned to migrate cloud data from one cloud infrastructure to other. Later I joined a renowned Private university in Bangladesh named“Daffodil International University” as a Lecturer in the Department of Electronics and Telecommunication Engineering. I was thrilled to start this job because this hascreatedscopeformetoinvestmytimemore in research and academy work. Working with my students on my research topic issuchapleasantjob.I am also supervising three undergraduate students. I intend to worktillthisFall2023semesterandlaterI want to start my dream which is doing a Ph.D. at a higher-ranked university like Columbia University (Graduate Engineering). The Engineering Graduate Program of this university has a large number of faculties doing research in almost all aspects of Engineering and there areampleopportunitiesfordoing researchwithindustries.That’swhatamazedmethemostaboutthisUniversity. Columbia University (Graduate Engineering) has active research groups working on the areas that enthrall me most. I’ve applied for a Ph.D. program in Computer Science at this university under the supervision of Professors who have a wide range of wisdom. After obtaining the Ph.D., my plan is to complete a post-doctorate to be more specialized in the specific research area, and then join academia asaprofessorbecauseitistherightplaceformetocontinueresearch. Finally, I know there will be hurdles while pursuing a PhD. Still, I am confident enough to managethose through my endurance, resilience, critical thinking fast learning skills, andexperiencesifIgetthechance to start my graduate study at Columbia University in Spring/Fall 2024 with the financial support of GraduateAssistantshiporFunding. MohammedSazzadYousufSourab",
    "Resume": "Mohammed Sazzad Yousuf Sourab 244/3, BanarupaLink Road, Boatghat, Namapara, Khilkhet,Dhaka-1229. Email: sazzad.yousuf8311@gmail.com Cell: +8801770249282 Ph.D Applicant for Fall 2024 EDUCATION Chittagong University of Engineering & Technology (CUET), Chittagong, Bangladesh. Bachelor of Science (B.Sc) in Electronics and Telecommunication Engineering (Feb ’17-Apr ’22) CGPA: 3.71 out of 4.00 (3.94 on last 60 Credit) Masters of Science (M.Sc) in Electronics and Telecommunication Engineering (Aug ’22-Present) CGPA: 3.92 out of 4.00 (18 Credit Completed) (Ongoing) STANDARDIZED TEST SCORES • IELTS: 7.5 (Listening: 8, Reading: 8, Speaking: 7, Writing: 6.5) RESEARCH INTERESTS AI | Deep Learning | Machine Learning | Computer Vision | Image Processing RESEARCH EXPERIENCE • B.Sc. Thesis: “A Comparative Analysis of Hybrid Deep Learning Models for Diagnosis of PneumoniafromChestRadiograms”,SupervisedbyMd.AhasanKabir,AssistantProfessor, DepartmentofETE,CUET.  Diagnosed Pneumonia Chest Radiogram images from Mendeley Dataset V2 using both traditional CNN and Depthwise-Separable CNN models and extracted high level features andfedintodifferentmachinelearningalgorithmsandthencomparisonisshown.  Findings: Reduced parameters using DS-CNN than traditional CNN | High level extracted featuresinMLmodelsgivebetteraccuracythanSigmoidclassifierinCNN| RandomForest ClassifierworksbetterthanotherMLclassifiersused PUBLICATIONS  Journal Articles 1. Sourab, Sazzad Yousuf, and Md Ahsan Kabir. \"A comparison of hybrid deep learning models for pneumonia diagnosis from chest radiograms.\" Sensors International(2022):100167.  Conference Papers 1. S. Y. Sourab, H. R. Shuvo, R. Hasan and T. Masruf, \"Diagnosis of COVID-19 from Chest X-Ray Images Using Convolutional Neural Networking with K-Fold Cross Validation,\" 2021 IEEE International Power and Renewable Energy Conference (IPRECON),2021,pp.1-5,doi:10.1109/IPRECON52453.2021.9640744. PROFESSIONAL EXPERIENCE • Daffodil International University, Dhaka, Bangladesh Lecturer, Department of Electronics and Telecommunication Engineering August 2022 –Present • Huawei Technologies Ltd. Bangladesh Solution Architect (Cloud) June 2022 –August 2022 COURSES DESIGNED AND TAUGHT • NumericalAnalysis–Fall’22,Spring’23,Fall’23 • RenewableEnergyTechnology--Fall’22 • BasicElectrical&ElectronicsEngineering –Fall’22 • OpticalFiberCommunication–Spring’23 • SignalandCommunicationSystemEngineering –Spring’23 • DigitalSignalProcessing–Spring‘23,Fall‘23 • ElectricalCircuit–Fall’23 • ElectronicDevice&Circuit–Fall’23 • Engineering Mathematics–Fall’23 • ComputerNetworks–Spring’23 RELEVANT COURSEWORK • Undergraduate Courses: Basic EEE | Basic EEE Laboratory | Digital Communication Laboratory | Digital Signal Processing Laboratory | Electronic Device and Circuits Laboratory | Engineering Mathematics | Numerical Analysis | Numerical Analysis Laboratory | Renewable Energy Technology | Signals and Communication Systems Laboratory UNDERGRADUATE PROJECTS • Automatic Street Light Detecting Vehicle Movement • Automatic License Plate Detection using MSER algorithm and Stroke Width Variation • Ecommerce Website with Database connected • PSK Modulation Circuit • Sequential Blinking light using Microcontroller • FM Radio Transmitter and Receiver TECHNICAL SKILLS • Device Simulator –MATLAB & Simulink, Proteus, 8086 Emulator, Multisim, Ultiboard, Cadence, Git, Google Colab, WATS 2000, Cisco Packet Tracer, CST Studio • Programming Languages –C/C++, Python, Assembly Language (8086), Java, JavaScript, HTML, CSS, PHP, MySQL • Document Preparation & Illustration–MS Office 365, Adobe Photoshop, Adobe XD, Adobe Premiere Pro AWARDS AND SCHOLARSHIPS • Government Merit Scholarship Awarded by Ministry of Education, Bangladesh. 2011, 2016 • Best Idea Award Big Data & Machine Learning workshop (BDML 2020) Organized by Department of CSE, CUET. • Champion Informatics Olympiad 10th Dhaka Residential Model College National Science Fair (DRMCNSF) -2016 • Gold Award 1st International Poster Competition Achieving Sustainable Development Goals (SDGs) in Developing Countries -2021 • Best Motion Maker 13th Inter Department Debate Competition, CUET. ACADEMIC & PRODESSIONAL TRAINING • Total 4 days (32 hours) long training on Digital Forensics & Magnet Axiom Tools from SheikhKamalITIncubator,BangladeshHi-TechParkAuthority • TrainingonCCNAExploration-1fromIICT,CUET • EthicalHackingfromEduonix • LinkedInlearningonMachineLearningandAIFoundations • LinkedInlearningonNeuralNetworksandCNNEssentialTraining LEADERSHIP AND SYNERGISTIC ACTIVITIES • President CUET Photographic Society (CUET PS) March 2021 –June 2022 • Photographic Secretary CUET Debating Society (CUET DS) February 2021 –June 2022 • Photographic Secretary Robo-Mechatronics Association (RMA) January 2021 –June 2022 • Student Ambassador Bangladesh Model United Nations (BANMUN) in Association with UNYSAB (2016) REFERENCES • Prof. Dr. Md. Azad Hossain Head of the Department of Electronics & Telecommunication Engineering (ETE) Chittagong University of Engineering & Technology Contact no: 01783756981, Email: azad@cuet.ac.bd • Prof. Dr. Mohammad MizanurRahman Department of Mechanical Engineering (ME) Chittagong University of Engineering & Technology Contact no: 01864800089, Email: mmrahman_me@cuet.ac.bd"
}