{
    "ID": "504448712",
    "SOP": "Personal Statement Yue Jiao During my childhood, I experienced an assault that left me blind for several months. Remarkably, despite my pupils losing function, medical treatments gradually restored my vision to normal. During moments of fatigue over the years, I draw strength from the vivid memory of that pivotal morning when I sensed faint light filtering through layers of gauze and dried blood. These moments empower me to find hope after setbacks. This early trauma also ignited a profound curiosity and fascination for the potential of medicine. As I matured, I recognized that this event was not just a miracle but the result of the tireless efforts of countless scientists over many years. My goal is to extend this \"miracle\" and offer hope to others, utilizing my skills and passions to create a positive impact. I firmly believe that my passion and determination will serve as enduring motivators in this field. After years of studying biochemistry and engineering, I've come to understand the extensive research required to realize my aspirations. Hence, I am eager to advance my education by pursuing a Ph.D. at Columbia University. My academic journey at Columbia University and the University of California, Irvine, has provided a robust foundation in chemical biology and computational chemistry. During my undergraduate years, as public concern regarding COVID-19 peaked, I felt compelled to delve deeper into the subject. In the fall of 2021, I conducted intensive research on the 'Effects of the Inhibitor Molnupiravir on Viral RNA Polymerase and the Regulation of RNA Synthesis Fidelity in SARS-COV-2'. To achieve this, I employed molecular dynamics simulations and modeling tools such as ATOM, Avogadro, Xquartz, and VMD to identify altered protein positions on the virus following polymerase inhibitor attachment. I focused on Molnupiravir, a potential COVID-19 drug classified as a polymerase inhibitor. This journey, particularly in the field of 3D molecular dynamic simulations and code functionalities, led me to uncover previously undiscovered structural changes upon activation. Through partial charge calculations, I identified four mutated protein positions. This discovery, combined with successful molecule simulations, significantly enhanced my programming skills for intricate data calculations and refined my analytical expertise in biochemical polymer simulations. This computational and modeling prowess is crucial for advancing biomaterial and drug design simulations and tailoring materials to specific therapeutic requirements. During my undergraduate studies, my research on covid polymerase inhibitors was primarily computer-oriented. I would like to gain a deeper understanding of the entire research process in the wet lab. Therefore, at Columbia University, I became part of the COVID-19 Therapeutic Development project under the guidance of Professor Jingyu Ju in his lab. I've been immersed in and focused on inhibiting SARS-CoV-2 exonuclease polymerase using ombitasvir which is another strong potential antiviral drug for covid virus. Specifically, my role centered on doing chemistry synthesis of analogs of ombitasvir and testing their efficiency, with a keen emphasis on exploring exonuclease inhibitors. My responsibilities spanned from setting up enzymatic assays and purifying RNA to employing MALDI for analysis. A particularly enriching aspect of this experience was my involvement in enzyme kinetic calculations, allowing me to discern the type of enzyme inhibition and pinpoint how to find the target insert position pivotal for drug stimulation. Additionally, I broadened my expertise by venturing into organic chemical synthesis. This hands- on experience underscored the intricate relationship between molecular biology, organic chemistry, and pharmacology. This period equipped me with expertise in chemical synthesis of drugs, biological testing, and biomedical assay, positioning me well for tasks related to drug discovery and biomaterial design. Under Professor Jingyue Ju and the group’s guidance, I was engaged in the pharmaceutical field, accelerating my pursuit of advanced biomaterials and medicine. Ultimately, I believe that as a chemical engineer, it's essential to understand the entire journey of a product from its inception in the industry to its introduction to the market. I undertook an invaluable internship at Mp. Biomedical is a prominent biomedical company in California. This experience allowed me to work on a project dedicated to creating a next-generation sequencing kit. I deepened my understanding of PCR and qPCR techniques and analysis, adapting them to suit the project's specific needs by crafting tailored experiments. Beyond the lab bench, I embraced the world of bioinformatics, utilizing the Bio-Star to decipher and analyze intricate sequence datasets. The fusion of hands-on experimentation and computational analysis enhanced my understanding of biomedical research, offering deep insights into the journey of new medicines from design to production for the market. To augment the analytical aspects of my research, I familiarized myself with computational tools like R and Python. These proficiencies enable me to do some data analytics, providing data-driven insights into material behavior, enhancing visualization, and facilitating efficient decision-making processes during the biochemical polymer research process. Guided by the synergy of chemistry, biology, and engineering, my passion lies in therapeutic development and biomaterials. Biomaterials hold the potential to cure persistent illnesses and enhance biocompatibility, while drug development addresses both ongoing and immediate health challenges. My ambition is to craft antiviral drugs targeting polymerase inhibitors and explore nanomedicine in biomaterials. I envision designing nano polymers infused with self-supplying antibiotics for targeted drug delivery and surface treatments, mitigating inflammation risks and adverse effects. By leveraging nanomedicine, we can revolutionize medical practices. With a background in chemical engineering, I appreciate the depth of innovation required, demanding interdisciplinary expertise. My grasp of chemical synthesis facilitates polymer design, my understanding of biology ensures human relevance, and my engineering knowledge evaluates industrial viability. As I look forward to deepening my collaboration with Professor Ju and remain inspired by Professor Oleg Gang's work, I'm positioned at this intersection of multiple disciplines, prepared to drive forward therapeutic breakthroughs and reshape healthcare innovations. Transitioning to my academic journey, Columbia University has been a major influence, guiding my studies and research interests. Through hands-on projects and invaluable mentorship from esteemed professors, I've experienced significant growth academically and gained clarity in my research ambitions. Such deep-rooted experiences at Columbia have solidified my resolve to further my education with a Ph.D. here—a decision that transcends mere academic reasons, as this institution holds a unique significance to me. The advantage of working within a familiar research group minimizes the learning curve and negates the need for preliminary training. With unwavering dedication, I am eager to continue my research at Columbia, fostering collaborative relationships with respected professors and research teams.",
    "Resume": "YUE JIAO 2030 Hudson St NJ, US • 949-345-9091• yj2722@columbia.edu • linkedin.com/in/yue-jiao-90580924a EDUCATION Columbia University NY, NY Dec 2023 Fu Foundation School of Engineering and Applied Science Master’s degree: Chemical Engineering (concentrated on data analysis) Relative course: Biology simulation, Atomistic simulation. University of California, Irvine Irvine, CA June 2022 School of Physical Science Bachelor’s degree: Chemistry (concentrated on Biochemistry) Relative course: Organic Chemistry, Chemical Biology, Physical Chemistry, Quantum Chemistry. HONOR • Dean's List (2019 Spring Quarter, 2021 Spring Quarter, 2021 Winter Quarter, 2020 Fall Quarter). • Graduated with academic honors. RESEARCH EXPERIENCE A combination of antiviral drugs inhibits SARS-CoV-2 polymerase and exonuclease and COVID-19 Therapeutic Development, Columbia University. New York, NY Jan2023-now • Assisted and trained in performing experiments to test and verify the efficiency and ability of antiviral drugs (ombitasvir) analogs concentrated on exploring exonuclease inhibitors. The lab work includes setting up enzymatic assay, RNA purification, and MALDI. • Enzyme kinetic calculation to identify what kind of enzyme inhabitation happened to support the drug stimulation and find the target insert position. • Organic chemicals polymer synthesis for analogs of ombitasvir. Dissecting Inhibitor Impacts on Viral RNA Polymerase and Fidelity Control of RNA Synthesis in SARS- COV-2, University of California Irvine. Irvine, CA Dec 2021 • Utilized modeling and molecular dynamic simulations dissected how activated Molnupiravir affects viral RNA and Polymerase and mutated proteins. transcri • Performed computational programming to simulate EIDD-2801 structure and calculate partial charge to find protein ption. mutation position when it works on the medical cure for coronavirus. • Implemented software of Avogadro, atom, VMD, and GreenPlanet to simulate and calculate partial charges and execute chemical calculations to find the promising antiviral target position for inhibiting viral genome replication INTERNSHIP EXPERIENCE Intern of Research & Development | MP Biomedical LLC. Irvine CA May 2023-now • Utilized bioinformatics to emulate and align next generation sequencing reads, aiding in the development of an optimized rapid sequencing toolkit. • Obtain sequences from ACC Acetyl-CoA carboxylase, merge them into the reference database, and use Miseq to analyze. • Conducted wet lab experiments involving six distinct DNA polymerases for qPCR and PCR applications. Intern of Research & Development | Yantai Ganzhiyuan Humic Acid Technology Co., Ltd YanTai China June 2021 - Sep 2021 • Analyzed how these yellow humic acid structures helped it be one good fertilizer with the main chemist. • Explored how to maximize one possible effect of functions of yellow humic acid to work as a fertilizer in lab. • Connect with clients to transfer the requirement to actual. Intern of Quality & Development | Shandong Wanhua Chemical Group Co.,Ltd YanTai China Jan 2020 - March 2020 • Performed quality testing for products and corrected operational problems. Advance the fixing of operational issues. • Recorded daily data and conducted relevant data analysis to delve into the problem of quality issues. • Handled safety control, checking and ensuring three sections of safety of storage, proper use of chemicals, and secured utilization of chemical equipment. TECHNICAL SKILLS • Instrument Operation: Gas chromatograph - mass spectrometry, Gel Electrophoresis, PCR, qPCR, HPLC, Column Chromatography, NMR, IR Spectrometry, UV-vis spectrophotometry, Plasmid Purification. • Computer skills: Mathematica, Biostar, Conda, Python, R, VMD, PyMol, Avogadro, MATLAB, Excel, Powerpoint, Word."
}