{
    "ID": "369980282",
    "SOP": "Masood Nekoie Personal Statement Dear Admission Committee of the Columbia University CS Department, I am Masood Nekoie, a dedicated student in Canada with an unwavering passion for research and a strong desire to embark on a transformative journey as a PhD student. I am writing to express my profound interest in your esteemed institution and your field of research. My aspiration to be a prolific researcher has driven me to seek the mentorship of outstanding professors, and Columbia University stands out as the ideal platform for this pursuit. I am particularly captivated by Professor Henry Yuen, Professor Zemel and Professor Ghaderi research focus. My current work involves the implementation of the GWO method to develop the GWP approach, aimed at solving symbolic regression and prediction problems. This research endeavor has enriched my academic experience and resulted in a publication in a prestigious Machine Learning journal, where I introduced ABCEP as an innovative automatic programming method ([1](https://doi.org/10.1016/j.ins.2020.09.020 : Information Science Journal)). This method, combining ABCP and GEP, required extensive coding, including ABCP, qABCP, qsABCP, sABCP, GP, and GEP, to ensure a fair comparison. I am well-versed in MATLAB and Python, demonstrated by the extensive code within my published papers, comprising thousands of lines. My master's degree at Amirkabir University of Technology was dedicated to applying these methods to real-world problems, particularly in the field of electrical circuits. My thesis, with a GPA of 3.8/4, delved into \"Characterization of complex materials in the THz band using CSRR metamaterial and investigating their behavior through AI automatic regression methods.\" Furthermore, my proficiency extends to optimization methods, including genetic algorithms, PSO, ABC, Ant colony, and ICA. I possess the capability to hybridize these methods for practical real- world problem-solving. In addition to my research pursuits, I have a diverse background in electrical engineering, encompassing neural networks, RF design, THz characterization, numerical evaluation of electromagnetic circuits, FPGA programming, quantum computing (currently exploring Hamiltonian simulation), and automatic programming in AI. I am currently a PhD student at Carleton University with a perfect A+ (4/4 GPA) record in my courses. While Carleton University is strong in various areas, I aspire to be part of Columbia University's academic community to further my ideals. The prospect of joining your program excites me immensely, and I am highly motivated to contribute to your research community. If there is an opportunity within your group, it would be an honor to be considered. Best regards, Masood Nekoie +15142084328",
    "Resume": "Masood Nekoie (343) 558 2082 – nekoiemasood@gmail.com Living in Canada Education PhD Electronic Engineering (GPA:4/4)— Carleton University (Fall 2021-Ongoing) Research Assistant  Quantum Computing Application in Electromagnetic problems  Variational Quantum Algorithm (VQA) for solving linear equation problems  Developing Hamiltonian Simulation in Python  Developing HHL algorithm in Python Courses:  Method of Moments: Computational Electromagnetic 4/4  Advanced linear and nonlinear circuits 4/4  Neural networks for Electrical Circuits 4/4 MSc. Fields And Waves (GPA: 3.8/4)— Amirkabir University of Technology (2017-2020)  Thesis: A Methodology for THz Complex Material Characterization based on CSRR metamaterials and the Formulation of the Behavior by ABCEP as a prediction method  Developing CST and MATLAB automatic communication  Coding GP and ABCP automatic programming methods Courses:  Microwave measurement  Metamaterials  Advanced Microwave  Advanced Electromagnetic  Radar systems BSc. Electrical Engineering (Communication) — Isfahan University of Technology (2013-2017)  Project: EEG Simulation based on FPGA programming Selected Courses:  Analog Communications  Digital Communication  Electronics 1-2  Electromagnetic-Field and Waves  FPGA Programming Lab  Digital 1,2 (AVR Programming) Publications (14 Citations / h-index 3):  6 Citations / First Author: Developing ABCEP as a new automatic programming method (https://doi.org/10.1016/j.ins.2020.09.020: Information sciences Journal, IF= 6.795)  5 Citations / Second Author: Modeling the carbonation depth of recycled aggregate concrete using a novel automatic regression technique (https://doi.org/10.1016/j.jclepro.2022.133522: Cleaner Production Journal, IF: 9.297)  3 Citations / Second Author: Application of artificial bee colony programming techniques for predicting the compressive strength of recycled aggregate concrete (https://doi.org/10.1016/j.asoc.2022.109641: Applied Soft Computing Journal, IF= 6.725) Experience RF Engineer and High Frequency Programmer — Mobin Saman Company IRAN (Fall 2018-Fall 2020)  PLL designer based on DDS analog devices  Designing Automatic Frequency Shifter based on communication of FPGA-AVR gates and programmable analog devices  Sharp filter designer  General circuits debugging  Developing Interface platform for users with low knowledge of RF and waves (MATLAB & Visual Basics GUI) ELECTRICAL ENGINEER — INTELLICOM COMPANY IRAN (Winter 2020- 2021)  MATLAB, AVR, FPGA and Arduino developer  Developing Online Cameras recorder application with specific user requirements  Debugging and repairing faulty network systems such as routers and switches  Developing new electronic bus ticket cards using Arduino  Qt & Python Programmer Teacher Assistant  Electronic 1 LAB – Carleton University Lab teacher:  MOSFET, BJT, Diode, Multisim Software  Electrical Circuits LAB – Carleton University Lab Teacher:  Signal filtering and amplification. Time and frequency domain. Circuit design and simulation.  Communication Circuits LAB – Amirkabir University of Technology Lab Teacher:  Modulator and Demodulators, FM, AM, Oscillator  FPGA LAB – Amirkabir University of Technology Lab Teacher:  MATLAB & FPGA communication, VGA implementation, UART protocol, ISE, Verilog & VHDL Skills & Abilities  MATLAB  CST (Simulation & Visual Basic programming to  FPGA (Verilog & VHDL) communicate with MATLAB or other platforms)  C (Programming Language)  ADS  Optimization (GA, ABC, Ant, ICA)  Python Programming  Neural Networks  Machine Learning (Automatic Programming:  Quantum Computing (Python Cirq) GP, ABCP, GEP, ABCEP)  Visual Basics  Qt References  Gholamreza Moradi ghmoradi@aut.ac.ir Associate Professor Amirkabir University of Technology  Emadaldin Mohammadi Golafshani E.Mohammadi.Golafshani@gmail.com Post-Doctorial Fellowship Monash University  Morteza Nekooei cisco.ir@gmail.com CEO at Intellicom Company (www.Intellicom.ir)"
}