{
    "ID": "134745944",
    "SOP": "Yifan Qin Originating from my hometown, Shanxi, a region renowned for its abundant coal mines, I am acutely aware of the environmental challenges accompanying such prosperity. The significant coal mining activities and subsequent coal combustion in the area have precipitated severe environmental issues. I vividly recall days when the air pollution index soared off the chart and witnessed friends grappling with pneumonia. Back then, I learned that Chemical Engineering plays a pivotal role in addressing such pressing issues, and this realization fueled my initial passion for the major. This fervor was further fueled when recent wildfires in Canada painted the skies orange and filled the air with pungent odors, invoking memories of my childhood. The juxtaposition of those recollections against the present reality solidified my unwavering commitment to dedicating my career to chemical engineering. My academic journey, from undergraduate studies to master's research experiences, has been firmly rooted in these concerns, propelling me toward the next step in my academic pursuit. To this end, I am deeply motivated to apply for the Ph.D. program in Chemical Engineering at Columbia University, where I aspire to continue my research under the guidance of Prof. Kumar, with a focus on developing commercially viable nanoparticle-based membranes in the air purification sector that boast outstanding performance and are economically practical. With curiosity and desire to address the problems that concerned me, I deemed that exploring the intrinsic properties of substances themselves was essential. This led me to pursue a chemistry major in my undergraduate studies. This intellectual curiosity pushed me to a point where I was in the top 10% of students at Shanghai Jiao Tong University, I had the privilege of being admitted to the Zhiyuan Honors Program. This program's rigorous emphasis on foundational sciences provided me with a robust mathematical and scientific foundation. Concurrently, I delved into organic chemistry, physical chemistry, and polymer chemistry, immersing myself in these domains. Beyond the realm of academic study, I was determined to gain experience as a researcher in laboratories as early as possible. Consequently, toward the conclusion of my freshman year, I had 1 Yifan Qin the privilege of joining the SJTU Qiu Group, specializing in Precision Hierarchical Self-Assembly. After undergoing over 100 hours of training in research methodologies and experimental techniques, I embarked on my journey in polymer science research under the esteemed guidance of Prof. Huibin Qiu. In my first literature review research titled \"A Self-Assembly Pathway to Soft- matter Toroidal Nanostructures,\" I provided an overview of toroidal nanostructure preparation, with a particular focus on the evolving self-assembly routes of soft materials. This hands-on involvement in polymer science, coupled with my profound interest in refining materials and integrating superior alternatives into industrial production, solidified my commitment to research in polymer nanocomposites and nurtured my aspiration to cultivate skills capable of translating innovative concepts into substantive research projects. Expanding my research horizons, I applied to the Zhiyuan Scholars Research Program. As the team leader, I independently formulated and presented the project proposal. Standing out among 50 research groups, we secured a project grant of 75,000 RMB for two years. Our objective was to pioneer nano-horticulture using poly(lactide) (PLLA) containing micellar brushes, leveraging the biocompatibility of PLLA for applications in biomedical domains such as antibacterial measures and cellular screening. Throughout this intricate journey, I significantly honed my practical skills. I employed an array of characterization tools, ranging from NMR, MALDI-TOF-MS, and GPC for determining the optimal polymerization degree of PLLA, to utilizing TEM and SEM for visualizing micelle morphology, whether in solution or on material surfaces. Furthermore, the project cultivated my inventive spirit, compelling me to design a myriad of experiments to unravel the assembly dynamics of block copolymers in solution. My studies and research provided me with a solid chemistry foundational theory and practical skills for crafting high-performance polymer materials. Yet, a gap exists between laboratory studies and industrial use. This spurred my pursuit of Chemical Engineering at Columbia University for a master's, enhancing engineering theories and computational chemistry for predicting material 2 Yifan Qin properties. Simultaneously, my dedication to addressing air purification and my profound interest in polymer nanocomposites and gas transport drove me to seek further advancement in my research pursuits. I became a part of Prof. Sanat K. Kumar's lab, investigating the impact of polyoligoanilines inclusion in poly (methyl acrylate) (PMA) containing graft nanoparticles (GNPs). Rheological measurements using small amplitude oscillatory shear (SAOS) were performed on the system. It was determined that modifying polyoligoanilines placement within GNPs indicated a huge impact on mechanical properties. My ongoing research primarily centers around the thorough exploration of the mechanical and gas transport characteristics of GNPs while incorporating varying proportions of free chains. Our objective rests upon the determination of the activation energy governing diverse gas permeabilities within discrete GNP membranes. This multifaceted endeavor combines meticulous experimentation with insightful analysis, aiming to uncover the intricate mechanisms through which free chains exert their influence on the gas permeability of GNP membranes. During my tenure in Prof. Kumar's laboratory, I not only acquired an extensive repertoire of characterization techniques for diverse properties of polymer films but also developed a keen ability to comprehend the inner workings of instruments in an engineering capacity. This journey encompassed grasping the design principles underpinning instruments such as gas permeation cells, and progressing toward the conceptualization and construction of setups for characterization. This learning extended beyond mere material characterization methods, delving into the realm of process engineering. This dimension of growth significantly appeals to me, marking a pivotal highlight in my academic journey. My continuous learning journey has led me to recognize the substantial potential of polymer nanocomposite membranes in applications concerning air purification and gas separation. Fueled by this realization, my aspirations drive me to pursue further research endeavors. Consequently, I'm enthusiastic about seeking admission to the Ph.D. program in Chemical Engineering at 3 Yifan Qin Columbia University. My goal is to further investigate gas transport phenomena under the adept guidance of Prof. Kumar. Should I be granted the privilege of embarking on a Ph.D. journey, my forthcoming research will pivot toward the understanding of gas transport mechanisms. One of the avenues is to do high-pressure conditioning of membranes crafted from GNPs. This pursuit involves probing the mechanisms through which increased pressure heightens gas permeability and scrutinizing the enduring impact of this treatment. In closing, I wish to express my heartfelt appreciation for your meticulous consideration. This promises to be an enthralling and profoundly significant pursuit, one that I eagerly anticipate undertaking. 4",
    "Resume": "Yifan Qin 800 Park Avenue, Fort Lee, NJ 07024 (929) 989-7805 & yq2343@columbia.edu EDUCATION Columbia Engineering, Columbia University New York, NY Master of Science in Chemical Engineering 09/2022-present • Overall GPA: 4.0/4.0 • Courses: Transport in Fluid Mixtures, Soft Condensed Matter Zhiyuan College, Shanghai Jiao Tong University (SJTU) Shanghai, CN Bachelor of Science in Chemistry (Zhiyuan Honors Program) 09/2018-06/2022 • Overall GPA: 85/100 | Senior GPA: 90.5/100 • Courses: Organic Chemistry, Polymer Chemistry, Physical Chemistry, Polymer composite ACHIEVEMENTS & AWARDS • Zhiyuan Honors Scholarship of Shanghai Jiao Tong University 12/2018; 12/2019; 12/2020;12/2021 • Scholarship of Shanghai Jiao Tong University 12/2019; 12/2020;12/2021 • First Prize in Shanxi Province, The 31st National Chemistry Competition for High School Students 10/2017 RESEARCH EXPERIENCES Transport and Mechanical Properties of Grafted Nanoparticles 02/2023-present Student Research Worker | Supervisor: Prof. Sanat K. Kumar | Columbia Kumar Research Group • Mechanical Properties Research on Polymer-Grafted Nanoparticle Membranes via Oligoaniline Environments - Investigated the impact of polyoligoanilines inclusion in poly (methyl acrylate) (PMA) graft nanoparticles (GNPs). - Conducted rheological measurements using small amplitude oscillatory shear (SAOS) on both polyoligoanilines integration methods: (1) bimodal systems where chains of polyoligoanilines and PMA are attached to the silica; (2) diblock copolymer systems: PMA-b-polyoligoanilines are attached to the silica. - Systematically optimized film mechanical properties by strategically tuning the content and positioning of polyoligoanilines within the GNP matrix, achieving superior material outcomes. • Mechanical and Gas Transport Properties Research on GNP Membranes with Added Free Polymers - Incorporated homopolymers with distinct molecular weights into GNP solutions, followed by the fabrication of a range of GNP membranes through precise control of homopolymer content, molecular weight, and evaporation kinetics. - Performed comprehensive rheological assessments using SAOS techniques on the resulting membranes. The introduction of larger free chains exhibited a marginal enhancement in mechanical properties, whereas the incorporation of smaller free chains led to a noticeable reduction in modulus. - Conducted small-angle X-ray scattering and small-angle neutron scattering analyses to elucidate the spatial arrangement of the free chains within the GNPs. - Performed gas permeation tests under various temperatures and gas compositions to investigate the activation energy. Nano-horticulture Technology based on Micellar Brush 06/2020-06/2022 (Awarded the Zhiyuan Scholars Research Program funds of 75000 RMB) Team Leader | Supervisor: Prof. Huibin Qiu | SJTU Qiu Group: Precision Hierarchical Self-Assembly • Used poly(lactide)-containing block copolymer for assembly into micellar brushes, resulting in nanostructure construction on material surfaces and enhanced material functionalization for new applications. • Synthesized a series of block copolymers with crystalline PLLA as core-forming block and different amorphous corona- forming blocks, investigated their active self-assembly behavior in solution, obtained the controllable morphology and size by adjusting parameters such as block ratio, assembly time, temperature, and types of selective solvent • Anchored the cylindrical micelle seeds onto material interfaces, prepare the micellar brushes with controllable density and uniform length, and explore the controllable growth process of poly(lactide)-containing cylindrical micellar brushes • Executed functionalization of micellar brushes, expanding their applicability in medical materials, drug delivery, antibacterial operations, and more. A Self-Assembly Pathway to Soft-matter Toroidal Nanostructures 06/2020-11/2020 Individual Research | Supervisor: Prof. Huibin Qiu | SJTU Qiu Group: Precision Hierarchical Self-Assembly • Mapped the preparation landscape of toroidal nanostructures, emphasizing the evolving self-assembly methodologies of soft matters. • Demonstrated the intricate constructions of hierarchical nanostructures, harnessing toroidal micelles as foundational building units. • Consolidated insights on self-assembly principles, while evaluating and addressing the impending challenges and considerations for this nascent realm of nanomaterials. LEADERSHIP & VOLUNTEER EXPERIENCES • Class Monitor of Zhiyuan Honors Program of Chemistry, Zhiyuan College of SJTU 09/2018-09/2019 • Excellent Member of the Secretary Department of Student Union of Zhiyuan College of SJTU 09/2019-09/2020 • Excellent Member of Summer Volunteer Teaching Activities of SJTU 08/2019 • Volunteer of Zhiyuan College of SJTU (over 100 hours of volunteer service) 07/2019-09/2021 • Volunteer of Shanghai International Marathon 12/2019 ADDITIONAL INFORMATION • Software and Programming Skills: Python, Mathematica, ChemDraw, MestReNova, Gaussian 09 • Experiment Skills: Gas Permeation Cell, Rheometer, Thermogravimetric Analysis (TGA), Small angular X-ray scattering (SAXS), Column Chromatography, Thin Layer Chromatography (TLC), High-Performance Liquid Chromatography (HPLC), Nuclear Magnetic Resonance (NMR), Transmission Electron Microscope (TEM), Scanning Electron Microscope (SEM)"
}