{
    "ID": "544600210",
    "SOP": "Personal Statement Prospective Ph.D. Student Department of Computer Science, Columbia University Dr. Frederick Sanger famously stated, ”Scientific research is one of the most exciting and rewarding of occupations,” and those words have reverberated within me, igniting a powerful aspiration in my heart. Starting from modest origins in my home country, Bangladesh, I set out on a journey to the USA for my master’s degree, but that was only the beginning. As I delved deeper into my studies, my curiosity grew stronger, propelling me toward a loftier goal: a PhD. This evolution from an eager student to a resolute researcher has been a deliberate journey, not a mere coincidence. From the outset, my commitment to academic pursuits has been unwavering. During my formative years, an affinity for mathematics and physics guided me towards the realm of engineering. This inclination led to my acceptance into both a reputable medical institution and a distinguished engineering university. The importance of this accomplishment is amplified when seen through the perspective of my country’s limited educational possibilities for young women, where pursuing a career in engineering remains an unusual decision. Undaunted by societal expectations, I embraced the challenge and became the first female engineer in my family. My path commenced at Bangladesh University of Engineering and Technology (BUET), a place well- known for its academic excellence, and laid the foundation for my research journey. I got involved in various projects and academic events during my time as an undergraduate, and that sparked my love for research. The recognition I got from publishing research papers on international platforms laid a solid foundation for the research work I continue to do. This journey reflects my determination, supported by a strong belief in the importance of education and research. Transitioning to the USA, the exposure to a diverse array of backgrounds significantly broadened my horizons. My tenure at Texas A&M University introduced me to the Sketch Recognition Lab (SRL) under the guidance of Dr. Tracy Hammond. This environment nurtured my academic growth and became the fertile ground for exploring my research interests. My focus gravitated toward projects involving eye tracking and educational technologies. Beyond their technical dimensions, I was captivated by the inherent humanitarian implications of these initiatives. This realization solidified my aspiration to apply my knowledge to effect tangible change in people’s lives. This sentiment was further reinforced by witnessing a lab mate, who is visually impaired, actively pursuing a Ph.D. to contribute to disability- focused research. AsIsoughttodivedeeperintodifferentfieldsofcomputerscience,IexploredNaturalLanguageProcessing (NLP) under the direction of Dr. Ruihong Huang. This quest led me to work on a project on multi- evidence natural language inference for clinical trials. Moreover, I participated in Dr. James Caverlee’s InformationStorageandRetrieval(IR)coursetoextendmyknowledgeandworkedonaprojectthataims toboostclinicaltrialeffectivenessbyimprovingpatient-trialmatching. Thesuccessfulcompletionofthese two projects encouraged me to explore the application of NLP and IR techniques in the clinical domain as my master’s thesis. My thesis has two primary objectives: firstly, to determine textual entailment or contradictionofsomeclinicalhypothesiswithrespecttocorrespondingclinicaltrialreports, andsecondly, toretrieveasetoffactualinformationfromthetrialreportsconducivetoeffectivereasoningoftherelation. Adrita Anika Thepotentialimpactofthisresearchissignificant, asitaimstogreatlyenhancethecapabilitiesofhealth- care professionals in aligning the latest evidence with personalized treatment approaches. To realize the ambitious goal of effective evidence retrieval, I have undertaken an extensive analysis focused on the effec- tive integration of context considering the limitations of the maximum input number of tokens of SOTA language models. I have submitted my findings from this study to one of the most prestigious AI confer- ences, the AAAI Conference on Artificial Intelligence 2024. Furthermore, my efforts have encompassed theinfusionofdiseaseknowledgeintolanguagemodels. Ihavealsoexploredtheapplicationofcontrastive learningtechniquestodeviseanefficientmethodfornaturallanguageinference, particularlywhendealing with lengthy and intricate clinical trial data. These combined endeavors represent a concerted effort to advance the state-of-the-art in healthcare information processing and reasoning, with the ultimate aim of benefiting both practitioners and patients in the medical domain. Continuing my commitment to skill improvement, I decided to dive into a comprehensive course on Data Analytics and Visualization. Under the guidance of experienced mentors, Dr. John Keyser and Dr. Ann McNamara, I undertook a project focused on the analysis of traffic collisions in the bustling city of New York. The encouragement and support I received from the mentors motivated me to participate in the Disney Data and Analytics Conference 2022. It is with great pride that I share the accomplishment of winning the Disney Data and Analytics Women Award for 2022. This milestone not only granted me firsthand exposure to the transformative power of data analysis but also enhanced my practical expertise in the field of data science. To complement my academic pursuits, I set foot in the industry through internships as a Machine Learning Engineer at Tenstorrent Inc. and as a Data Scientist at Amazon Robotics. These roles gave me the chance to apply the theoretical knowledge I had gained to real-world scenarios, thereby refining my technical skills and nurturing effective teamwork and communication abil- ities. Concurrently, my role as a teaching assistant allowed me to further polish my project management, leadership, and teamwork skills. Throughout my transformative journey in the USA, which has encompassed diverse experiences ranging from intensive research projects, and demanding coursework to valuable internships, I can confidently assertthatthispathhasbeenanythingbutsmooth. Balancingteaching, research, andcourseworkamidst COVID-19 disruptions and a change in major from bachelor’s to master’s degrees has taught patience, resilience, and adaptability. Notably, I had the privilege of undergoing the CliftonStrengths psychometric assessment from Texas A&M University, which illuminated my core strengths—maximizer, relator, and empathy. Fueled by these attributes, I am steadfastly dedicated to achieving both personal and collective excellence, as I diligently prepare for the forthcoming Ph.D. journey that lies ahead. As I contemplate the next stage of my academic journey, my attention is firmly fixed on Columbia Uni- versity, an institution of great renown distinguished by its size, reputation, and commitment to academic excellence. With a profound research interest in harnessing the powers of machine learning, natural lan- guage processing, and information retrieval to drive transformative change, I see Columbia University as the ideal stage for nurturing my aspirations. I am particularly captivated by the opportunity to engage in collaborative research within Dr. Noémie Elhadad’s lab. Their research resides at the intersection of machine learning, natural language processing, and medicine, aligning seamlessly with my prior MSc. research experience. My passion lies in developing techniques that empower clinicians, patients, and health researchers to streamline their information workflows and derive invaluable insights from clinical data. Dr. Elhadad’s research, focused on supporting clinical decision-making, truly intrigues me. In addition, I am keenly interested in the research of Dr. Elias Bareinboim, whose expertise centers on causal inference and its applications in the biomedical domain. His recent work on fairness analysis in the context of causal inference greatly motivates me and closely aligns with my own research interests. Furthermore, I find Dr. Zhou Yu’s research particularly compelling. Her work delves into the intersection of natural language processing with real-world applications, which greatly piques my interest. Several Adrita Anika of her research endeavors resonate with my research interests, experience, and expertise. This potential collaboration promises a robust platform for exploring and unraveling intricate patterns within extensive datasets, shedding light on complex interconnections. In summary, my journey—from Bangladesh to the USA—has shaped an individual characterized by unwavering dedication, a passion for research, and adeptness in navigating challenges. I have become more resilient as a result of experiencing hardship and learning. The epitome of academic greatness is Columbia University, where I want to continue my journey, expand my knowledge, and genuinely leave my imprint via my contributions to research. Adrita Anika",
    "Resume": "Adrita Anika Email: adrita.anika@tamu.edu, adritaanika23@gmail.com Phone: (+1) 9797778466 LinkedIn Google Scholar Github Website Research Interests NLP, Information Retrieval, HCI, Machine Learning Education M.Sc. in Computer Science 2021 - 2023 Department of Computer Science and Engineering, Texas A&M University College Station, Texas, USA CGPA: 4.00/4.00 B.Sc. in Electrical and Electronic Engineering (EEE) 2015 - 2019 Bangladesh University of Engineering and Technology (BUET) Dhaka, Bangladesh Major: Communication and Signal Processing Work Experience Data Science Co-op, Amazon Robotics July 2023 - Present • Ileveragedata-drivenmethodologiestooptimizeroboticsystems’performance,maximizecustomerreturnoninvestment and optimize human resources as a member of Global Safety and Support-Data Solutions and Insights (GSS-DSI) team. Graduate Assistant Lecturer, Department of Computer Science, Texas A&M University Jan 2023 - May 2023 • I have worked as the principal instructor of CSCE 110: Programming I for undergraduate students. Machine Learning Engineer Intern, Tenstorrent Inc. May 2022 - Aug 2022 • I have worked on developing a software stack for deep learning algorithms that can be run on the new AI processors capable of delivering the best performance. Teaching Assistant, Department of Computer Science, Texas A&M University 2021 - 2022 • Courses: CSCE120/121: ProgramDesignandConcepts,CSCE482: CapstoneDesign,CSCE110: ProgrammingI,CSCE 221: Data Structures and Algorithms Lecturer, Department of EEE, Brac University 2019 - 2021 Research Experience • Multi-evidence Natural Language Inference for Clinical Trial Data Oct 2022 - Present The project aims at determining the entailment or contradiction given a hypothesis and premise of clinical trials on Breast Cancer which requires numerical and quantitative reasoning of natural language. We explored several BERT- basedmodelstoinfusemedicalknowledge,andcomparedourperformancewiththestate-of-the-art(SOTA)models. The proposed approach achieved 64.24 % and 62.04 % accuracy and F1-score, respectively. • Estimation of Macronutrients with Continuous Glucose Monitors Jan 2021 - Aug 2021 The goal of the research was to estimate dietary intake automatically by analyzing the post-prandial glucose response (PPGR)ofameal,asmeasuredwithcontinuousglucosemonitors(CGM).Specifically,wewantedtoestimatetheamount of macronutrients (protein, fat, carbohydrate) from CGM responses using machine learning algorithms. • Search & Rescue with Drone-Embedded Sound Source Localization Sep 2018 - Nov 2020 The goal of the research was to develop algorithms capable of localizing a sound source based on audio recordings made with an 8-channel microphone array embedded in an unmanned aerial vehicle (UAV). • Gaze for Responsive Interaction with 3D Avatar in Mixed Reality Environment May 2018 - Apr 2019 The goal of the research was to develop a real-time system where 3D avatar can respond in a virtual environment based on the gaze-to-gaze interaction with the user. Skills • Programming: Python, R, C/C++, MATLAB, Bash, SQL, Git • Machine Learning: Keras, Scikit Learn, PyTorch, OpenCV, Spark, Hugging Face • Simulation & Design: PSpice, Simulink, AutoCAD 1 Publications In Review • Adrita Anika, Md Messal Monem Miah, Tracy Hammond, ”Investigating the Role of Context in Evidence Retrieval for Natural Language Inference from Clinical Trials” AAAI Conference on Artificial Intelligence 2024 Published • Qayyum AB, Hassan KN, Anika A, et al. DOANet: a deep dilated convolutional neural network approach for search and rescue with drone-embedded sound source localization. EURASIP Journal on Audio, Speech, and Music Processing. 2020 Dec;2020(1):1-8. • A. Anika, M. Junaed-Al-Hossain, S. Hasibul Alam and Nahid-Al-Masood, Fault Detection and Classification of Power SystemBusbarusingArtificialNeuralNetwork,2019IEEEInternationalConferenceonPower,Electrical,andElectronics and Industrial Applications • S. Hossain, B. Debnath, A. Anika, M. Junaed-Al-Hossain, S. Biswas and C. Shahnaz, ”Autonomous Trash Collector Based on Object Detection Using Deep Neural Network,” TENCON 2019 - 2019 IEEE Region 10 Conference • A. B. A. Abdul Qayyum, A. Anika et al., ”Direction of Arrival Estimation through Noise Supression: A Novel Approach using GSC Beamforming and Room Acoustic Simulation,” 2019 IEEE International Conference on Signal Processing, Information, Communication Systems • S. Hossain, B. Debnath, S. Biswas, M. J. Al-Hossain, A. Anika and S. K. Zaman Navid, ”Estimation of Blood Glucose fromPPGSignalUsingConvolutionalNeuralNetwork,”2019IEEEInternationalConferenceonBiomedicalEngineering, Computer and Information Technology for Health • B. Debnath, A. Anika et al., ”Automatic Handwritten Words on Touchscreen to Text File Converter,” TENCON 2018 - 2018 IEEE Region 10 Conference Relevant Projects • Matching Patients to Clinical Trials [Project Website] Clinical trials are necessary for the development of novel medical treatments. The objective of this study is to address the clinical trials matching problem: given a free-text summary of a patient’s health record, locate clinical trials that are appropriate for that patient. • Analysis and Visualization of Motor Vehicle Collision Data of New York City [Dashboard, Poster] TheprojectaimsatexploringthemotorvehiclecollisiondataofNewYorkCitythatcangiveinsightsregardingthecauses of such accidents which may lead to potential remedies for preventing road accidents. Specifically, the project targets to explore the statistical relationship of road accidents with respect to the time of accident occurrence, types of injuries of the victim, vehicle types, etc. using multiple datasets containing more than 1M rows of data which are publicly available from Open Data, City government of NYC. • Bringing Machine Learning into the Classroom [Slides] Theprojectaimsatdevelopinganinteractivelearningtooltohelplearnersunderstandalgorithmsbystep-by-stepvisual- ization. Ithastwomainparts. TheSketch Vizenablesuserstolearnsketchgraphse.g. speedgraphs,curvaturegraphs etc. for each data point. The system’s ML Algo Viz let users enter data points interactively, choose algorithms and hyperparameters,runandvisualizethemodel’strainingiteratively. Userstudyresultsdemonstratedthatusersfoundthe interface easy to use & understand, it can help them learn, they will use it in the future and recommend it to others. • Estimation of Public Speaking Anxiety from Bio-Behavioral data [Poster] The goal is to better understand individuals’ affective responses while performing public speaking tasks. Several deep learning models, feature selection, feature transformation algorithms have been used on the Verbio Dataset. Awards and Scholarships • Disney Data & Analytics Women (DDAW) Award, Disney Data Analytics Conference 2022, Orlando, Florida • Techfest2017,IITBombayIndia,(Asia’sLargestScienceandTechnologyFestival)1strunnerup,DigitalizeCategory. • The Duke of Edinburgh’s International Award 2018 The Silver Standard • Scientific Poster Presentation, Esonance 2018, IUT, Bangladesh Champion • National Power and Energy Hackathon 2017, Bangladesh 1st runner up in the Smart Grid category. • Dean’s List Scholarship, Department of EEE, BUET Level 2, Level 3 and Level 4 Professional Service Reviewer, Empirical Methods in Natural Language Processing (EMNLP) 2023 Executive Committee Member, Bangladesh Students Association, Texas A&M University, 2022 - 2023 2"
}