{
    "ID": "128093427",
    "SOP": "Shao-Ju Wang A 3.66 GPA is not among the bests of your applicants. And yet, I am proud of it when it comes to completing dual degrees in Computer Science and Electrical Engineering plus a minor in Computer Engineering within four years of college. My college education aim was to build the most holistic training in different engineering disciplines possible because I believe that better problem-solving skills and ideas come from a combination of knowledge and skills from various perspectives. Therefore, I tried to reach this goal with dual degrees with a minor and research projects with professors of different engineering backgrounds. And now, I am ready for my next aim of focusing and sharpening my knowledge and skills in Automatic Control and Embedded Systems. Within automatic control, I am especially interested in AI and robotics that free-up manpower, particularly those requiring less cost to own and operate. At Penn State, I accomplished two projects involving computer vision, one in a fruit fly 3D model and the other in a metal deposition. These two projects show me the unlimited potential of how computing can help remove redundancy works and automation's potential. Furthermore, living in a developing country for six years, I had the opportunity to witness some deplorable living conditions where Shao-Ju Wang Shao-Ju Wang people don't even have access to essential utilities. Those encounters have motivated my quest to improve technologies and devices that are beneficial and affordable to those with limited resources. And I believe that my graduate training in automatic control will be the way for me to achieve that goal. The second area of specialty that I would like to acquire further is embedded system. To achieve the goal of building affordable devices that aid people, I am eager to learn more about the architecture of embedded systems, particularly microcontrollers. At Penn State, I took courses in algorithm frameworks, such as divide and conquer, dynamic programming, and microcontrollers and MIPS architecture. I aim to tackle the optimization problem with both software and hardware approach; achieving more than double effectiveness. My interest in research projects began from my favorite course at Penn State, CMPEN 454, Introduction to Computer Vision. The course combines the physical world, bits, and math altogether. After taking the course, I began working with some of the professors at Penn State, developing computer vision programs that aid their research. First, I joined Professor Jean Shao-Ju Wang Shao-Ju Wang Mongeau's Bio-motion Systems Lab of Mechanical Engineering to help them recreate a fruit fly 3D model with stereo images. Although I did not work on the core computer vision code, I helped optimize the user experience and learned a lot about the techniques and flow. After completing the project, I assisted Professor Sanjay Joshi from Industrial Engineering in creating a program that automatically determines the dimension of metal deposition from the cross- sectional image. Meanwhile, I am developing a single-lens camera distance detection algorithm that works on the phone with Professor Kyusun Choi in Computer Engineering. This device will detect obstacles in front of a micromobility to prevent traffic accidents. These project experiences in software and low-power hardware have shown me my limitations in these areas, the fun of finding solutions on my own or within a team, and, more importantly, the urge to study further. Not only did projects with the professors in engineering research, but I also helped Professor Yunting Liu from Electrical Engineering in settling and improving her lab session in EE 413, Introduction to Power Electronics. I assisted her and her TA in finding and solving the missing or confusing parts of the lab operation. I also made some technical suggestions on the Shao-Ju Wang Shao-Ju Wang typesetting of the lab manual. From this experience, I learned the development process of lab design and how to conduct the lab. I enjoyed the teamwork research with the professors and their team members. And yet, I am also trying to solve some of my questions in engineering on my own. The project on converting USB PD to ATX motherboard connections is my own attempt to solve the complexity of desktop power. Conventional ATX power supply takes several cables to supply power to the motherboard, while I am trying to provide the power with a single USB type-c cable. There are still many engineering questions that I wish I could find the answers to and the solutions from my training in your Master's program. In my last year of undergraduate education, I was the treasurer of the IEEE- Eta Kappa Nu (HKN) honor society. Aside from managing cash flow, I enjoyed tutoring members and non- members on electrical and computer-related coursework and assisting them with course selections. I was delighted when I could find ways to help these students understand the concepts they tried to learn in class. It was a mutually beneficial experience because I learned to express Shao-Ju Wang Shao-Ju Wang myself better and thought more profound about this knowledge or skills. And I hope I will have more of these opportunities in the future. Academic education in CS, EE with a minor in CE exposed me to the spectrum between hardware and software. From project and tutoring experiences, I know I want to be a researcher and a professor at the university in my career life. Therefore, I am working step by step toward that goal. The CS graduate program at Columbia University has been one of the best in the world. I will be able to learn research skills that will further lead me to the future goal, learning from and contributing to our world as a professor. My life goal is to develop and improve technology to improve human life, especially for those with limited resources. Shao-Ju Wang",
    "Resume": "Shao-Ju Wang 1400 Martin St., State College, PA 16803 | (814) 915-1354 | shaojuwang1216@gmail.com Education The Pennsylvania State University, University Park, PA, USA  Bachelor of Science in Electrical Engineering 2019 - 2023  Bachelor of Science in Computer Science 2019 - 2023 Minor: Computer Engineering Cumulative GPA: 3.66 Re search Experience Research Assistant: Bio-Motion Systems Lab Aug 2022 – May 2023  Reconstructed and enhanced the 3D model of fruit flies from stereo images using MATLAB  Analyzed wing motion before and after wing damage to discover natural strategies for stabilizing damaged aerodynamic systems.  Improved and optimize code for faster processing and user-friendliness with the parallelized workload. Relevant Project Experience On-going Projects Nordic Semiconductor Hackathon Jul 2023 – Present  Create a device that monitors farmland and a web server that processes the sensor data to predict future growth and potential improvement.  Handle the robot and sensors.  Expect to finish prototyping by October. Object Detection Device for Micromobility Jun 2023 – Present  Collaborate with Professor Kyusun Choi to port the OneM2M hackathon award-winning project to using Android phones.  Re-purpose used phones and pack more robust features into smaller casings than the previous version.  Test software-based and hardware-based hybrid object distance detection mechanisms. Automatic Image Analysis Algorithm for Metal Deposition May 2023 – Present  Use OpenCV on Python to detect the dimensions of a cross-section view of metal deposition under different power and velocity.  Smooth out noise on the deposition, including the bumps on the edges. USB Programmable IO Jul 2023 – Present  Integrate FPGA and GUI to enable computers to act as digital writers and readers.  Design a GUI that allows users to program manually or have the ability to import packages such as HDMI protocol. USB PD to ATX converter Aug 2023 – Present  Design a device that converts USB PD protocol via type-c to 24 pin + 8 pin ATX protocol for desktop motherboards  Use cascading buck converters to step down voltages to various voltages required by the ATX protocol Accomplished Projects OneM2M International Hackathon – Team ScootSafe Apr 2023 – Jun 2023  Design a device with pedestrian detection, automatic horn, and dash functionality to be installed on micromibility.  Responsible for the alarm system and electrical wiring.  Awarded with Best Potential Award. Engineering for Sustainable World Project - Automatic Plant Watering system Jan 2023 - May 2023  Build a watering and cooling system based on Arduino with soil moisture sensors, temperature sensors, and others for an automated hydroponic system.  Collect data for algorithm improvement.  Implement sustainable water and power source in the phase 2 design. Slab Leveling Jig Automation Proof of Concept- Hardware/Software Designer Jan 2023 – May 2023 EE 403 Capstone Design for Seneca Woodworking  Develop a user-friendly scalable human-machine interface.  Integrate microcontroller, stepper motors, and AC power system to control router.  Use Arduino with C++ to control the speed and precise 2D motion of the router. Extracurricular and Service Experience Eta Kappa Nu (Epsilon Chapter) Treasurer Apr 2022 – May 2023  Assist members with Electrical and Computer-course related problems by organizing tutoring lessons and connecting students, professors, and other sponsors in the field.  Manage cash flow and assist other officers in club operations and events. Eta Kappa Nu (Epsilon Chapter) Tutor Nov 2021 – May 2023  Tutor Electrical Engineering and Computer Science undergraduate students for 3 hours weekly.  Provide consulting services to new students to help them choose classes and academic planning. Hub Aquarium Volunteer Feb 2022 – Present  Help supervisor to fix system faults, such as pump and inflow system.  Explain the organism and equipment to the visitors.  Lead and train new volunteers to maintain a clean aquarium.  Monitor and feed seawater fish in the Hub Aquarium and conduct seawater quality testing. Student Farm Club – Hydroponics Team Sep 2021 – May 2023  Experimented with agricultural practices and promoted healthy eating.  Planned for more reliable all-year crop production in the Greenhouse. Honors and Awards Best Potential Award: 2023 OneM2M International Hackathon – Team ScootSafe 2023 Dean’s List (6/8 semesters), Penn State 2020 – 2021 IEEE - Eta Kappa Nu (International Honor Society of Computer and Electrical Engineers) 2021 – Present Tau Beta Pi (International Honor Society of Engineers) 2021 – Present Nittany AI Award Finalist: Nittany AI Challenge – Team FungAi 2022 Behrend Honor Program, Penn State (Behrend Campus) 2020 – 2021 College of Engineering Scholarship (STEP) 2021 IEEE Mini Hackathon 2022 College of Engineering Travel Grant, awarded by the Center for Global Engineering 2021 Engagement, Penn State University (unable to complete due to COVID-19 pandemic) Skills Hardware/Software Languages C++/ C Python MATLAB Java VHDL Verilog Kotlin Assembly (MIPS and HC12) Software Visual Studio Xilinx Vivado AutoCAD NI Multism NI Labview MPLAB Android Studio Blender ROS 2 Languages English Chinese Mandarin Taiwanese Spanish Japanese (Fluent) (Native) (Conversational) (Beginner) (Beginner)"
}