{
    "ID": "737840932",
    "SOP": "Statement of Purpose Nishkal Gupta Myadam +918712749952, mnishkalgupta@gmail.com To Columbia University, Dear Professor, I have always had a fetish for Computer Science from the time I was introduced to coding in my high school. Ever since then I have kept myself up to date on new trends in this field. My bachelor’s education in Electrical and Computer Engineering provided me resources to build strong foundation in diverse subjects which include but not limited to mathematics, computer architecture & theory, algorithms & data structures, machine learning, cryptography & network security, analog/digital electronics, control theory and mechatronics. Later I went to pursue my dual master’s in electrical engineering and computer science in collaboration between Indian and Swedish universities and it was in Sweden where I was introduced to research and the three important questions \"what is”, \"why\" and \"the importance\" of research, whose answers changed my perspective towards my career goals. As part of my master’s course work, I performed multiple research projects starting from a Systematic Literature Review in \"Fraud detection in online payments using machine learning techniques\", this research provided in depth knowledge about various supervised and unsupervised ML techniques and their pros and cons, it also helped me on how to analyze and validate the obtained results. In short, it gave me a complete picture of how research is done on a professional level. The positive experience from this research opened doors for me to take up research assistant role for the summer of 2019 in Blekinge Institute of Technology, Karlskrona, Sweden where I was involved in two research projects, one where I had performed statistical and machine learning analysis for studying the characteristics of the communication network of a bus and also for analyzing the possibility of any system error and the second one being my favorite which is custom path planning for turtle bot robot in a specific lab environment using A* and Dijkstra’s algorithm, the take away from this role was collaboration with professional researchers, exploring diverse domains and also understanding the importance of resources for performing research work. Apart from this I have also performed research work in \"Trusted computing in Containers\" which involves understanding of various steps and key components that are involved in building trust within different hardware and software components of a system and the possibility of implementing the same in container technology. Next comes my master thesis where 6 to 8 months of sheer dedication was put by me in researching on the topic of \"Design and Implementation of Key Exchange Mechanisms for Software Artifacts using Blockchain Technology\" in collaboration with both the industry as well as academia. In short, my thesis included finding out the possibility of decentralizing the authentication functionality of Public Key Infrastructure and designing a framework which is compatible in an Artificial Intelligence marketplace. A different view about research was perceived by me from the experiences gained during the master thesis, be it learning completely new technologies namely blockchain, distributed systems, cryptography, cloud technologies etc. or the experience of collaborating with industry and following the industry standards and trends, managing the unforeseen situations due to Covid lockdowns mainly the unavailability of visiting the university campus and accessing the resources. Proper planning and interaction with the supervisor helped me manage it. The most important lesson learned by me during my thesis was to have patience, persistence, adaptability and most importantly inspiration to complete any research work and I am not only proud of completing my thesis on time, but I am also happy that my thesis till date has received 1400 plus hits and 600 plus downloads which is the highest in my class. After my masters, I briefly worked for 7 months as a software developer in Ericsson, Gothenburg, Sweden. It was during this time I didn’t find any excitement in my work as nothing new was done in the industry, rather the same old development of functionalities based on the customer input. Even though it was hard, I took the decision to quit my job and travel across Europe to rethink what I wanted to do in my career. Travelling helped me a lot by not only allowing me to explore different cultures and traditions but also helped me get introduced to new people. I made sure I interacted with different researchers across Europe who gave insights on how things work in graduate research and tons of other questions I had on pursuing a PhD. After a lot of thought I understood my role and purpose, which is research and build technology that enhances human life and I see PhD as the only way to fulfill this. I intend to apply for graduate studies in Computer Science with a focus on Artificial Intelligence and its applications. I choose this field as it aligns to my previous education, research as well as my future goals of implementing an intelligent system that replicates humans which can solve complex problems in a cost-effective manner with the help of software and PhD would be the first step in achieving it. Though I am flexible enough and open to ideas for the topic of my graduate studies I would like to conduct my research in communication/coordination, perception or design of system architecture for AI systems. Few of the topics I am currently educating myself or self-researching are \"distributed coordination of multi modal robots in complex environment\", for this topic I am mainly focusing on the architecture of communication among the robots and prioritization of tasks using machine learning by considering various parameters such as robots’ current position, environmental conditions as well as the goal needed to be achieved. Next, I am also interested in \"Prediction of human emotions using brain computer interface\", in this topic I look forward to research on processing signals from the electrodes strapped on human head in predicting the emotions such as anger, happiness, etc. by statistically mapping raw signal data to different color codes and later try to replicate the model on to the system and predict it under various conditions as I feel this may be the early stage for transferring human consciousness on to a chip. I am also interested in researching on building a software architecture for satellite systems to process and predict the imagery in the satellite compute systems itself rather than sending the raw data back to earth which would cost a lot of time and money. I am also open to topics that align with my goal. Meanwhile I also founded an Artificial intelligence consulting firm in India once I returned from Europe. The firm successfully deployed a computer vision application for a medical diagnosis start-up where we had to use OCR/ICR along with natural language processing to understand and predict the issues, treatments and medications handwritten by doctors. Later I had a great offer from another company where it assured me of mass hiring my employees and giving them a great salary package which I couldn’t offer them, which I happily agreed to, and I had to eventually close my firm. In a significant professional development, I now work as a MLOps engineer at a company called One Convergence, I am currently involved in building \"Pluto,\" an AI system that enhances user workflows, like agents for Large Language Models (LLMs). However, Pluto's scope extends beyond a limited number of agents, providing integration for complex tasks and harnessing the power of Gen AI at its core. I also embrace cultural diversity and bring unique talents to the table. I am an avid guitarist and tabla player, and I possess a profound knowledge of ancient Indian scientific scriptures, such as Sutra, Sulbas, and Vedas, which encompass age-old scientific wisdom. This cultural richness not only enhances inclusiveness but also offers a different perspective that can contribute to a comprehensive research environment. I take this opportunity to apply for graduate education at Columbia University, keeping in mind my long-term goals. Working in a graduate position would provide me with an excellent opportunity to collaborate with world class researchers, it would also help me get associated with leading industrial organizations. After speaking to current and graduated PhD students from Columbia, I was fully impressed by the diversity, support and inspiration it provides for an individual to grow in his/her career. I understand the dedication, patience and inspiration required to have a great research career and I believe I have groomed myself technically as well as for having the right attitude and mindset for such a career. If you feel I am the right person whom you’re looking for please do connect to me as I will be more than happy to introduce myself and explain in detail my skill set, talents, and vision. Thanks in advance! Yours Sincerely",
    "Resume": "M Nishkal Gupta +918712749952 | mnishkalgupta@gmail.com | nimy18@student.bth.se About Me A self motivated technology enthusiast interested in bringing useful and creative ideas into existence by applying my expertise by the knowledge gained from my education and industrial experience. Always looking to take up research roles that push my limits to get the best out of me which would benefit the society as well as the research community. Profile Links LinkedIn, GitHub, Personal Website Education Blekinge Institute of Technology Karlskrona, Sweden Masters in Science, Dept of Computer Science Jan. 2019 – Oct 2020 Jawaharlal Nehru Technological University Hyderabad, India Masters in Technology in Electronics Engineering,Emphasis on Telecommunication Systems June 2018 – Jan 2019 Jawaharlal Nehru Technological University Hyderabad, India Bachelors in Electronics and Communication Engineering Aug 2015 – May 2018 Experience MLOps Research Engineer December 2022 – Present One Convergence Hyderabad, India • Software Developer to research and develop functions and tools for an end to end MLOps platform called Dkubex which is involved in AI product development. I typically work with integrating open source ML tools and large language models into the platform which is built by leveraging the power of Kubernetes and MLflow, I have also integrated and worked with flyte ml pipelines for use cases in life science. Currently I am designing an developing an architecture for building a software router that helps multiple LLM’s to communicate with each other and also to scale up and down the LLM services on demand, the router acts a proxy between chatbot and LLM services including agents to complete a task. Founder April 2022 – Nov 2022 SKN Technologies Hyderabad, India • Founder of an AI/ML consulting startup for providing clients with solutions for their business problems using some of the cutting edge AI/ML and MLOps tech stack. Software developer for 5G packet core Aug 2021 – Feb 2022 Ericsson AB Gothenburg, Sweden • Developer to maintain products (units, nodes, networks, systems and solutions) including all development activities such as: requirement analysis, system design, architecture design, hardware design, software design, integration, verification, simulations, tools design, product life cycle management support and product documentation. Research Assistant June 2019 – September 2019 Blekinge Institute of Technology Sweden • Worked as a research assistant under Professor Siamak Khatibi, I supported him on two projects, first one being data simulation and analysis using various statistical as well as machine learning models majorly related to markovian chain model for supporting the communication network of a bus. Second project involved with developing of a own algorithm for path planning of a turtlebot 2 robot and it’s comparison with A* and dijkstra’s algorithms for performance evaluation. Technical Intern May 2018 – June 2018 Caribou Technologies Hyderabad, India • Worked on IoT tech stack (Raspberry Pi, Linux OS and customized sensors), developing and testing functionalities using C and Python libraries over the cloud for building smart lock solutions as part of the home automation project in collaboration with cross country team in India and Canada. Research Work Reduced sampling method for robotic path planning Ongoing ∗ Designing an algorithm to generate less and optimal sampling points when compared to probabilistic road map(PRM) and rapidly exploring random tree(RRT). The algorithm is first being implemented in 2D environment by converting the map into a Cartesian plane. Unlike PRM and RRT this algorithms focuses on connecting the start and goal points using shortest distance which is a straight line and whenever an obstacle is encountered it traverses across it’s perimeter by making sampling nodes and equal interval, at every interval it checks if the straight line from it to the goal is in free space configuration, if so path is found or else the process continues until the whole perimeter of the obstacle is traversed and later shifts to other obstacles if any. Aim of this process is to eliminate the complexity and no of sampling nodes done by previous algorithms. Master Thesis - Design of Key-exchange Mechanisms using Blockchain. Jan 2020 – Oct 2020 ∗ Designed and analyzed a framework by performing extensive research for adapting a decentralized PKI for key exchange mechanisms for software artifacts for micro-services with the help of blockchain technologies. Research on Fraud Detection in Online Payment Aug 2019 – Nov 2019 ∗ Performed an SLR on Online Fraud Detection using various Machine Learning techniques and built a framework to analysis the same practically. Research on Trusted Computing in Containers Aug 2019 – Nov 2019 ∗ Literature review describing various technologies and proposals for building trust in cloud based containers. The main focus of this paper is to study the trusted platform module (TPM) and it’s relationship with container technology. Projects · Building Electric bike from scratch · Designed and built an electric bike from scratch using renewable material for the bike chassis, a DC rear hub motor, a 2kw hour battery, reused battery management system and other electronic parts.The entire bike was built under 1000 dollars. · Automatic Labelling using Machine Learning · Implemented a machine learning tool for automatically labelling the raw sensor data and later generating features from it. Principal component analysis and Kmeans were the 2 algorithms used. · Obstacle Detection Robot · Built an obstacle detection robot with the help of arduino, camera, and ultrasonic sensor for a college robot festival. · Hand Gesture Recognition · Developed a software using python and AutoGUI along with arduino and ultrasonic sensor for handling laptop functions with hand gestures. · Path Follower Robot · Used arduino uno along with ultrasonic sensor, camera module and a robot structure built out of scratch to make it follow a neon tape for a robot competition. · Cryptocurrency using Blockchain · Built a Cryptocurrency similar to Bitcoin using python and Flask API. · Prediction and Analysis of Spam Emails using Machine learning models · Performed an experiment to compare the computational and predictive performance of ML models on a spam detection task. Ten-fold validation test was conducted to estimate the performance of a model in general, followed by statistical test such as nemenyi and friedman. · Chat Client and Server · Built a command line chat system based on Client Server architecture using TCP/IP protocol. · Quality of Experience for VoIP Service · Analyzed the performance of Free Call application which is based on voice over internet protocol service in relation to its connectivity to the internet. Performance was measured using delay, data usage and experience. · Machine Learning Model for Communication Network of a Bus · Developed a ML based model that analyses and rectifies problems in the communication network of a vehicular system. Model supports both static as well as dynamic data. Later google map’s API was used for plotting a heat map for the communication between the bus and the reporting stations. · Design of Network Architecture · Designed and simulated a network architecture for a startup using Cisco packet tracer. Components included Data/DNS/FTP/Syslog servers, computers, switches etc. · Network Architecture for Online Game · Proposed a network architecture along with theoretical calculations for monitoring, operation and maintenance of an online game similar to PUBG but with a much higher capacity. · Data Modeling of M/M/S Queuing system · Designed and implemented a lossless multiple server data model with the help of a state diagram for a cinema theatre using MATLAB with various service and arrival rates. Later statistical analysis was carried out using both graphical and numerical calculations. · Image Classifier · Built an image classifier based on Convolutional neural network using TensorFlow and python with the help of MNIST data set as input. Technical Skills Languages: C/C++, MATLAB, Dart, Python, Go ,BASH, JavaScript, LaTeX. Databases:MySQL, MongoDB, Mongoose, PostgreSQL. Web Frameworks and Languages:HTML/CSS, JSON, Bootstrap,Flask, Nodejs, Expressjs, Flutter, YAML. Developer Tools and Cloud Technologies: Git, Git-Lab, Docker, Redis, Anaconda, Kubernetes, HELM, Kustomize , Openstack, Terraform, AWS. Data Science Libraries: Pandas, NumPy, Matplotlib, Scikit Learn, Tensorflow, Transformers. IOT devices and OS: Arduino, Raspberry pi, Onion Omega2+, Linux(Kali and Ubuntu),Windows, ROS(Robot operating system). Networking Tools: Cisco Packet Tracer, Openflow,TCP dump,Wireshark, Transport, Basics of P4. layer protocols (TCP,UDP),Internet Layer Protocols (IPV4&IPV6),SNMP,DNS and ARP Blockchain Technologies: Ethereum(smart contract, Secret Store development, Ocean Protocol),Bitcoin MS Office: Excel, PowerPoint, Word Achievements · Merit Scholarship by Swedish Government Jan 2019 · Awarded50%feewaveinMaster’sEducationinSwedenduetooutstandinggradesfromBachelor’sEducation. · MSME by Government of India Feb 2018 · Selected for National Level Idea pitching for startups by Government of India for my idea of ”SMART EAR PODS”. · International Maths Olympiad 2013 · Attained 126th rank in India for International Maths Olympiad. Extra Curricular Activities and Hobbies Student Ambassador for Blekinge Institute of Technology, Sweden. Sep 2020 Volunteer at XP 2020 Agile Alliance, Software Community Jun 2020 Student President for Entrepreneurship cell, JNTU Hyderabad Mar 2017 – Dec 2018 DIY RC plane making DIY watch making and engineering Riffle Shooting - Semi professional level Professional Cricket and Table Tennis player"
}