{
    "ID": "370890758",
    "SOP": "Hello to everyone, my name is Mike Haddad Emblem ID # 23 62 95 92 I have had attended high school in middle east, at the Syrian Arab Republic, my second language was English. When I was in high school my favorite subjects were English and science, I had graduated from high school with a high GPA in my science and English courses. When I was a child, my dream was to come to United States of America and continue my education. Finally, the dream became a reality, I went to The College of Staten Island, a very peaceful place, and nice facilities. I graduated with a bachelor’s degree in electrical engineering in 2022. Nonetheless, I have started taking graduate courses in electrical engineering and I will graduate this fall semester 2022. Moreover, I have taken all the available courses at the college of Staten Island, the College of Staten has a lot of graduate courses in electrical engineering. I have decided to continue my education further by applying to your PhD program in electrical engineering, (Energy and power) and I have done multiple research projects. On smart grid and power consumption. And here I am. Thank you for your prerogative’s time.",
    "Resume": "Resume EDUCATION Bachelor’s degree from (The College of Staten Island), Bachelor of Science majoring in Electrical Engineering Degree GPA: 3.710 Master of Engineering from(the College of Staten Island), Master of Engineering majoring in Electrical Engineering Degree GPA: 3.74 TECHNICAL SKILLS Languages: Lab VIEW, MTHLAB, AUTOCAD, Python, Multisim Software: Microsoft vision, Microsoft project RESEARCH EXPERIENCE Electrical power, Energy, Circuit analysis Laboratory work: 1. The study of analyzing the flow of electrical power in a system. 2. Micro controller programming and functionality 3. All kinds of electrical filtering( low pass filter, high pass filter, band pass filter, etc.) 4. Signals and noise(gaussian’s analysis) 5. systems Analysis 6. Network systems Engineering 7. Electrical properties of materials 8. Digitals Electronics laboratory 9. Advance engineering designs. 10. Systems laboratory 11. Digital and analog Communication systems laboratory 12. Measurements laboratory 13. Embedded system analysis and design 14. Network systems engineering 15. Nanotechnology laboratory 16. Smart grid 17. Renewable energy 18. Power electric and instruments 19. Computer vision Thank you."
}