{
    "ID": "703824610",
    "SOP": "StatementofPurpose My introduction to Fluid Mechanics and Computational Fluid Dynamics (CFD) happened during my sophomore year when I enrolled in the Fluid Mechanics course. I vividly recall a defining moment when the professor showcased a brief video highlighting his recent research. The video featured a mesmerizing visualization of flow patterns around a circular cylinder. Witnessing the intricate flow dynamics surrounding what appeared to be a simplegeometricshapeleftaprofoundimpressionon me. It was this moment that ignited my interest to delve deeper into the world of CFD. I consider myself fortunatetohavestudiedatoneofIndia'spremierinstitutions,withanacceptancerateofless than 2%. This esteemed academic environment provided me with unparalleled opportunities to collaborate with highly knowledgeable and experienced professors. I wholeheartedly embraced these opportunities to expand my horizons and deepen my understanding of fluid dynamics and computationalsimulations. In the subsequent summer vacation, I worked as an intern at DHIO Research and Engineering, India, where I was introduced to the different aspects of the CFD simulation: geometry creation, meshing, setting up the solver, applying boundary conditions, and interpreting the results. I learned about meshing and the importance of using a good mesh. Furthermore, I learned how to perform mesh independence study and validation study, an essential precursor to any research work. Most notably, I learned how tounderstandandinterprettheflowdatageneratedfromthesimulations.The final project of the internship was to simulate a cyclonic separator and predict its separation efficiency using ANSYS Fluent. TheprojectwasundoubtedlyagatewayformeintothefieldofCFD, anddespitehavingsuchasteeplearningcurve,Ilearnedmanythingsduringtheproject. As I found my sophomore year internship on numerical simulations interesting, I took a Numerical Techniques course in my junior year, instructed by Dr. Pritanshu Ranjan. Here I learned about the inner workings of CFD solvers. The course taught me how numerical simulations aredone,starting from the governing equations, converting them to linear systems of equations, applying boundary conditions, and solving them using iterative methods such as Gauss-Seidel, TDMA, and the use of under-relaxing and over-relaxing factors along with other concepts. The first half of the course focused more on Finite Difference Method (FDM) and its limitations while the next half focused on the numerical solution of the Navier-Stokes equation using Finite Volume Method (FVM) and its implementation using staggered gridsanditerativealgorithmssuchasSIMPLE,PISO,andPIMPLE. As a part of the curriculum, I implemented some of these techniques in MATLAB codes to model well-knownproblems,suchasLidDrivenCavityandPoiseuilleFlow. Having developed abetterunderstandingoffluidmechanics,Iwishedtoexploreitsuseinreal-world problems. Prof. Kiran Ramesh at the University of Glasgow guided me in my junior year summer internship project to study the flow physicsofanairfoil-basedturbinetoextractenergyfromtides.In this project, I used a Discrete Vortex Method (DVM) based in-house solver written in Julia to simulate the performance of the turbine. The project was very insightful as I learned about the state-of-the-art research in tidal energy extraction. I also learned about DVM, a method where individual vortex elements are used for simulation in contrast to a full-fledged simulationcarriedout in CFD. The project also introduced me to aeroelastic modeling and fluid-structure interaction (FSI) andsubsequently,manyofmyresearchprojectsexploredthisarea. In my junior year, I took a design-oriented project course offered by our university, under the guidance of Dr. Vaibhav Joshi. Dr. Joshi hadexperienceinFSImodeling,andIworkedunderhimto understand FSI modeling using Finite Element Method (FEM). I used FEM to solve the Navier-Stokes equation, the structural equation, and the mesh movement equation. The governing equations were solved in the moving mesh Arbitrary Lagrangian Eulerian (ALE) framework. I developed the MATLAB code for 2D two-way coupled problems and used it to study anaeroelastic airfoil. I also worked under the guidance of Prof. Pritanshu Ranjan, to study passive flow control techniques for drag reduction using OpenFOAM. I was inspired to study this topic after learning about the use of dimples in golfballs.Throughthisproject,Idiscoveredthatthroughoptimalplacing of dimples on the exterior of geometry, flow separations can be prevented, which significantly reduces the drag. In the subsequent semester, I also had the opportunity to work under the supervision of Prof. Sridhar Ravi, at the UniversityofNewSouthWales,Australiatoexploretheuse of Dynamic Mode Decomposition (DMD), whichisadimensionalityreductiontechnique.Ideveloped codeinJuliatoperformDMDontheflowdataextractedfromthein-houseCFDsolver. My collaboration with Dr. Joshi also served as my introduction to the realm of biomimetics. One aspect that particularly piqued my interest and kindled my desire for further exploration was the study of fluid mechanics in collective motion among variousspecies,includingthecoordinatedflight of bird flocks and the synchronized swimming of fish schools. What intrigued me about these phenomena was their evolutionary development over millions of years, resulting in highly efficient and specialized modes of movement. Hence in my undergraduate thesis at Chalmers University of Technology, Sweden, I explored the fluid dynamics of triple synchronous flapping foils under the guidance of Dr. Yao. This was a challenging topic for me because I soon realized that the mesh movements I had used earlier were notfeasibleduetoexcessivemeshdeformation.Toremedythis problem, I used the Overset (Chimera) mesh technique, where the mesh attached to the structure moves independently of the background mesh, and the flow variables are interpolated between different meshes. UsingOversetmeshesandOpenFOAMIstudiedtheproblem,varyingthespacing between the airfoils. I identified the primary thrust generation mechanism, which was due to the formation of a Leading Edge Vortex (LEV) which generated favorable pressure gradients. For multi-foil systems, I also studied the vortexinteractionsbetweentheupstreamanddownstreamfoils andclassifiedthemaccordingtotheefficiencyandthrusttheygenerated. At Columbia University, I always wanted to combine myknowledgeoffluidmechanicswithrobotics, particularly with its applications in underwater robotics. Therefore, as a first step, I developed a bipedal walking robot, completely from scratch, starting with a concept sketch, initial and detailed CAD design, electronics, and even programming. I uploaded the journey video to YouTube as well (link). Due to the highly interdisciplinary nature of robotics, I also had the opportunity to learn more about MachineLearning,ReinforcementLearning,andGPUcomputing,whichIcontinuedtoexplore inthefuture. My interest in GPU computing and itsapplicationstoCFDledmetopursuesummerresearchunder the guidance of Dr. Shaina Kelly at Columbia University where I developed JLBM.jl, a high-performance, GPU-accelerated software to model flows written in the Julia programming language. The software utilizes the Lattice Boltzmann Method (LBM), which is a method of Computational Fluid Dynamics where the Boltzmann equation is solved instead of Navier Stokes equation. The software harnessed the massive parallelization capabilities of the GPU through the CUDA library and achieved 90% memory utilization. I am also currently working on publishing my work with Dr. Kelly. In the final semester of my Master’s program, I will continue toworkonJLBM.jl andapplyittomodelporousmediaflows. My passion for teaching and research has driven me to actively pursuerolesasaCourseAssistant (CA). DuringmysecondsemesteratColumbiaUniversity,IhadtheprivilegeofservingastheCAfor the Robotic Studio course, under the instruction of ProfessorHodLipson.Thiscourse,knownforits inclusivity in accommodating students with diverse backgrounds, presented me with the valuable opportunity to assist students across various aspects of their robots, ranging from CAD design to electronics and programming. An important skill I cultivated during this experiencewastheabilityto distillcomplexconceptsintoconciseexplanations. In thecurrentsemester,IamhonoredtoholdthepositionofCourseAssistant(CA)fortheAdvanced Fluid Mechanics course instructed by Prof. Gerard Ateshian. As a CA, I take an active role in creating challenging and engaging homework assignments to help students in their pursuit of advanced knowledge in fluid mechanics. Serving as a CA continues to provide me with a profound appreciation for the rich diversity of individuals I interact with daily, each bringing their unique academicbackgroundsandlifeexperiencestotheeducationallandscape. As a prospective doctoral candidate at Columbia University,Iaspiretonurturemyprofoundpassion for research and continue to build up on my graduate research work using the Lattice Boltzmann Method to study the complex problem of Carbon Storage in porous rocks. Columbia University's unwavering commitment to research and its strong ties to industry provide me with an unparalleled opportunity to channel my research efforts toward makingameaningfulimpactontheworld.Having said that, I am also interested intheworkofDr.PierreGentineintheareaofclimatemodelingusing different computational techniques. Particularly, I am interested in using the Lattice Boltzmann Methodtothelargescaledynamicsoftheatmosphereandtheeffectofclimatechange. My ultimate career ambition is to become a professor, where I can apply my acquired knowledge and honed skills to tackle real-world problems. Consequently, Iapproachtheprospectofembarking on a rigorous Ph.D. program at Columbia University with unwavering optimism and confidence. I firmly believe that through this academic journey, I will not only fulfill my personal and professional aspirationsbutalsocontributesignificantlytotheadvancementofthefield.",
    "Resume": "Piyush Pradhan (646) 354-8427 | piyush.pradhan@columbia.edu | www.piyushpradhan.com | www.linkedin.com/in/piyush-p-pradhan/ EDUCATION Columbia University, New York, NY, GPA: 3.7/4/0 Expected Dec 2023 Master of Science in Mechanical Engineering, Robotics Concentration · Coursework: Robotic Studio, Control Theory, Data Science for Mechanical Engineers, Digital Control Systems, Robot Learning, Digital Manufacturing, MEMS Production & Packaging. BITS Pilani University, Goa, IN, GPA: 8.67/10 Jun 2022 Bachelor of Engineering in Mechanical Engineering · Coursework: Fluid Mechanics, Microfluidics, Computational Fluid Dynamics, Finite Element Method, C Programming. PROJECTS AND RESEARCH JLBM.jl,Columbia University June 2023 – Present Graduate Research · Developed a GPU-accelerated Lattice Boltzmann Method based solver under the guidance of Dr. Shaina Kelly, Columbia University · Programmed the software in high-performance Julia language to accurately simulate porous media flows. · Leveraged CUDA libraries and meticulously designed data structures to craft high-performance kernels, attaining 90% memory throughput on NVIDIA GPU’s. · Validated the software for various 2D and 3D cases. Osbot, Columbia University Aug 2022 – Jan 2023 Course Project · Designed and fabricated a 6DoF bipedal walking robot (youtube video). · Produced parts, assembly drawings and Bill of Materials (BOM) using Solidworks and GD&T. · Utilized Design for Assembly (DFA) and Design for Additive Manufacturing (DFAM) principles to reduce the fabrication and assembly time of the robot. · Manufactured parts using 3D printing (FDM) and laser cutting. · Developed an inverse kinematics model for bipedal walking in Python. Numerical Analysis of Tandem Flapping Foils, Chalmers University of Technology, Sweden Jan 2022 - May 2022 Undergraduate Thesis · Examined the flow physics of synchronous flapping foils using Computational Fluid Dynamics software OpenFOAM. · Utilized geometry conforming Chimera meshes to reduce the computation time by 15h. · Identified the primary thrust generation mechanism and vortex interactions necessary for maximum performance. · Performed parametric study for different symmetric and asymmetric spacing conditions between the airfoils. · Analyzed and post-processed the results using Python and Matlab. Laminar Flow Control for Flow Past Semi-Circular Cylinder , BITS Pilani University Aug 2021 - Dec 2021 Undergraduate Research Assistant · Numerically analyzed the drag reduction in the case of semi-circular cylinder using OpenFOAM. · Evaluated the utility of notches for passive flow control for different notch geometries. · Performed parametric study for different notch dimensions and achieved maximum drag reduction of 4%. Parametric Study of Fully Passive Tidal Energy Extractor, University of Glasgow May 2021 - Jan 2022 Research Intern · Developed a Julia based one-way coupled solver using Vortex Methods to model the performance of a tidal energy turbine. · Computed a parametric map of energy extraction efficiency for different structural properties. · Identified the structural parameters for maximum energy extraction. Development of Finite Element Method - FSI Solver, BITS Pilani University Undergraduate Research Assistant Jan 2021 - May 2021 · Developed software to model one and two-way coupled fluid structure interactions using Finite Element Method (FEM) software in MATLAB. · Developed a high performance mesh parser to reduce mesh input time by 12% . · Validated the efficacy and accuracy of the solver by comparing with results from the literature. TEACHING EXPERIENCE Robotic Studio, Course Assistant, Columbia University Jan 2023 - May 2023 · Offered direction to approximately 100 students on diverse aspects of robot design encompassing CAD design (Solidworks, NX, Fusion 360), assembly of electronic components within enclosures, simulation and modeling of robots utilizing PyBullet & MuJoCo, and thermal and flow simulations using FlowthermXT. · Created custom Python code to facilitate the integration of camera and IR sensor modules. INTERNSHIP EXPERIENCE DHIO Research and Engineering, Bangalore, IN May 2020 - Jul 2020 Summer Intern · Analyzed flow past a cyclone separator of given dimensions and estimated its separation efficiency for air-saw dust mixture numerically using ANSYS Fluent. · Documented the efficacy of numerical predictions for evaluating separation efficiency of cyclone separator. SKILLS & INTERESTS Programming & Development: Matlab, Python, Julia, C++, C, OpenGL, Bash, Linux, Git Software: Solidworks, NX, Creo/Pro-E, CATIA, Fusion 360, nTop, ANSYS, OpenFOAM, COMSOL, Paraview, Gmsh, Salome"
}