{
    "ID": "345339289",
    "SOP": "Jie Pan Personal Statement Dear Admissions Committee, I am writing to express my sincere interest in pursuing a PhD in Electrical Engineering at Columbia University. I believe that my academic background, research experience, and career aspirations make me a strong candidate for your program, and I am eager to contribute to the Columbia Engineering community. My name is Jie Pan, and I am currently pursuing a second master's degree in electrical engineering at the University of Virginia. Prior to coming to the United States, I had the privilege of working at the China Academy of Information and Communications Technology, an institution akin to Bell Laboratories in China. During my time there, I immersed myself in the field of Photonics, achieving a remarkable academic record in courses such as laser and optics, Optical Communication Devices, Solid State Physics, Quantum mechanics, and more. I also gained extensive hands-on experience with various experimental instruments, which proved instrumental in my research endeavors. Throughout my postgraduate studies, I actively participated in several significant research projects. Notably, I was a key member of the team responsible for the National Natural Science Foundation of China (NSFC)/RGC Joint Research project on Visible- light Optomechanical integrated circuits based on III-nitride semiconductors. This project encompassed various aspects of photonics, nanophotonics, and optoelectronics, including the growth and characterization of III-nitride materials, the design and characterization of photomechanical resonators, and information transmission modulation. One of my proudest achievements during this period was the design of a GaN- Jie Pan based Quantum Dot (QDs) microdisk laser with optical pumping, featuring a novel structure called GaN-on-insulator (GaNOI). This work led to my presentation at the 11th International Nano-Optoelectronics Workshop, where I received the Best Conference Paper Award. My master's thesis, titled \"Research on the fabrication of GaNOI structure and micro disk towards optomechanical system,\" encapsulated the culmination of my research efforts. Furthermore, my experience as a researcher at IBM Research - China and my current position as a Senior Researcher at the China Academy of Information and Communications Technology have allowed me to delve into advanced topics in optoelectronics, semiconductor materials, and quantum information sciences. These roles have enriched my knowledge and practical abilities, reinforcing my desire to pursue further education and contribute to groundbreaking research. I am particularly drawn to the field of optical materials, optical modulators, waveguide switches, photonic integrated circuits, and photodetectors. These components play a pivotal role in the era of Big Data, cloud computing, and the Internet of Things, where efficient data communication is essential. My graduate studies at the University of Virginia broadened my expertise, especially in the design and simulation of high quantum efficiency waveguide segmented photodetectors for quantum measurements. This work has significant implications for accurate photon number resolution in quantum measurements. The segmented waveguide photodetector has the potential to play a crucial role in quantum measurements, especially for photon number resolution. In this study, I focus on the design and simulation of a waveguide segmented photodetector with high quantum efficiency, utilizing the eigenmode expansion (EME) in Fimmwave software. Through optimization of the device design and comprehensive analysis of the quantum efficiency and loss mechanisms, my findings reveal that the Jie Pan proposed waveguide segmented photodetector exhibits superior performance compared to other photodetectors. The enhanced quantum efficiency makes it an ideal candidate for accurate photon number resolution in quantum measurements. By utilizing the finite element method, I was able to model and simulate the device with precision, allowing me to optimize its design for optimal performance.Paired with my endeavors in optical modulators and optical waveguide design, these experiences established a robust foundation, priming me for the myriad challenges and vast opportunities in avant-garde research areas. As I look ahead, I see tremendous potential in the field of photonic integrated circuits, driven by the increasing complexity of datacenter communications. My extensive background in micro and nano optoelectronics, integrated Quantum Photonics, and optical computing positions me well to make meaningful contributions to cutting-edge research in these areas. Columbia University is renowned for its excellence in research and its exceptional faculty. I am enthusiastic about the prospect of joining a vibrant academic community that nurtures bright, creative, and self-motivated scholars. I am committed to obtaining the best possible learning experience, equipping myself with the knowledge and skills necessary to become a first-class researcher. In conclusion, I believe that pursuing my PhD in Electrical Engineering at Columbia University is the perfect next step in my academic and research journey. I am confident that I can make valuable contributions to the program, and I am excited about the opportunity to study and conduct research at such a prestigious institution. Thank you for considering my application. I look forward to the possibility of contributing to the Columbia Engineering community and achieving my academic and research goals.",
    "Resume": "CV – Jie Pan Phone: +1-434-327-0858 E-Mail: peajae10084@gmail.com Located：Charlottesville,VA, USA TOEFL 110(Speaking 23) GRE 336+4.0 Educational background 2021.08—2023.08 University of Virginia Electrical Engineering M.S 2015.09—2018.07 Tsinghua University Electronic Science and technology M.S 2011.09—2015.07 Chongqing University Optoelectronic Information Engineering B.S Core Courses:Laser and optics,Optical Communication Devices,Nanoelectronics,Quantum mechanics,Semiconductor Device Physics,Quantum Electronics,Hardware for Modern Day Computing Facility skills: Lithography,growth and deposition,EBL,ICP,RIE,SEM,AFM,X-ray diffraction,etc Research Experience 2015.09—2018.07 Projects in the integrated Photonics group of lab in Tsinghua University include:  Simulation of optoelectronic devices by MATLAB,Python,COMSOL,FDTD,Crosslight and other software  MOCVD and MBE growth of GaN LED,LDs  Visible-light Optomechanical integrated circuits based on III-nitride semiconductors  Preparation and characterization of III-V quantum well microdisk laser  High-speed electro absorption modulation laser(EML) based on big data transmission  VECSEL based on high contrast grating (HCG) structure structure 2021.08—2023.08 Projects in the group of lab in University of Virginia include:  Metamaterials, optical modulators, optical waveguide design.  Photonic integrated circuits, and photodetectors with emphasis on high-speed applications.  Design and simulation of high quantum efficiency waveguide segmented photodetector for quantum measurements Work Experience 2020.01—2021.07 China Academy of Information and Communications Technology Senior Researcher 1.Large-area integration of semiconductor materials and their heterostructures by wafer bonding 2.Integrated Lithium Niobate nonlinear photonics 3.Research on the Quantum artifcial neural network architectures and components 4.Research on the optical communication and optical network technology towards the next generation data center 2018.07—2020.01 IBM Research – China Researcher of Optoelectronic Semiconductor 1.Epitaxial growth and structural characterization of semiconductor heterojunctions and quantum structures. 2.Research on the third generation of advanced wide band gap semiconductor optoelectronic such as GaN 3.Research on Micro-nano optoelectronic devices,systems,and Silicon-based Photonic Integrated Devices 4. Hybrid optoelectronic neural network algorithm and optical comupting for machine vision Publications 1.Jie Pan et al.Vol. 55, No. 7 / March 1 2016. Applied Optics.Spoof surface plasmon polaritons based on ultrathin corrugated metallic grooves at terahertz frequency 2.Jie Pan et al.Influence of growth parameters on morphology of Large Size Epitaxial Lateral Overgrowth of GaN on Sapphire towards Photonic Integrated Platform. The 11th International Nano-Optoelectronics Workshop (iNOW)"
}