{
    "ID": "282670368",
    "SOP": "I’ve got a good taste of the discipline over the four years of chemistry study in college and two semesters of graduate chemical engineering courses. Applications of chemistry and chemical engineering in various fields have opened my eyes. In my undergrad, I joined a research program to coat polyacrylamide gel with polydopamine (PDA) catalyzed by H O / Fe3+ which would be used for wound infection treatment 2 2 when the COVID pandemic forced me to stay back in China. This specific gel would offer photothermal disinfection from the nature of PDA and chemodynamics disinfection from hydroxyl radicals derived from H O and Fe3+. The gel could 2 2 potentially cover skin laceration and speed up curing. Moreover, it is porous so the skin wouldn't be in anoxic environment. Another lab I joined in my undergrad was DNA nanotechnology lab. We strove to customize DNA strands and assemble into polygonal shapes. One advantage of such making is its potential of drug delivery carrier due to miniscule size and good chemical bonding with drugs. During my graduate school period, my degree concentration is energy and climate. Some memorable courses include: green chemical engineering, CO2 capture and utilization, and electrochemistry. In Green Chem, we learned how to design chemical product with minimum sources and how to leverage profit margin and environmental impact. This idea would truly influence me when I conduct lab experiment. Other classes also shape my understanding of the world. Since my undergrad was in chemistry, I only had minimal exposure to industrial trend and society. Having learned Carbon Capture & Utilization and Electrochemistry, I notice the world is in drastic need of renewable and clean energy. These courses experience make me more fascinated about the energy and climate field. Few semesters of lectures could suit me with an overview of chemical engineering industries. However, a deep understanding of specific field would be only realized by dedicating years in PhD study. So far, I participated in Prof. McNeil’s lab to explore how to selectively deposit lead ions over other heavy metal ions under the supervision of Dr. Narouei. The research makes me have deeper understanding in electrochemistry. I realized one can modify the surface of electrode by depositing it with gold nanomaterial or with organic acid. The modification would enhance the chemical and physical bonding of lead ions to the electrode surface, and therefore benefiting the electrodeposition of lead. Columbia University intrigues me for its world renowned academia and its location in New York City. NYC offers me numerous stress-relieving events provided that I am in a anxious mood. Moreover, this metropolitan is the pivot of massive academic network. Connection with people from both industry and academy would provide me with insights for my future lab research. Moreover, I’m very looking forward to studying and working with distinguished professors specializing in materials, climate, and environment to explore real life applications. For example, the research topics on electrochemistry and battery from Prof. Alan West are really alluring. His projects emphasize on sustainability and alternative energy from which I am exciting to learn more. Other fascinating projects include Prof. Kumar’s pioneering exploration of inorganic nanoparticles for the polymers to unleash numerous potentials for biomimicry, energy storage and conversion. There are many other outstanding professors like Professor Esposito who has done brilliant work in fuel cell and solar ene. It would be such an honor if I were to work closely within their lab and manipulate state of the art facilities. Continuing either one of their studies will go a long way towards addressing my concerns about sustainability and enable me to develop practical designs that benefit people’s lives.",
    "Resume": "ZIFENG TANG 775 Columbus Ave, New York, https://www.linkedin.com/in/zifeng- tang-03917a214/ (917) 912- 6024 NY, 10025 zt2309@columbia.edu EDUCATION Columbia University New York, NY Master of Science in Chemical Engineering, Overall GPA: 3.62 Expected Dec 2023 Sample Coursework: Carbon Utilization and Conversion, Green Chemical Engineering, Electrochemistry New York University, College of Art and Science New York, NY Bachelor of Science, Chemistry, Overall GPA: 3.64, Major GPA: 3.87 May 2022 Sample Coursework: Organic Chemistry, Biochemistry, inorganic Chemistry, Intro to Computer Programming Award: George Granger Brown Award in Chemical Engineering, Isidore Rubiner Award in Outstanding Chemical Research WORK EXPERIENCE Columbia University in the City of New York New York, NY Research Assistant & Technician Jan 2023 - Present • Joined Prof. Faye McNeil's lab for electrochemistry research focusing on environmental problems. The current focus is to economically and efficiently recover lead ions from river water through electro-deposition onto the modified electrode, intensifying the lead detection signal. Mentored undergraduate students for lab research over the summer • Act as a technician in the Precision Biochemical Characterization Facility laboratory in the chemistry department. The duty includes filling LN2 dewars, changing cylinders, routine maintenance on instruments, learning instrument operation, and training students in their use International Fund For China's Environment Washington, DC Intern Jun 2023 - Present • Update information and recent events about IFCE on official social media; Research on collecting US low carbon activities among the chemical industries, seek potential sustainability cooperation between US and China's chemical industries New York University New York, NY Course and DNA Lab Research Sep 2018 - May 2022 • Studied 3D printing technology. Comprehended 3D design programs featuring Additive Manufacturing machine • Performed strand purification protocol at the DNA Nanotechnology Lab. Attempted to anneal DNA strands to form motifs with other lab members. Developed a new strand design whereby DNA strands were made into triangular or polygonal shapes Institute of Life Sciences, Hunan Normal University Changsha, Hunan, China Biotechnology Laboratory Intern Jan 2020 - Aug 2021 • Devised one project to coat antibacterial material, polydopamine catalyzed by H2O2 and Fe3+, on surface of a polyacrylamide gel to obtain extra photo-thermal and chemokinetics disinfection • Collaborated on another published research project \"An Ultrasmall Fe3O4-Decorated Polydopamine Hybrid Nanozyme Enables Continuous Conversion of Oxygen into Toxic Hydroxyl Radical via GSH-Depleted Cascade Redox Reactions for Intensive Wound Disinfection.\" https://onlinelibrary.wiley.com/doi/full/10.1002/smll.202105465 Banfert New Materials Co., Ltd Changsha, Hunan, China Intern May 2021 - Jun 2021 • Managed to utilize UV Curable Coatings for wooden floors and various furniture surfaces • Implemented one general procedure of determining the specifications of UV curable coatings, and learned how to test and adjust coating viscosity and adhesiveness, layer thickness, as well as other coating properties Green Hunan Changsha, Hunan, China Member May 2017 - Aug 2017 • Analyzed the water body quality near my hometown and reported the polluting companies emitting chemicals alongside the river. A chemical plant was fined 250k CNY • Participated in field research at one of the largest landfill sites around my hometown. Assessed its ability to compost daily garbage and its potency to convert landfill to electricity for power plant and other sustainability pathways SKILLS Computer Skills: Word doc, PPT slide, Excel, Python INTERESTS Soccer, Working out, Fishing, snowboarding, Travel, piano, guitar"
}