{
    "ID": "236052530",
    "SOP": "My name is Zeyu Wang, and I am a Chemical Engineering student from Dan Steingart’s group. Looking back, I became fascinated by chemistry during high school, primarily as a result of my chemistry teacher’s personality and charm, while his particular teaching method made me want to learn about chemistry more than any other subject. When we studied inorganic molecular configuration, my teacher explained it from the aspect of electrons with valence bond theory, which was well beyond the level of typical high school teaching. Similarly, when it came to chemical equilibrium, he liked to use formulas and apply his knowledge of thermodynamics. Ultimately, it was such an approach that made me appreciate the charm and magic of chemistry. As a result, I chose to major in chemistry at Fudan University, and studied hard to acquire much more knowledge about this field. Based on the foundational knowledge gained from my classes at Fudan University, I was part of a group that began to conduct research into functional polymer. The project aimed to synthesize some new types of polymers, to resolve certain problems, with a view to putting them to practical industrial use in the future due to the promise offered by their outstanding electricity performance. During this experience, I was responsible for the organic precursor synthesis for polymerization. The main problem I had was finding the optimal conditions to enhance productivity, especially since the initial productivity level was only about 20%. To improve this I decided to approach it from two perspectives. One of these involved improving my technical skills in the synthesis process, such as wiping out oxygen and water, as well as working on column chromatography purification, which turned out to be very effective as the productivity rose to around 40%. The other approach entailed optimizing reaction conditions, but as the reaction process included several steps, it was a real challenge to be precise with finding the key point. Inspired by what I had learned from the course, I thought the Grignard reagent might play a more important role in the reaction, so I began optimizing reaction parameters, such as the ratio, the temperature, and the adding rate of the Grignard reagent in this process. However, the experiments didn’t always go as planned, and when extracting and condensing some white substances appeared. Through H- NMR, I discovered that it was the remains of the pinacol, one of the reagents. To resolve this issue, water was added to the system to dissolve the pinacol, and then diethyl ether was used to extract the target product. I’m very pleased to say that the results drew praise from the professor. This experience enabled me to obtain a good grasp of basic experimental skills and enabled me to tackle the problems I encountered during experiments. Meanwhile, I recognized that there are various obstacles and challenges when undertaking scientific research, which demand huge amounts of efforts and hard work, meaning that I have to maintain a consistently positive attitude when encountering such difficulties. I continued with the work of flow polymerization and wrote a review on computer- aided flow polymerization. First, we carried out a comprehensive exposition on flow polymerization, combined with computers and algorithms. This serves to address the gap in this field to some extent, as computer technology is novel in polymerization. After reading a large volume of previous work on computer-aided flow synthesis in the field of organic chemistry, to help us acquire knowledge of the most advanced computer techniques, we drew an analogy between small organic molecule synthesis and polymerization. Thereafter, the most recent research into the flow polymerization based on computers were incorporated and divided into four sections: high-throughput living polymerizations in flow; programmable regulations of dispersity profile; sequence and topology for polymers modular design with online monitoring; and self-optimized living polymerizations in flow. This work on polymers and flow synthesis led me to chemical synthesis with algorithm and computer technology, which impressed me greatly. During my studies in chemistry, and my work in polymer science within the laboratory, I firmly believe that I have been equipped with an excellent level of knowledge in chemistry and material science, and have also fostered a series of experimental skills, which have encouraged me to keep progressing in the field of scientific research. When studying in Columbia University, I joined Yang’s group and learned a lot about the polymer electrolyte, K-S battery and battery cycle test in the first semester. After that I joined Steingart’s group, taking charge of the program on lithium recycling from NMC811 powder, while I also participated in the program on recycling metallic hydroxides from batteries into a sodium-ion battery cathode precursor. I successfully recycled lithium from NMC811 powder with bromine at over 90% efficiency, without leaching out any other metals, including cobalt, nickel and manganese. The same experiment condition was carried out on LFP powder, and a similar result was achieved. Controlled experiments were carried out with sulfuric acid system and sulfuric acid with hydrogen peroxide (piranha) system, and the bromine system showed great selectivity and reaction efficiency over lithium. Due to my curiosity about the composition of the residues after leaching, XRD, SEM and EDS were utilized to confirm both the element composition and structure of the solid. In addition to studying experimental skills and the many characterization techniques, I also developed the ability to solve the problems I have encountered in the scientific research process like the balance between feeding pop density and reaction rate, the separation of liquid-solid phase with the presence of bromine, and unusual color change during the reaction. The solution appeared magenta only in the reaction of residues with sulfuric acid after bromine leaching, while the samples taken at different timepoints during the reaction turned brown and precipitated overnight. Following time spent reading a range of other papers, I figured out what had happened to this system based on the ICP and EDS data. After several years’ work in the lab, I firmly believe that I am equipped with the enthusiasm, recognition and necessary professional skills to continue my journey in the field of scientific research. I am really interested in polymer and battery, which I think has been, and will always be, of great importance in society, and I hope that I am able to make even some small achievements within these fields. I am very hopeful that I can join Columbia’s PhD program to keep chasing my dream, especially as Columbia is making great advancements in the field of energy, offering me the very best stage for my studies. Furthermore, I have been working in CEEC and Dan’s group for quite a while, meaning that I am familiar with the work and instruments in Chemical Engineering. I have also made many friends with other PhD students in Chemical Engineering, and we have offered one other a lot of help as we have pursued our research. As I look to the future, I sincerely hope I can keep studying and working in Columbia’s Chemical Engineering department.",
    "Resume": "Zeyu Wang Email. zw2853@columbia.edu | (646) 255-7271 30 Morningside Dr, Apt 608 New York, NY 10025 EDUCATION Columbia University New York, NY M.S. in Chemical Engineering Sept 2022 - Expected Dec 2023 Fudan University Shanghai, CN B.S. in Chemistry Aug 2018 - Jul 2022 RESEARCH EXPERIENCE Research into Battery Recycling January. 2023- Now Advisor: Professor Dan Steingart, Columbia University ➢ Selectively leached lithium from NMC811 and LFP with efficiency higher than 85%. ➢ Recycled and separated different metals from NMC811 through piranha digestion and solvent extraction at different pH. ➢ Analyzed the composition of the residues after NMC811 powder bromine leaching with SEM and XRD. Research into Lithium Ion Battery Sept 2022 – Dec. 2022 Advisor: Professor Yuan Yang, Columbia University ➢ Designed and modified solid polymer electrolyte based on PVDF-HFP and PEGDA ➢ Applied different polymer formulation and increased the mechanical strength to a large extent. ➢ Explored different electrolyte composition to soak the solid polymer electrolyte film to improve conductivity. Research into the photo induced living radical polymerization Feb 2020 - Jul 2022 Advisor: Professor Mao Chen, Fudan University ➢ Synthesized a variety of monomers, chain transfer agents and photocatalysts to synthesize polymers with outstanding electric performance with productivity more than 60%. ➢ Optimized reaction conditions of photo induced polymerization including temperature and adding rate and improved postprocessing with productivity rising from 30% to 70%. PUBLICATION Wang, Z.; Zhou, Y.; Chen, M., Computer‐Aided Living Polymerization Conducted under Continuous‐Flow Conditions. Chinese Journal of Chemistry 2021. ACTIVITIES Leader of the Organization and Investigation Department of the Student Union in Chemistry Sept 2019 – Sept 2020 ➢ Investigated students’ and teachers’ opinions and suggestions on situations regarding teaching buildings and laboratories. ➢ Rated as best departments reflecting students’ suggestions. Volunteering in the Academic Forum of Chemistry Nov 2019 ➢ Took charge of the whole activity and worked on the communication with professors to give speeches. ➢ Organized students to share academic research experience and results. SKILLS ➢ Experimental skills: Nuclear Magnetic Resonance; High Performance Liquid Chromatography; Gel Permeation Chromatography; Inductive Coupled Plasma Emission Spectrometer, Scanning electron microscope and Energy Dispersive Spectrometer; X-Ray diffraction."
}