{
    "ID": "914600895",
    "SOP": "Zhou Chenrui My undergraduate journey began in mathematics, fostering a foundation of logical thinking and problem-solving skills. This mathematical background serves as a springboard for my deep-seated interest in computer science, specifically artificial intelligence, computer vision, and computer graphics. During my undergraduate years, I pursued self-guided learning, immersing myself in online courses and research papers related to these fields. My mathematical grounding has been pivotal in comprehending the core principles of computer science. It enables me to approach problems systematically and devise innovative solutions. This interdisciplinary perspective uniquely equips me for graduate-level studies in computer science. In addition to my academic background, I actively engaged in research projects and practical applications of computer science concepts. These experiences honed my analytical abilities and equipped me with hands-on expertise, solidifying my readiness for the challenges of graduate study. I am enthusiastic about the prospect of advancing my studies in computer science, and I believe your program is the ideal catalyst for my intellectual and professional ambitions. The program's robust curriculum, distinguished faculty, and cutting-edge facilities are closely aligned with my goals. Zhou Chenrui Firstly, the program offers a diverse array of advanced courses and research opportunities in artificial intelligence, computer vision, and computer graphics. These courses will deepen my knowledge and equip me with the skills necessary to excel in research and innovation. Furthermore, I am drawn to the opportunity to collaborate with esteemed professors who are leaders in their respective fields. Their mentorship will be invaluable in guiding my research and keeping me at the forefront of developments in computer science. Lastly, access to state-of-the-art technology and resources will enable me to undertake pioneering projects, contribute to the academic community, and stay updated with the latest advancements in the field. In summary, your program's academic rigor, renowned faculty, and research opportunities make it the ideal environment for me to achieve my intellectual and professional goals. My primary academic interest lies in artificial intelligence, specifically the fusion and practical application of computer vision and computer graphics. I firmly believe that vision plays a pivotal role in artificial intelligence, much like human perception relies on visual input. Harnessing the synergy between computer vision and computer Zhou Chenrui graphics can revolutionize multiple industries, from healthcare to entertainment, and drive significant advancements in AI. I aspire to contribute to this transformative field by conducting in-depth research that leverages the power of computer vision and graphics. Your program's distinguished reputation in these areas, along with its emphasis on interdisciplinary collaboration, perfectly aligns with my academic interests. Moreover, I am inspired by the potential societal impact of this research. Advances in computer vision can enhance medical diagnostics, improve autonomous systems, and revolutionize visual content creation. Pursuing graduate studies in your program will enable me to be at the forefront of these breakthroughs, working towards solutions with far-reaching implications for the future. In conclusion, my passion for artificial intelligence, particularly in the domains of computer vision and graphics, drives my desire to pursue graduate studies in your program. I am eager to engage in cutting-edge research, collaborate with esteemed faculty, and contribute to the exciting advancements in these fields, holding immense promise for the future of technology and society.",
    "Resume": "Chenrui Zhou Tel: (+86) 18851118236 | Email: chenruizhou00@gmail.com Name: Chenrui Zhou ACADEMIC INTEREST I’m broadly interested in Computer Vision and its related applications, especially its application with computer graphics, robotics and beyond. EDUCATION BACKGROUND Kuang Yaming Honors School, Nanjing University Nanjing, Jiangsu, China Bachelor of Science in Information and Computational Science(Mathematics) 09/2019-06/2023 · Overall GPA: 4.125/5.0; 83/100 Major GPA：4.26/5.0; 85.2/100 STANDARD ENGLISH TEST SCORES TOEFL：103（S22） GRE: 323+AW3.0 RESEARCH EXPERIENCE Nanjing University Nanjing, Jiangsu, China Project: Design and implementation of hierarchical model reconstruction method based on recursive neural network Sep.2021~ June 2022 Advisor: Prof. Yan Zhang ⚫ Innovative Approach: Collaborated on pioneering a novel hierarchical 3D model reconstruction method using recursive neural networks and shape generation gradients, achieving significant gains in accuracy and efficiency. ⚫ Literature Review: Conducted a thorough review, revealing a gap in existing methods, which predominantly focused on overall shape rather than semantic relationships among components. ⚫ Semantic-Centric Design: Integral to designing and implementing a hierarchical reconstruction approach, utilizing recursive neural networks to initiate reconstruction from the semantic structure of each component, improving reconstruction quality. ⚫ Network Optimization: Played a key role in optimizing neural network parameters, introducing novel mathematical optimizations, leading to enhanced model accuracy. ⚫ Data Preparation: Prepared and preprocessed datasets for compatibility with the recursive neural network, ensuring consistent and reliable results. ⚫ Comprehensive Evaluation: Conducted extensive experiments, including benchmark datasets and various data conditions, showcasing the method's ability to generate high-quality 3D models. ⚫ Applications Exploration: Explored potential applications in computer graphics, virtual reality, and robotics. ⚫ VGG16 Integration: Integrated and modified the VGG16 model, enhancing its performance for the specific task. Project: AO-NeRF：Adaptive Octree-based Neural Radiance Fields April.2022~ Dec.2022 Advisor: Prof. Yan Zhang ⚫ Adaptive Octree-Based Approach: Proposed an innovative volumetric neural rendering method called AO- NeRF (Adaptive Octree-based NeRF), designed to efficiently generate high-quality synthesized views. Distinguished from existing NeRF methods that uniformly partition space at the same resolution using points or octrees, AO-NeRF introduces adaptivity at multiple scales. ⚫ Geometry Reconstruction: Integrated a deep multi-view stereo vision approach to rapidly reconstruct the geometric shape of scenes, obtaining foundational neural point cloud features. ⚫ Adaptive Resource Allocation: Introduced an adaptive octree-based framework for allocating resources at varying scales, dynamically managing the complexity of the scene's geometry. This adaptability optimizes 1 / 3 Chenrui Zhou memory usage and computation costs. ⚫ Attention-Based Feature Aggregation: Implemented a rapid aggregation of neural point features near the scene's surface using attention mechanisms, enhancing scene representation. ⚫ High-Quality Rendering: Achieved high-quality scene rendering through a ray marching-based rendering pipeline. ⚫ Performance Advancements: As a general framework extending Point-NeRF, AO-NeRF significantly reduced memory and computational costs while delivering superior view synthesis capabilities compared to existing point-based methods. ⚫ State-of-the-Art Results: Validated the proposed AO-NeRF on various datasets, demonstrating its ability to outperform existing methods in both rendering speed and quality, achieving state-of-the-art results. Project: Exploring the Influence of Diverse Loss Functions on 3D-LMNet Network Performance Dec.2022~ June.2023 Advisor: Prof. Yan Zhang ⚫ Undergraduate Thesis: Conducted an in-depth undergraduate thesis delving into the impact of various loss functions on the efficacy of 3D-LMNet, a pivotal point cloud reconstruction model within the realm of computer vision. ⚫ Contextualized Point Cloud Reconstruction: Explored the broader context and significance of point cloud reconstruction, highlighting its pivotal role in critical applications such as autonomous driving and immersive virtual reality experiences. ⚫ 3D-LMNet Model Examination: Analyzed the intricacies of the 3D-LMNet model, elucidating its architectural framework and underlying principles. Proposed an innovative approach that harnesses diverse Minkowski distances as loss functions to bolster its adaptability across a spectrum of real-world application scenarios. ⚫ Comparative Analysis of Loss Functions: Carried out an exhaustive comparative study, scrutinizing the model's performance when subjected to various loss functions, encompassing L1, L2, and Huber loss functions. ⚫ Empirical Validation: Demonstrated the experimental findings unequivocally, with results showcasing that the implementation of L1 distance as the loss function notably elevated reconstruction accuracy. These empirical results underscore the crucial role of loss function selection in the efficacy of 3D-LMNet network. PROFESSIONAL CONTESTS Meritorious Winner - Mathematical Contest in Modeling (MCM) and Interdisciplinary Contest in Modeling (ICM) Mar. 2021 2021 hematical Contest in Modeling / Interdisciplinary Contest in Modeling ⚫ Developed and fine-tuned a neural network utilizing Python and MATLAB to accurately identify wasp images from a diverse dataset of over a thousand images. ⚫ Applied Support Vector Machines (SVM) for precise image classification. ⚫ Enhanced the TF-IDF model to perform comprehensive text analysis. ⚫ Employed Latent Dirichlet Allocation (LDA) for data insights in the absence of labeled data. ⚫ Conducted an extensive literature review and method optimization to yield optimal solutions for predicting wasp diffusion paths. This project earned the esteemed distinction of 'Meritorious Winner' in the American Mathematical Contest in Modeling (MCM) and Interdisciplinary Contest in Modeling (ICM), underscoring my expertise in numerical modeling and interdisciplinary problem-solving. 2 / 3 Chenrui Zhou SKILLS • Programming Skills: Python, C, C++, MATLAB, SQL, Java, etc. • Deep Learning Framework: Familiar with Pytorch, OpenCV, Tensorflow, etc. SELECTED COURSEWORKS Use SQL to build a forum database June 2020 Coursework for Introduction to databases; Score: 4.0/4.0 ⚫ Successfully built a forum database using SQL server, and can complete basic functions such as registration, posting, replying, deletion, etc. The Development of Drawing Program Dec. 2021 Coursework for Computer graphics; Score: 4.0/4.0 • Designed and used python to complete a drawing program that can draw basic graphics and straight lines and display them correctly on the screen. • Learned about graphics algorithms and how to approximate graphics as a combination of pixels. Deep Learning-Powered Sentiment Analysis Dec. 2021 Undergraduate Research Project; Score: 4.0/4.0 · Deployed cutting-edge Recurrent Neural Networks (RNNs) coupled with advanced word embeddings to conduct sentiment analysis on textual data. · Performed rigorous data preprocessing, including the implementation of word embeddings through Word2Vec. · Trained a state-of-the-art RNN model, such as Long Short-Term Memory (LSTM) or Gated Recurrent Unit (GRU), to expertly classify text sentiments. Rigorously assessed the model's performance using a comprehensive array of metrics, including accuracy, precision, recall, and the F1-score. Fundamental PyTorch Proficiency Jan. 2022 Undergraduate Research Project; Score: 4.0/4.0 · Mastered the essentials of the PyTorch environment, including navigating different layers and comprehending their functions. · Gained a solid grasp of fundamental concepts such as Stochastic Gradient Descent (SGD), loss functions, and elementary neural network structures. Demonstrated practical skills through partial code implementations, including ResNet, Seq2Seq, and Generative Adversarial Networks (GANs). Designing the Ball-Pushing Game Feb. 2022 Undergraduate Research Project; Score: 4.0/4.0 · Acquired proficiency in foundational tools and technologies, including OpenGL, SolidWorks, and basic physics engine mechanics analysis. · Executed the implementation of core mechanics for the ball-pushing game, ensuring smooth gameplay interactions. · Showcased competence in creating basic lighting effects to enhance the game's visual appeal. ADWARDS AND HONORS • Honors of distinction, Kuang Yaming Honors School, Nanjing University 2023 • Meritorious Winner, 2021 Mathematical Contest in Modeling (MCM/ICM) 2021 3 / 3"
}