{
    "ID": "993618511",
    "SOP": "PersonalStatement I have always been the biggest fan of sci-fi. It often gave me an optimistic outlook on the relationship betweentechnologyandsociety.Ever sinceIstarted mycomputer sciencejourneyat the University of Toronto, it seemed to me that the line between fantasy and reality had been getting blurrier day by day enabled by constant breakthroughs of artificial intelligence near me. Inspired by endless opportunities, I took the initiative and grasped ontomyfascination withthis ever-growing fieldfor myprofessional development. During my undergraduate studies, I wasfirst introducedtothe worldof AIina visualcomputing course notorious among students for its challenging mathematical concepts not suited for the faint-hearted. Throughout the course, I studied and implemented numerous algorithms for real-world computer vision applications that I never thought to be possible before, and this led me to explore advanced concepts such as machine learning. I utilized the opportunity to take every AI-related course the CS department had to offer and excel in them. Most of these upper-level courses were cross-listed with thegraduate departmentandgaveme aglimpseof the life of a graduate student long before graduate school. In my senior year,I workedas aresearch student under the supervision of Dr. Anna Goldenberg at Toronto’s Hospital for Sick Children. Initially funded by a grant from the Canadian government, I then continued my position as a research employee after graduation. During my two years at the hospital, I was involved in integrating a machine learning model in the ICU to monitor patient status and predict deterioration, such as cardiac arrest events, in order to alert staff to apply preemptive measures, which canbecritical inmoments oflife anddeath. Ibuilt data streamingpipelinesthat dealtwith both live data and historical data, contributed to the usability design in the ICU, and eventually Huang, Xi delivered the tool to its clinical trial. Furthermore, I employed NLP techniques using Transformer models to de-identify patient information in medical records to provide data for future research. I was fortunate enough to have gained much project experience, witnessing the incredible synergy of combining AI with healthcare. This rather new effort not only minimized the stress on paramedics but also enabled the automatic detection and analysis of patient conditions. While the work demanded the repetition of various experiments and occasionally posed challenges, the sense of fulfillment and pride was truly gratifying, as I saw impactful change inthemedicalindustry. While I worked on my master’s degree in software engineering atCarnegieMellonUniversity,I continued to take ML courses and got involved with more ML research throughout my entire degree. I waspartof an object recognition projectat CMUincollaboration withWalmartwhere I processed image data and trained Visual Transformer models.I amcurrentlyinvolved inanother computer vision research project under Dr. Asim Smailagic exploringaninnovative approachin medical image analysis combining neural network with wavelet transformation that removes unnecessary detailsin theimagepreservingprivacy andreducingcomputation withoutimpacting performance, and we are in progress to publishing our work. Aside from ML work in this project, I was able to revisit the mathematical side of computer vision, which took me back to when I first discovered the wonders of AI algorithms. I utterlyenjoyed myresearchexperiences working with differentaspects ofAI,as theyhave shownmehow much goodAIcanbring toour current societyin aworld of dataand Iam dedicatedtocontinuingmy journeyfurtheringmyself. In addition to research, I have had two years of industry experience working at State Streetas a cloud software engineer. I eagerly seized the opportunity to master a range of software development tools and refine my software-building skills. This experience has prepared me for Huang, Xi my master's studies in software engineering and helped me gain avaluableunderstanding ofthe tech industry. This experience has also equipped me withthebeneficial insightsofcollaborating within a team, both in person and remotely. My industry experience, coupled with pragmatic software engineering training that I have done during my master’s degree, has shown me practical aspectsthatareasbeneficialas theoreticalknowledge inresearchwork. Perhaps with a different concept of self-worth, I am more captivated with chiseling into the unknown, a diversion from the common goal of my peers in my industry-oriented program of “making big money” straight out of graduationas asoftware engineer.Withmygrowing interest in using ML to improve life, I deem that the elevation of myself in research is imperative. Iam anxious to work with professors with overlapped interests in ML at Columbia. I have a deep yearning to boost my individual research ability as well as thecapacity toresolvetech problems innovatively. The academic prowess here has been world-renowned and the ML research has been diverse in various areas among whichIwouldlike tolearn morein.Ilook forwardtobeing an active member in the CS program, and to studying and working in a vigorous community. After my PhD studies, I look forward to working as a scientist, extending mystudies intheML field, and contributing to the development of AI in the realworld. Iwant todivedeeply into my own expertise,especiallyinhealthcareand theapplication ofnewAI technologies,and Iam very optimistic about my career paths after completing a PhD as a scientist. I’m confident that Iwill be content ina fieldof prosperousinnovationbridging reality andsci-fi.I know thatit willbe far from a smooth ride, but I await to broaden my skill set and knowledge with pleasure, knowing what I will be trying to do is unique, inspiring more intelligent development in the areas that benefitmankind’s future. Huang, Xi",
    "Resume": "XI HUANG linkedin.com/in/xi-h Bay Area, CA xihuang@andrew.cmu.edu EDUCATION CARNEGIE MELLON UNIVERSITY Master of Science – GPA 3.67/4.0 Aug 2022 – Dec 2023 ▪ Software Engineering ▪ GRE General Test: Verbal – 160; Quantitative – 169; Analytical – 4 UNIVERSITY OF TORONTO Bachelor of Science – GPA 3.81/4.0 (Upper years 3.97/4.0) Sep 2016 – Jun 2021 ▪ Computer Science Specialist - Focus in Artificial Intelligence & Computer Vision ▪ Dean’s List Scholar (2017, 2018, 2019, 2021, University of Toronto) RESEARCH RESEARCH ASSISTANT Sep 2022 – present Carnegie Mellon University ▪ Retail Object Recognition, with Dr. Marios Savvides: o Collected and preprocessed image data to expand product detection model validation with unseen data o Trained different visual transformers to categorize retail objects for an automated checkout system for Walmart ▪ Medical Image Analysis, with Dr. Asim Smailagic: o Engineered an efficient solution that combines CNN and wavelet transformation for a diverse set of medical image analysis tasks while preserving patient privacy and accuracy RESEARCH ASSISTANT May 2020 – Apr 2022 The Hospital for Sick Children, University of Toronto ▪ Cardiac Arrest Prediction in the ICU, with Dr. Anna Goldenberg: o Conducted software engineering and machine learning research for the testing and deployment of a cardiac arrest prediction ML model to decrease risks of life- threatening events in the ICU o Built data streaming pipeline using Microsoft Trill to perform data gathering and stream processing for both real-time data and offline data, and created bash scripts for performed testing and benchmarking ▪ Medical Record De-identification, with Dr. Alistair Johnson: o Explored novel NLP and data processing methods for efficiently de-identifying patient information in medical records to enable future medical research o Created python scripts that automates a series of research tasks such as environment setup, model training, and data analysis, connecting Google Colab with tools such as Google Sheets, Google Cloud Platform, and GitHub PROJECTS RESEARCH PROJECT LEADER Jan 2023 – May 2023 “Bug Severity Classification” ▪ Led a 5-member team in developing an automated bug severity classification solution that surpasses current industry standards using NLP on code snippets. Presented course project with favorable feedback from the teaching team RESEARCH PROJECT MEMBER Jul 2021 – Dec 2021 “A Discriminative Transformer for Hate Speech Detection” ▪ Experimented with applying transformers with an innovative loss function in hate speech detection that outperforms existing solutions ▪ Co-wrote and published a paper at an international conference INDUSTRY EXPERIENCES CLOUD ENGINEER Nov 2021 – Jul 2022 State Street Corporation ▪ Investigated and standardized network firewall for company's cloud environment on AWS, currently in use by application teams for secure cloud computing ▪ Developed tools and infrastructure leveraging AWS resources including Lambda, CloudFormation to deploy, monitor, and manage production services and products in the cloud, in use by the operations team SOFTWARE ENGINEER INTERN May 2019 – Apr 2020 State Street Corporation ▪ Designed and implemented a series of internal cloud-based environment-monitoring services using AWS resources, deployed as infrastructure-as-a-service (IaaS) to both external and internal clients ▪ Created a bash script to generate a report of every git branch in the team repository and associate their relevant Jira issues for team workflow management ▪ Created a bootstrapping framework in bash for simplified and standardized environment setup in EC2 virtual machines for daily use by the development team PUBLICATIONS ▪ Tonekaboni, S, Morgenshtern, G, Assadi, A, Pokhrel, A, Huang, X, Jayarajan, A, Greer, R, Pekhimenko, G, McCradden, M, Chevalier, F, Mazwi, M, Goldenberg, A. (2022). How to validate Machine Learning Models Prior to Deployment: Silent trial protocol for evaluation of real-time models at the ICU. In: Proceedings of Machine Learning Research 174:169-182 Available from https://proceedings.mlr.press/v174/tonekaboni22a.html ▪ Huang, X, Xu, M. (2021). An Inter and Intra Transformer for Hate Speech Detection. In: 2021 3rd International Academic Exchange Conference on Science and Technology Innovation (IAECST) 346-349 Available from https://ieeexplore.ieee.org/document/9695652 AWARDS ▪ Undergraduate Student Research Awards (USRA) (2020, NSERC) ▪ Innis College Alumni Association Scholarship (2019, University of Toronto) ▪ Canada Chinese Computer Association Scholarship In Computer Science (2018, University of Toronto) SKILLS ▪ TEAMWORK: Communication, on-time delivery, remote work ▪ LANGUAGES: Python, JavaScript, Java, C, C#, SQL, Bash ▪ TECHNOLOGIES: AWS, PyTorch, Node.js, Express.js, Microsoft Trill, LaTeX"
}