{
    "ID": "739328629",
    "SOP": "Aditi Golder (Applicant for Ph.D. Program at the Columbia University Spring 2024, incoming class) Statement of Purpose My fervor for research deepened during a seminar on \"How to become a Researcher,\" where I volunteered, unaware of the profound impact it would have on my academic journey. Listening to erudite scholars during this seminar served as a catalyst, rekindling a dormant spark of inspiration within me. My path continued to unfold as I enrolled in the \"Artificial Intelligence\" course, a pivotal juncture that drew me closer to the enthralling realm of cutting-edge technology and its multifaceted applications. During this coursework, I did a project blending machine learning algorithms to solve a real-life problem, and I recognized the profound significance of research and its transformative potential in shaping the future. The dream of becoming a researcher has been a constant beacon, with my academic achievements, research collaborations, and hands-on experience driving me toward a Ph.D. in Computer Science, specifically in the challenging area of machine learning applications. During my baccalaureate years, I acquired diverse concepts about system design and analysis, data structure, computer algorithms, software security, network security, data mining, and distinct programming languages. My fascination with healthcare research ignited at this phase. In my final semester, I devised ensemble machine-learning approaches to analyze complex medical data, predicting heart disease and mortality from heart failure, and the results demonstrated the accuracy of predictions, with Artificial Neural Networks achieving a remarkable 91.52% accuracy in predicting cardiac illnesses and a bagging ensemble delivering 90% accuracy in heart failure prediction. As a neophyte, many challenges came in doing this research, such as medical domain knowledge, methodology of performing ensemble machine learning models, and data scarcity. To overcome these, I sought knowledge from cardiologists, read different articles on cardiac diseases, and performed several tuning fits for the hyperparameter of the models, which helped me to carry out my work. Subsequently, I embarked on a thesis exploring the career intentions of female students in programming, where I unveiled the Exception Confirmation Model and Entrepreneurship Event Theory, demonstrating the influence of seven factors on the continuity intentions of female students pursuing programming careers. My undergraduate years instilled in me the discipline of long hours in the laboratory, a habit I have carried forward. I continued to expand my knowledge and expertise and joined Jahangirnagar University, one of Bangladesh's premier institutions for graduate studies, renowned for its rigorous selection process. I proudly achieved the 3rd rank out of approximately 1,200 students on the admission test. Throughout my graduate studies, I maintained a delicate equilibrium between comprehensive study and profound understanding of the subject matter, an approach that yielded rich dividends, evidenced by my GPA of 3.63 and my 3rd rank among nearly 128 students in my batch. Expanding my research horizons, I collaborated to conduct a comprehensive survey on Hate Speech Detection, addressing the scarcity of quality data in the Bengali language. Additionally, I worked on Emotion Detection from Bengali texts. In this research, I proposed two novel models, the CRNN (Convolutional Recurrent Neural Network) hybrid model, and the AdaBoost-Bidirectional Encoder Representations from Transformers (BERT) ensemble model, both outperforming existing models in terms of accuracy, precision, and recall. An empirical study involving six baseline models and five feature engineering techniques further underscored the significance of my research. Currently, I am working on interpretable machine-learning models, trying to use them in the healthcare sector. In my view, a student's merit extends beyond academic excellence and encompasses the Aditi Golder practical application of knowledge. As an undergraduate, I was recognized as a top-up IT Trainee by the ICT division of the Government of Bangladesh. I actively contributed to the Bangla Translate-a-thon organized by GDG Bangla, volunteered for the Google Translate Community, and served as a Google Local Guide. Furthermore, I managed diverse social awareness programs, participated in the university's robotic and cultural clubs, and competed in different programming contests. These activities immensely assist me in growing my leadership ability and confidence in survival in any competitive situation and enrich my rational thinking. To choose my area of specialization at the Columbia University, I am drawn to programs that foster multidisciplinary thinking. In this regard, the research areas offered by the department, like Computational Biology, Security, NLP, Artificial Intelligence, and especially Machine Learning, seamlessly align with my academic aspirations. My research experience and publications position me as a candidate with the requisite technical foundation and genuine research enthusiasm to contribute to interdisciplinary projects in these areas, blending analytical and experimental skills. Whenever I examine the contributions of the world's finest scholars, I yearn to join this illustrious academic community that disseminates automated machine-learning models and global security concerns. I feel that the intellectual mentoring faculty of the Computer Science department at the Columbia University will help me transition between my current aims and my future academic aspirations. I admire the contribution of researchers, which deeply inspired me to join this university Columbia University offers students a life-changing education through its dynamic curriculum, cultural diversity, extensive research opportunities, and excellent faculty. Consequently, a Ph.D. in Computer Science will assist me in becoming a creative and independent researcher. According to Global and US rankings, Columbia is one of the nation's leading research institutions and one of the top universities in the world for entrepreneurs. Furthermore, the university's track record of stellar graduation outcomes, particularly regarding employment rates and graduate or professional school attendance, has further solidified my resolve to choose the university for my Ph.D. education. These statistics reflect the institution's remarkable success and underscore the exceptional competence and preparedness instilled in its students. Such an educational environment is precisely what I seek, as I believe it will enable me to merge academic knowledge with practical problem-solving skills, thereby making a tangible impact on real-world challenges. I hope you will find me a worthy and commendable candidate for the Ph.D. program at your esteemed university. In closing, I sincerely thank the esteemed committee and faculty members for their invaluable time and kind consideration. Aditi Golder",
    "Resume": "ADITI GOLDER aditigolder2384@gmail.com Research Gate Dhaka, Bangladesh, Postal Code:1216 Contact: (+880)1843073557 LinkedIn Google Scholar Highlights of Academic Skills and Research Interest Research Interest : Artificial Intelligence, Computer Vision, Natural Language Processing, Security Threat and IoT. Research Skills : Have hands-on experience in machine learning and deep learning algorithms, extensive data analysis, and medical image data. Professional Skills : Strong analytical and problem solving skills, project management skills, ability to work independently and collaboratively, team management skills, excellent academic writing, verbal and interpersonal skills. Academic Credentials  Master in Information Technology, Institute of Information Technology, Jahangirnagar University (JU), Savar, Dhaka, Bangladesh. Duration: 2014-2018. Dissertation Title: “Online Bookshelf” Advisor: K M Akkas Ali, Professor (JU) CGPA: 3.63/4.00 Rank: 3rd  Bachelor of Science in Software Engineering, Department of Software Engineering, Daffodil International University (DIU), Dhaka, Bangladesh. Duration: 2018-2020. Dissertation Title: “Factor’s Influencing Female Students’ Intension to Continue Career as a Programmer” Advisor: Ms. Nusrat Jahan, Assistant Professor & Head of ITM Department DIU CGPA: 3.18/4.00 Experiences/ Skills  Research Assistant Worked for 1 year as an Research Assistant under Ms. Nusrat Jahan, at Daffodil International University.  Programming Skills Python 3.x, Pytorch, MatLab, JS  Tools and Libraries Hands-on experience in scikit-learn, Tensor Flow 2.x, spreadsheet and statistical analysis (Excel, SPSS).  Soft Skills Word, PowerPoint, Notion, LaTex. Projects  Online Bookshelf Online Bookshelf is a user-friendly virtual library and marketplace for managing book collections, selling, exchanging, and tracking lent books using PHP, HTML, CSS, and MySQL.  Blood Bank Management Online blood management system uses PHP and MySQL for efficient, System organized donation tracking, enabling seamless communication with donors and timely access to life-saving blood donations during emergencies.  E-Learning The web-based system provides teacher-led tutorials, registration, qualification verification, online exams, and a teacher-student blog for interactive learning using C# and ASP.Net. Research Publications  Prediction of Heart Disease and Heart Failure Using Ensemble Machine Learning Models. Conference: International Conference on Machine Learning, Big Data, and IoT, India, March, 2023. (2nd author) [Accepted]  Development of Automatic Number Plate Recognization System of Bangladeshi Vehicle Using Object Detection and OCR. Conference: International Conference on Advances in Data-Driven Computing and Intelligent Systems, Goa, India, 2023. (2nd Author) [Accepted]  CervixMed: Detecting Cervical Cancer based on combinational data using Hybrid architecture. Conference: International Conference on Digital Image Computing: Techniques and Applications, Port Macquarie, Australia, 2023. (2nd Author) [Accepted]  GSM Based Home Security Alarm System Using Arduino Using Mobile Call. Conference: IEEE 14th Annual Ubiquitous Computing, Electronics & Mobile Communication Conference (UEMCON), Columbia, USA, 2023. ( 1st Author) [Accepted]  Security threats on Data-Driven Approaches for Luggage Screening. IEEE Symposium Series on Computational Intelligence, USA, 2023. (1st Author equal contributor) [Accepted]  Leveraging InceptionV3 Model with Data Augmentation to Improve Crop Disease Detection in Bangladeshi Agriculture. Conference: International Conference on Computer and Information Technology, Bangladesh, 2023. [Under Review]  EmoBang: Detecting Emotion from Bengali Text. Journal: Transactions on Asian and Low-Resource Language Information Processing (Impact Factor: 1.471),Q1 (1st Author equal contributor) [Accepted]  Hate Speech Detection in Bengali Language: A Comprehensive Survey. Journal: Journal of Big Data (Impact Factor: 10.835), Q1 (1st Author equal contributor) [Under Review] Reviewing Experience: Reviewer in IEEE Symposium Series on Computational Intelligence. Extracurricular Activity/ Training/ Certification  Participated in the Bangla translate-a-thon organized by GDG Bangla.  Volunteer at Google Translate Community and Google Local Guide.  Member of the Robotic Club of Daffodil International University.  Organizer of various programs such as study tours, orientation and festival programs, fresher’s reception and farewell ceremony, seminars, and cultural programs at DIU. Volunteer at Social awareness, Blood donation.  LICT Top-Up IT training program certification by ICT Division, Government of Bangladesh.  Deep Learning specialization course certification by deeplearning.ai instructed by Andrew Ng.  Six-month Training certification organized by Republic of Korea World Friends ICT Volunteers at Daffodil International University, Dhaka, Bangladesh. English Proficiency Test Score (IELTS) Listening Reading Writing Speaking Overall 6.5 6.0 6.0 6.5 6.5"
}