{
    "ID": "238953425",
    "SOP": "Statement of Purpose Jihwan Kim Full Time Ph.D. in Columbia University/ 2024 Spring I intend to apply for a Ph.D. program at Columbia University focusing on research in security systems and secure machine learning. My goal is to devise solutions that enhance the use of cryptographic algorithms, ensuring high-security levels, and bolster the robustness and security of machine learning. Currently, I am a software engineer in the wallet R&D Group at Samsung Electronics, contributing to the ‘Blockchain Keystore Project’ and ‘Digital Car Key Project’ under the Mobile Experience Division. My role involves developing applications founded on various cryptographic algorithms, such as MPC and ZKP, ensuring optimal security. Recognizing my contributions and potential, Samsung has granted me financial support through their internal fellowship program for my entire doctoral journey. I received my bachelor’s degree in computer science and engineering from Sogang University in February 2015. During my undergraduate years, I was part of the Samsung Software Membership program, An initiative designed to identify and nurture IT talent at an early stage. Here, I undertook several projects including Android game and note-taking applications. These experiences solidified my passion for smartphone – related software research, leading me to join Samsung Electronics. At Samsung Electronics, I was initially with the Samsung Health group, tasked with the porting of sensor drivers in the Android kernel and using HAL to deliver the sensor values Jihwan Kim from the Android kernel to the Android framework. While implementing various protocols and interfaces, such as sysfs, i2c, ioctl, and so on. I delved deep into the operational principles of Android, mastering the platform architecture, which positioned me to contribute to diverse Android projects. Notably, as part of Samsung Health, I enhanced sensor drivers and algorithms for heart rate and SpO2 monitoring, innovations now utilized in the Galaxy Watch. Shifting to the Blockchain R&D Group, I ventured into TrustZone development within the Blockchain Keystore project, sparking my interest in Blockchain research. I've played pivotal roles in the project, from developing signature algorithms for various cryptocurrencies to integrating ZKP algorithms. I managed private keys in TrustZone so that private keys can be stored safely in mobile environments. I developed an application that can hold keys and enable signatures to be made at the TrustZone level and support third-party coin wallets. To elaborate, I developed an algorithm for signatures used in Bitcoin, Ethereum, Klaytn, Stellar, and Tron in TrustZone. In addition, I developed the logic to manage the keys in wallets such as BIP32, BIP44 within TrustZone. Moreover, I developed the Blockchain Keystore app to support third-party DID apps, as well as third-party wallets. I implemented the private data used in the Hyperledger Indy in TrustZone, and also newly implemented the ZKP algorithm and applied it to the app. I implemented various encryption algorithms based on a limited memory and a low-level language in a secure OS environment. Moreover, currently I am trying to search for journals related to the application of Multi Party Computation technology to the Blockchain Keystore app and also trying to implement it in TrustZone. This project is currently used in the Samsung Blockchain Keystore app. The Samsung developer homepage also provides it as a SDK, thus everyone can easily use the APIs related to cryptocurrency. Moreover, I've been actively participating in the Digital Car Key project, collaborating with multiple automobile manufacturers, in line with the standards set by the Car Connectivity Jihwan Kim Consortium (CCC). My focus here is on software that manages private keys in TrustZone, facilitating encrypted communication with automobiles. In the realm of security, I am particularly intrigued by vulnerabilities. I aim to explore groundbreaking algorithms and methodologies that bolster machine learning model resilience against adversarial assaults, while ensuring data privacy. The research endeavors of Professor Junfeng Yang, particularly in secure systems and the robustness of machine learning, align seamlessly with my ambitions. Under his guidance, I am confident in advancing my knowledge, especially relating to cryptographic algorithms and their vulnerabilities. I would like to enroll in a PhD program to research secure systems that operate efficiently and safely in mobile environments. More specifically, my aspiration is to design a platform that democratizes the use of cryptographic technologies in smartphones, particularly through TrustZone. I believe that Columbia University offers the perfect milieu to enhance security technology, ensuring its effective integration into various applications. Upon completing my Ph.D., my vision is to spearhead research in security systems tailored for mobile environments, offering cryptographic algorithms fortified by machine learning and TrustZone. Jihwan Kim",
    "Resume": "Kim, Jihwan Seoul, South Korea Phone: +82-10-9332-4763 Email: jihwan21.kim@gmail.com EDUCATION 03. 2009 – 01. 2015 Sogang University, Seoul, South Korea Bachelor of Science in Computer Science and Engineering WORK EXPERIENCE 06. 2019 – Present Samsung Electronics Co., Ltd, MX Business, Suwon, South Korea SW Engineer, Wallet R&D Group 1. Blockchain Keystore Project Development • Built a trusted application in TrustZone to store a private key for blockchain coins and sign each supported coin (BCT, ETH, TRX, etc.) - Developed ECDSA, EDDSA algorithms and BIP32, BIP44 in TrustZone • Developed a trusted UI in TrustZone to show mnemonic and transaction UI • Developed DID API using Hyperledger Indy in TrustZone to engage third-party applications such as driver license apps - Developed ZKP algorithm in TrustZone level 2. Digital Car Key Project Development • Instituted secure communication between car and phone based on Car Connectivity Consortium (CCC) Specification in TrustZone - Developed an Android framework application to communicate between normal OS and secure OS using Android Studio Tool - Responsible for developing crypto algorithms in C, Cpp language in TrustZone and embedded Secure Element (eSE) • As a member of the Car Connectivity Consortium (CCC), responsible for modifying specification documents to establish standard specifications • Currently providing the commercialized Digitalkey application to BMW, KIA, and Genesis, and plan to cooperate with various automakers such as Volkswagen and Volvo 01. 2015 – 05. 2019 Samsung Electronics Co., Ltd, MX Business, Suwon, South Korea SW Engineer, Health R&D Group Headed the coding and development of software for a mobile application for Galaxy smartphones renewed every year 1. Android Kernel Sensor Driver Development 1 • Ported IR-RED LED sensor driver in Android kernel when the sensor chipset or mobile was renewed • Implemented algorithm to obtain highly accurate bio-signals by adjusting HW sensor performance according to skin tone or skin adhesion 2. Heart rate, SpO2, Stress Algorithm Development • Designed and developed signal processing algorithm using MATLAB and Visual Studio Tool to get heart rate, SpO2, and stress level (for mobile and smartwatch) • Developed lightweight heart algorithm to fit in low-memory products such as Galaxy Fit • Related Patent: US201815937668, US201916964087 RESEARCH EXPERIENCE 07. 2013 – 06. 2014 Samsung Electronics Software Membership Program, Seoul, South Korea • Initiated a tank game using an actual mini tank and mobile controller (08-10. 2013) - Installed Arduino HW in a mini tank and developed an Android application to control the tank with a mobile controller - Attached a camera to the tank so that users can see the real-time movement on a mobile controller screen • Developed a cross-platform online RPG game (01-03. 2014) - Developed a mutual online RPG game on both mobile and window side using Unity 3D. - Managed client platform to guarantee real-time communication between mobile and window using an IOCP server • Developed a multimedia note app in Galaxy Note (06-09. 2014) - Developed a note app that allows users to take notes while watching a video lecture - Implemented the app to automatically record the time zone to take notes and play the video part of each time zone stored in each word - Managed SPen SDK and time sync between video and write time using Android Eclipse Tool PATENT [1] Electronic device having partial ledger in blockchain network and operation method thereof Number: WO2022260501A1 / Date: 2022.12.15 [2] Electronic device and method for measuring biometric information Number: US2018276448A1 / Date: 2018.09.27 Number: EP3381369A1 / Date: 2018.10.03 Number: CN108652594A / Date: 2018.10.06 Number: KR20180109328A / Date: 2018.10.08 [3] Electronic Device for Acquiring Biometrics Using PPG Sensor, and Method Therefor Number: US2021030290A1 / Date: 2021.02.04 Number: EP3721795A1 / Date: 2020.10.14 2 [4] PPG The Electronic Device and The Method for Obtaining Bio Information by Using A PPG Sensor Number: KR20180013842 / Date: 2018.02.05 [5] ELECTRONIC DEVICE FOR MANAGING PASSWORD AND OPERATING METHOD THEREOF Number: WO2022197059A1 / Date: 2022.09.22 Number: KR20220129333A / Date: 2022.09.23 AWARDS, SCHOLARSHIPS AND HONORS 06. 2022 Excellent Publication Award / Korea Society of Blockchain 09. 2016 Expert Programmer / Algorithm Certificate from Samsung Electronics 11. 2013 2nd prize/ ACM programming contest / Sogang university 11. 2012 2nd prize/ ACM programming contest / Sogang university VOLUNTARY/ EXTRACURRICULAR ACTIVITIES 03. 1997 – 12. 1997 Eulji Elementary School, Seoul, South Korea 12. 1997 – 06. 2008 New yuying International School, Qingdao, China CERTIFICATES & SKILLS Language English OPIC: IH(Intermediate High) Chinese: Advanced (Mandarin) Others Expert Programmer (Algorithm Certificate from Samsung Electronics) C, C++, C#, Java, Kotlin, Python Driver's License 1st Class(Ordinary) 3"
}