{
    "ID": "223323625",
    "SOP": "Fatemeh Safari Email: fsafari92@gmail.com Phone: (906) 231-4279 As I embark on the path to doctoral studies, I am drawn to the dynamic research environments led by Professors Juchem and Hillman at Columbia University. The innovative work at the intersection of engineering and healthcare in both Labs resonates deeply with my academic trajectory and aspirations. My role as a Research Associate at NYU Grossman School of Medicine equipped me with valuable insights into the convergence of engineering principles with medical applications. Notably, my involvement in the development of a Microwave Medical Imaging Prototype for Stroke Classification and Localization heightened my appreciation for the transformative potential of engineering in healthcare. This experience has fortified my resolve to contribute meaningfully to advancing medical technologies. Upon reviewing the MR Science Lab’s emphasis on magnetic resonance imaging (MRI) and spectroscopy, I am excited by the prospect of contributing to projects that push the boundaries of MRI technology. My proficiency in electromagnetic field simulations positions me well to enhance hardware solutions for healthcare applications. Additionally, my experience in PCB design and 3D printing aligns seamlessly with the lab's commitment to innovation in healthcare technology. The groundbreaking work at the Laboratory for Functional Optical Imaging, focusing on in vivo imaging and microscopy techniques, is equally compelling. My strong foundation in electromagnetics, spectroscopy, and quantum mechanics from my undergraduate studies in physics will be invaluable in delving into advanced optical imaging methodologies. This background lays a solid foundation for contributing to projects exploring neural dynamics and functional imaging. Upon completion of my doctoral studies, I aspire to merge my expertise in electromagnetic field simulations, MRI technology, and optical imaging methodologies. My goal is to pioneer advancements in imaging technologies that have a direct impact on clinical diagnostics and interventions. By bridging the gap between engineering innovation and healthcare outcomes, I aim to contribute to a new era of precision medicine. I am drawn to Columbia Engineering not only for its academic excellence but also for the vibrant research community that fosters collaboration and innovation. The opportunity to engage with distinguished faculty members, including Professors Juchem and Hillman, and work alongside fellow scholars who share a passion for engineering in healthcare is an unparalleled opportunity for my academic and professional growth. The Juchem Lab's and Hillman Lab's pioneering work in developing advanced imaging methodologies, including MRI and optical techniques, is a testament to their commitment to pushing the boundaries of medical imaging. I am particularly excited about the potential to contribute to research projects that have a direct impact on patient care and to be part of a community dedicated to advancing healthcare technologies. In conclusion, I am enthusiastic about the prospect of joining the Juchem Lab and the Hillman Lab, along with the Department of Biomedical Engineering at Columbia University. With an unwavering commitment to excellence and a passion for engineering solutions in healthcare, I am eager to embark on this transformative academic journey. Thank you for considering my application. Sincerely, Fatemeh Safari Email: fsafari92@gmail.com Phone: (906) 231-4279",
    "Resume": "Fatemeh Safari Email: fsafari92@gmail.com,Phone: (906) 231-4279 EDUCATION Michigan Technological University(MTU) | Houghton, MI May 2020 MSc Electrical Engineering University of Mazandaran | Mazandaran, Iran February 2015 BS Physics PUBLICATION 1. E. Hedayati, F. Safari, G. Verghese, V. R. Ciancia, D. K. Sodickson, S. Dehkharghani, and L. Alon, ”An experimental system for detection and localization of hemorrhage using ultra-wideband microwaves with deep learning,” arXiv:2310.02215, 2023. [Online]. Available: https://arxiv.org/abs/2310.02215. 2. O. Yaghmazadeh, S. Schoenhardt, A. Sarabandi, A. Sabet, K. Sabet, F. Safari, L. Alon, and G. Buzs´aki, ”In-vivo measurement of radio frequency electric fields in mice brain,” Biosensors and Bioelectronics: X, vol. 14, pp. 100328, 2023. [Online]. Available: https://www.sciencedirect.com/science/article/pii/ S2590137023000250. 3. S. Jamilan, N. P. Gandji, G. Semouchkin, F. Safari, and E. Semouchkina, ”Scattering from Dielectric Metasurfaces in Optical and Microwave Ranges,” IEEE Photonics Journal, 2019. 4. S. Jamilan, G. Semouchkin, F. Safari, and E. Semouchkina, ”Interference Phenomena at Resonances in Dense Silicon Metasurfaces,” in Proceedings of PhotonIcs & Electromagnetics Research Symposium, Rome, 2019. PROFESSIONAL/RESEARCH EXPERIENCE Research Associate in Radiology, NYU Grossman School of Medicine Sep 2020 - Aug 2023 • Microwave Medical Imaging Prototype for Stroke Classification and Localization – Designed electronic printed circuit boards and a switch matrix on PCB up to 4 GHz using KiCad. – Developed UWB unidirectional Vivaldi antennas for medical imaging purposes using HFSS. – Designed and manipulated CAD models for 3D printing, which included an anthropomorphic human head phantom for pre-human testing, antenna holders, different mounts, and more. – Created dielectric tissue-mimicking solutions at 64MHz-6GHz with similar dielectric parameters to the human brain, muscle, and blood – Studied the electromagnetic response, behavior, and penetration of the designed UWB unidirectional Vivaldi antennas in a heterogeneous head model using CST Microwave Studio. – Contributed to the design of a 2x8 port PCB switch matrix functional up to 10 GHz, including simulating various transmission lines, vias, and coaxial launches. – Assisted with data collection from the stroke detection test bed prototype to validate system perfor- mance. – Contributed to the construction of a 2x16 switch-matrix functional up to 12 GHz, encompassing shift- register design, mechanical assembly, soldering, organization, and 16-port calibration. – Facilitated component-level testing and troubleshooting setups for PCBs. – Collaborated in a multidisciplinary team of engineers, physicists, and medical professionals. – Facilitated the procurement of a 2-port Vector Network Analyzer (VNA), including vendor selection, negotiation, and finalizing the purchase. Several manuscripts are currently under review or in preparation for publication. Master Student, MTU Sep 2018 - May 2020 1 • Electromagnetic Response from Dielectric Metasurfaces – Investigated scattering parameters of dense and sparse arrays of dielectric resonators (metasurfaces) using CST Microwave Studio. – Conducted simulations to explore the parameter correspondence with Magnetic Dipole Resonance (MDR) and Electric Dipole Resonance (EDR), referenced in published work [jamilan2019scattering]. • Electromagnetically Induced Transparency in Metasurfaces – Simulated metasurfaces with arrays of cylindrical resonators using electromagnetic field simulation software (CST Microwave Studio and COMSOL Multi-physics) to find structures which provides EIT- like response – Discovered that EIT-like response has no correlation to MDR – It was shown that the EIT-like response happens at the EDR frequency and the slow-light effect can be observed – Found the group index velocity using MATLAB from transmission phase – Verified the simulations by performing experiments using dielectric cylinders in microwave range (10- 12GHz) by X-Band horn antennas TEACHING EXPERIENCE • Michigan Technological University – Developed an online version instruction (using NI Multisim) of ”AC magnitude and Phase” for circuits and instrumentation course’s lab for non-major students during the COVID-19 pandemic, Spring 2020 – Circuits and Instrumentation (EE3010) Lab Instructor for EE, CE, BME, and ME major students, Fall & spring 2019/20, Fall 2018/19 – Electric Circuits II (EE2112) Lab, Lab Instructor for EE and CE students, Spring 2018/19 – Co-Developed a course design for fundamental physics laboratory III, 2012 SOFTWARE AND TECHNICAL SKILLS • COMSOL Multi-Physics • ANSYS Electronic • CST Microwave Studio • AutoCad Desktop (HFSS) • NI LabVIEW • Autodesk Fusion 360 • MATLAB and Python • PCB Routing (LPKF Protomat D104, H100) • Autodesk Inventor • Autodesk Eagle • 3D Printing (Fortus, Phrozen, Any- • NI Multisim • KiCad cubic) SELECTED PROJECTS OF COURSES • New Design of Patch Based Uda-Yagi; Special topics in Antennas Spring 2020 An Uda-Yagi Antenna can be improved by placing Patch antennas in place of some or all of its elements (including the reflector, driven element and directors). My goal was to increase the Uda-Yagi’s bandwidth in 3GHz+ frequency. The model has been simulated in ANSYS Electronic Desktop(HFSS). In order to learn how an Anechoic chamber works, a dipole antenna was simulated in COMSOL Multi- physics, then built and tested in the Anechoic chamber to verify the performance of the antenna antenna. • OptimizingaPatchAntennawithaMetasurface; AdvancedMicroElectroMechanicalSystems Spring 2020 Employing a metasurface with cylindrical resonators as its unit cells on top of a patch antenna to reduce 2 the return loss and improve the gain which can be useful in medical devices. The antenna and the model have been simulated by ANSYS Electronic Desktop(HFSS). • Design of a matched 50 ohm Feeding-Line Insert Fed microstrip Patch Wi-Fi Antenna for 2.45GHz; Microwave & Antenna Engineering Spring 2019 First based on the target center frequency the dimensions of our patch antenna was calculated. Then, using CST Microwave Studio software the antenna was modeled. In the simulation phase, different substrate permitivities have been tested to optimize the maximum radiation efficiency at the anntena’s resonant frequency. PRESENTATIONS • Michigan Technological University 1. How to simulate a dipole antenna in COMSOL, Special topics in Antennas (02/2020) 2. Carbon Nanotube Field Effect Transistors, Solid state Devices (03/2019) 3. Dielectric meta-surfaces, Electronic Materials (12/2018) • Iran University of Science and Technology 1. Vacuum pump evacuation rate and its calculations, Vacuum Techniques (04/2014) 2. Kramers-Wannier Duality of Statistical Mechanics Applied to the Boolean Satisfiability Problem of Computer Science, Statistical Mechanics (12/2013) 3"
}