{
    "ID": "134186870",
    "SOP": "In my opinion, the most important thing anyone can achieve in their life is a sense of purpose. While it varies from person to person, for me, it is clearly relevant in the field of science and technology, more specifically in the field of mechanics; improving the lives of common people through technical development. So I would like to pursue a doctoral degree in engineering mechanics from Columbia University. I am currently obtaining a master’s degree in computational engineering at Leibniz Universität Hannover and I have faith in the quote said by the greatest scientist Albert Einstein:“ Tell me and I forget; teach me and I may remember; involve me and I learn.” This quote inspires and motivates me to engage in research in the field of mechanics, through which I am able to expand my knowledge and also contribute to it. I was born and raised in a small town in eastern India. I consider myself fortunate because I was raised in a culture where knowledge is more valued than money. Thus, pursuing knowledge by achieving a higher degree is very common in our society. I have completed my bachelor's from Jadavpur University, one of the most prestigious universities in my country, majoring in Mechanical Engineering and during this period of my education I have realized that knowledge is boundless and whatever you have thrived is never enough; one must continuously learn and refine his or her skill to make a difference someday. Since my second year of bachelor's, I have involved myself in research work, which marks the beginning of my learning. I have started to develop skills that are needed in the field of mechanics, through which I was able to publish several research journals during my bachelor's, contributing to the mechanical society. Yet, after successfully completing my bachelor’s degree, when I was offered a job at Reliance Industries Ltd. in Jamnagar Complex, the largest refinery in the world and a notable global brand, I was very keen to join. The reason being, the job profile I got is among the best in the industry, as Reliance has a wide range of machinery with some advanced technologies and exposure to such an industrial environment provides me with a better understanding of the growing technologies and their demand. I was ready to explore the opportunity, as I always crave new experiences and challenges. Even with my bachelor's degree and first-hand experience in an industry, I never felt like an expert and had the eagerness to learn more. To widen my expertise, I started my master's at Leibniz Universität Hannover, one of the TU9 of Germany, in the field of computational mechanics. Through my master's courses, I was introduced to several new concepts in the field of mechanics such as advanced FEM analysis, stochastic analysis, uncertainty quantification, model order reduction, ML in mechanics and several others. Similar to my bachelor's approach, I have started working in parallel with my course work as a research student in the IBNM department of the university. Through this opportunity, I have developed technical skills to solve coupled equations in FEM, while simultaneously contributing to open source communities on GitHub such as FEnics and RBnics. Soon I was offered a project at Continental Reifen Deutschland GmbH to develop a framework to produce Hexahedral meshing for their tire tread patterns. To add to my achievement, the framework developed can produce hex-mesh automatically, through which the simulation time and accuracy have significantly increased, which adds to savings in computational time and cost. Physics and mathematics are the subjects where I have always found my interest, especially the concepts of Newtonian mechanics. During my schooling, I extensively studied it out of interest and even participated in school exhibitions, building some real small machinery stuff, and thus I was a person whom my peers contacted when they needed some discussion or to clear any doubts on this topic. Throughout my life, I have always tried to be in the good books of people, which has eventually helped me. Through sheer motivation and not-easily-giving-up skill, professors in my universities have given me immense support and motivation to pursue a doctoral degree in the field of mechanics. Through my professors, I have been in contact with Prof. Haim Waisman at Columbia University. I have found the work of Prof. Waisman team very fascinating, and the work on the topics of material topological advancement and phase-field interactions has enthralled me. I have always been engulfed in innovative work and have gained good knowledge in the field of mechanics through my learning and work experiences. I am proficient in several programming languages, such as MATLAB, Python, and C++. Likewise, I have developed my coding skills not because of coursework or coding materials but through my involvement in writing codes for the research topics I have been working on. I am also well-equipped with various simulation and modeling software packages like AutoCAD, ANSYS and SolidWorks. Several of my research projects required simulating and modeling tasks, and I have become quite handy with a lot of software packages and am open to exploring new ones as well. One thing I have realized during my work is that these commercial software packages are very costly to use and many researchers lack the funds to use them and proceed with their work. So in order to motivate people to contribute more to research, I have always favored the use of open source software like Julia, OpenFoam, FEnics, Gmsh and several others. In this way, one significantly decreases the cost involved in a project, and for the development of these open source software packages, I have contributed to it too through some tutorials in their GitHub community. It is one of my strongest desires to make these open- source environments capable enough to solve all kinds of complex problems, which will motivate a huge research group to pursue their work further. This urge for research can be traced back to my childhood. As a curious child, I was a voracious reader of science magazines and always tried to build some small stuff, which pleases me. Reading books has significantly enhanced my imagination capability, and enacting those knowledge is something I believe is one of my greatest strengths. In addition to the above, I consider creativity an important aspect of my character. From childhood, I never wanted to follow the masses. For me, one of my biggest achievements in life was when, in 12th standard, I was the zonal topper in physics out of around 8,000 candidates in the FTRE organized by FIITJEE and also when I, along with one of my academic professor, published my first research paper. I was even selected for the INAE scholarship for my summer internship, which chooses only 50 students throughout the country. The joy felt after having the first positive results from the work was immense. But I found similar satisfaction and pride when I made my first piece of music with lyrics, or wrote my first poem for my school magazine. Maintaining my eagerness to learn and explore the field of mechanics while strengthening my skills and expertise, I want to pursue a doctoral degree in this field. Columbia University, part of the Ivy League, has an extravagant reputation as a university throughout the world. Pursuing my doctoral degree at this university will have a very great impact on my career and work. The research at this university from the engineering mechanics department has fascinated me and I am eager to join the department to learn from them and work with them. Through my several meetings with Prof. Waisman in engineering mechanics, I have been allured by the work of his team. I want to join Prof. Waisman team and work on his project topics related to XFEM and material topology. Under his leadership and guidance, I can learn and see myself grow, expanding my expertise and contributing to the field of computational mechanics. Postgraduation from Columbia University will boost my profile and knowledge exponentially and it will help me grasp greater opportunities in the near future.",
    "Resume": "EXPERIENCE GOP AL 10/2022 – ongoing – RDBT/VD-CVT/TTM, Continental Reifen Deutschland GmbH, Hannover AGA RWAL Master Thesis (10/22-03/23), Supervisor: Dr. Ing. André Lutz Intern (04/23-ongoing) Supervisor: Dr. Ing. André Lutz Framework development for automatic hexahedral mesh generation for tire tread patterns and improvement in contact pressure distribution for tire footprint simulation. 05/2022 –09/2023 – IBNM, Leibniz Universität Hannover HiWi (Research Assistant) Working on poroelasticity and viscoelasticity of hydrogels using FEnics and Python. 12/2021 – 02/2022 – IRZ, Leibniz Universität Hannover HiWi (Research Assistant) Worked on uncertainty quantification, developed algorithms and PROFILE codes for reliability analysis. A quick learner and an active listener 07/2019 – 03/2021 – SEZ-Px4, Reliance Industries Ltd. willing to gain a strong foundation in Maintenance Engineer computational mechanics, solid Establish maintenance strategy in a team for improving productivity. modelling and simulations. With a focus Prepare data and information for making regular maintenance and also on machine learning towards a spares report, data analysis. career in development and integration. 05/2018 – 07/2018 –Department of Mechanical Engineering, IISC Bangalore Research Intern Work under the guidance of Prof. Saptarshi Basu on the project- gopalagarwal1259@gmail.com Acoustic Characterization of a High Shear Injector. 12/2017 – 01/2018 - TATA Steel Kalinganagar Intern Work on the project- Review of Energy Source Identification and +49 1521 7730515 study on hydraulic systems. 05/2016 – 06/2016 - ICMPL, Sipcot Industrial Park Gopal Agarwal Intern Familiarization of the plant operations and departments, and management overview of the production process. Gopal Agarwal EDUCATION 04/2021 – ongoing Indian M.Sc. Computational Methods in Engineering Leibniz Universität Hannover Male Grade – 1.5/5 | (Best Grade – 1.0) 08/2015 – 04/2019 LANGUAGES B.E. Mechanical Engineering Jadavpur University Hindi CGPA – 8.52/10 | (Best Grade – 10.0) English 05/2014 – 04/2015 Indian School Certificate German M.C. IKnteejrrniawl al Vidhyapeeth Percentage –91.25% PUBLICATIONS • ‘A Study on Low Velocity Impact Behaviour of Functionally Graded Sandwich Conical Shell Under Thermal Environment’, DOI:10.1115/GTINDIA2021-73468, Dec 2021, ASME 2021 Gas Turbine India Con ference • ‘Fre7e Vibration Analysis of Functionally Graded Sandwich Conical Shell Using FSDT’, DOI:10.1115/GTINDIA2021-73468, Nov 2021, Recent Advances in Computational and Experimental Mechanics, Vol—I (pp.31) • • ‘Experimental Study of Static and Dynamic Load Test of Railway Wagon Bogie’, Aug 2021, Progressive Research in Industrial & Mechanical Engineering (PRIME - 2021) • ‘Investigation of Torsional Stability and Camber test on a Meter Gauge Wagon’ paper presented in ISTAM 2018 conference and published in Springer book title ‘Advances in Fluid Mechanics and Solid Mechanics’. (DOI: 10.1007/978-981-15-0772-4_24) • ‘Optimization of the stress discontinuity value at the interface of a cylindrical stainless-steel substrate and electroless Ni-P coating’ paper published in Material Research Express. (DOI: 10.1088/2053- 1591/ab431c) • ‘Free Vibration Characteristics of Sandwich Conical Shells with FGM Face Sheets: A Finite Element Approach’ paper published in ASME GT India 2019 conference. (DOI: 10.1115/GTINDIA2019-2545) • ‘Time Dependent Low Velocity Impact Response of Turbomachinery Blade Made of Porous Exponential FGM’ paper published in ASME GT India 2019 conference. (DOI: 10.1115/GTINDIA2019-2785) • Compression, tension & lifting stability on a meter gauge flat Wagon: an experimental approach published in Australian journal of mechanical engineering. (DOI: https://doi.org/10.1080/14484846.2020.1775007) TECHNICAL SKILLS • Python • AutoCAD • Microsoft Office • MATLAB • PyTorch • CREO • FEnics • Gmsh • C++ Programming • OpenFoam • Java • Ansys EXTRA-CURRICULAR • Completed Finite Element course in coursera by University of Michigan. • Completed Machine Learning course in coursera. • Participated in an aircraft’s workshop and designed a remote operated plane. • President of the Jadavpur University ISHRAE chapter 2018-19 and Secretary of the Jadavpur University ISHRAE chapter 2017-18. • Gold medallist for the Zonal topper of the Kolkata region in physics in the FTRE exam."
}