{
    "ID": "032288797",
    "SOP": "Personal Statement PhD in Chemical Engineering Yipeng Zhang Columbia University 2023/08/29 I still remember the feeling when I was accepted into the Chemical Engineering Master of Science Program at Columbia University. I felt delighted to be accepted to my dream school, but I also felt pressure. I knew it must be a difficult process, and I was worried that I would not be able to overcome these challenges. The admitted students were all outstanding, and I doubted my qualification to study and compete with them. But very soon, I turned this pressure into motivation. At the end of the orientation day, I stood under the Alma Mater statue, appreciating the beautiful campus under the golden sunset, with one ambitious fantasy in my mind — becoming a PhD student at Columbia. Now, as I enter the last semester of my MS degree, I feel confident that I will succeed as a PhD student in a research group at Columbia. I received my Bachelor of Science in Chemical Engineering from University at Buffalo, SUNY in 2022. In my undergraduate, I took fundamental courses in chemistry and chemical engineering, which provided me with basic knowledge for doing research. I also mastered how to use MATLAB and Python as tools for data analysis. My first research experience as an undergraduate was with Dr. Kun Zheng’s group at the Institute of Chemistry Chinese Academy of Sciences for summer research. Dr. Zheng’s research focuses on designing materials with high thermal performance. I participated in the project to enhance the interfacial thermal conductance of epoxy and alumina composite interfaces. I co-authored one article on this research in Journal of Physics: Conference Series. My next project involved the synthesis of boron nitride nanosheet (BNNS) polymer composites with high out-of-plane thermal conductivities. I put my effort into doing literature reviews, experimental scheme formulation, and the compilation and sorting of articles. The experience from that summer was my first introduction to scientific research. Due to the COVID-19 pandemic, I was unable to be present in the lab to hold reactions and characterize samples by hand. This sparked my eagerness and curiosity about the synthesis and characterization of those materials in the laboratory setting. Prof. Sanat Kumar provided me with an opportunity to satisfy this desire and curiosity. I joined his research group in the first semester in Columbia, guided by a PhD student who is my mentor. The first project I participated in was the synthesis polymer-grafted nanoparticles (GNP) via surface-initiated atom transfer radical polymerization (SI-ATRP). I learned the fundamentals of ATRP with my mentor and started a series of experiments. Besides reading articles and taking part in the design of the experiment, I gained valuable experience in ATRP synthesis, and using multiple instruments like TGA, GPC, DLS, SAXS, and glove box to characterize the grafted nanoparticle materials. After collecting and analyzing the data, we discussed them with Prof. Kumar during the weekly project meeting and listened to his guidance and suggestions. I focus my contribution on the synthesis and characterization of different GNP samples. A key material parameter is the particle grafting density, i.e., the number of chains connected to the particle. To measure the grafting density of these particles, I carried a series of polymer-chain cleaving reactions with tetra-n-butylammonium fluoride (TBAF) and characterized the molecular weight distributions of the polymer chains via gel permeation chromatography (GPC). Besides knowing the molecular weight distributions, I also found a small excess of TBAF is enough to cleave the chains from the particle surface and that a large excess of TBAF will break the poly (methyl acrylate) chains. These findings pushed the project forward. Participating in the weekly group meetings is another component of my master’s research. I had the fortune to give one research update to the group members. I made the presentation slides carefully by analyzing data and plotting figures precisely. I practiced my speech with concentration, trying to find the clearest way to explain my research content. I presented with enthusiasm during the group meeting, reporting my work to my peers and letting them feel how familiar I am with my research topic. At the beginning of this summer, my mentor decided to start another project with me. This project is aiming to make anion exchange membranes with quaternized amine fixed charges. This project is a part of an ongoing collaboration with Prof. Ngai Yin Yip’s in Earth and Environmental Engineering. Thanks to my previous experience of conducting ATRP synthesis, it is easy for me to synthesize the co-polymers and characterize them using GPC. In the future, I plan to use H-NMR to identify the chemical species and their composition in the copolymers. The coursework at Columbia provides me with a broader perspective of chemical engineering. I took Prof. Alexander Urban’s atomistic simulations course in the second semester and performed well. In this course, we were introduced to simulation and computation methods for predicting the structure and properties of materials, such as Lennard-Jones potential, Density functional theory, Monte Carlo simulation, and Radial Distribution Function. By doing the course projects, I saw how these abstract theories can be concretized with data and figures. I realized that simulation is a powerful approach for developing new materials besides laboratory work. Additionally, I took Prof. Daniel Esposito’s kinetic course in the same semester. In his course, I learned how to predict the reaction rate and design a reactor by reaction conditions. I also learned the principles of surface reaction (Langmuir isotherm and BET isotherm) and collision theories. I believe these will benefit my future research a lot. Both my undergraduate and graduate research experience make me interested in soft matter, polymers, nanoparticles, and composite materials. In the future, I want to learn and research more about their synthesis, characterization, and applications. I also want to know more about surface chemistry and surface structure for materials and make them be used as fillers, membranes, electrodes, or catalysts. To achieve the target above, I would like to use both laboratory and computation skills. After these years of study and research, I start to realize what scientific research is: it is not only working hard to master synthesis techniques and instrument operations for pursuing experiment results fitting the expectation. It is more like a pursuit of knowledge and truth. Accept an experimental result even if the results may be far from what I want. Try to use the knowledge to explain these results. Share your results with your colleagues and learn from them. Read literature to see if others have measured similar results. Find possible flaws in the experiment. Iterate this process until you make progress. Hard work is the character that a master's student who is new to scientific research should possess, most of us applicants have had it. The ability to conduct independent research may be rare among us, and it is an indispensable quality of a doctoral student. I think, luckily, under the guidance of professors and my mentor, I have initially developed the ability to independently engage in scientific research and cultivated this quality. Conducting research and problem-solving have both become parts of my life. I am eager to investigate more new knowledge in the future with faculty members at Columbia and to make my own contribution to the field. I believe my research experience, skills, and qualities can make me a successful PhD student in Columbia Chemical Engineering. Now, I put my hands off the keyboard, and I leave my desk. Again, standing in front of the Alma Mater statue, gazing at the campus bathed in autumn sunlight, a warm feeling rises in my heart.",
    "Resume": "Yipeng Zhang Mailing Address: 43-15 52nd St, Apt 4G, Woodside, NY, 11377 yz4290@columbia.edu +1 6462207846 EDUCATION School of Engineering and Applied Sciences, University at Buffalo (SUNY) B.S. in Chemical Engineering (Cum Laude) Fu Foundation School of Engineering and Applied Science, Columbia University M.S. in Chemical Engineering RESEARCH EXPERIENCE Institute of Chemistry Chinese Academy of Sciences, Advisor: Dr. Kun Zheng May 2021 – October 2021 ● Participated in the project aims to improve the Interfacial thermal conductance between filler and polymer matrix using surface treatments. ● Participated in the study of boron nitride nanosheet polymer composite with high out-of-plane thermal conductivity. ● Co-authored an article published in the Journal of Physics: Conference Series. Chemical Engineering, Columbia University, Advisor: Prof. Sanat K. Kumar September 2022 – Present ● Synthesized polymer grafted silica particles via atom transfer radical polymerization (ATRP) for gas permeation membranes and polymer-particle composite characteristic studies (DSC, XPCS, TEM). ● Synthesized quaternized poly (styrene-co-vinyl benzyl chloride) for anion exchange membrane. ● Reviewed literature and studied the kinetics of ATRP polymerization. ● Get trained on diverse techniques to characterize polymer and nanoparticle materials, including TGA, GPC, DLS, and SAXS. Analyzed data obtained from these instruments via Python and MATLAB. PUBLICATION Wei Yang，Yun Chen，Yipeng Zhang，YongSheng Fu，Kun Zheng，Kun Wang，YongMei Ma, “Thermal conductance of epoxy/alumina interfaces”, presented on 2021 International Conference on Advanced Materials and Mechatronics, Kunming·China, publish on Journal of Physics: Conference Series (ISSN: 1742-6588) STUDENT GROUP EXPERIENCE Columbia Chinese Orchestra (CCO), Columbia University May 2023 – Present Suona (a traditional Chinese instrument) performer. SKILLS Laboratory: Thermogravimetric analyzer (TGA), gel permeation chromatography (GPC), dynamic light scattering (DLS), small angle x-ray scattering (SAXS), UV-Vis, and glovebox. Programming and software: MATLAB, Python, Polymath, UniSim Design, Microsoft Office."
}