{
    "ID": "695983193",
    "SOP": "Jacynthe Francoeur Biomedical Engineering Department 971 rue Galilée Columbia University Beloeil, Qc, Canada, J3G 6M1 Graduate School of Arts and Sciences jfcoeur@hotmail.com 500 W. 120th St +1 450-341-4112 New York, NY, USA, 10027 October 15th, 2023 Dear Admissions Committee, I am keenly interested in joining the Biomedical Engineering Ph.D. program at your respected institution. My combined interests in mechanical and biomedical engineering align well with the research conducted by some of your faculties, such as Professor Sunil K. Agrawal, who trains robots to aid humans in regaining or improving functional movements. Given my academic and research background, I am eager to pursue a Ph.D. that prioritizes in-depth study and creative problem-solving. I am particularly excited about the chance to contribute to the field of robotics for biomedical purposes at your distinguished institution. The blend of cutting-edge research, respected faculty, and vibrant academic community there provides an ideal environment for achieving academic and research excellence. Ever since I was young, I've been fascinated by biology, mathematics, and physics. This led me to the field of biomedical engineering, which beautifully combines these subjects, ensuring ongoing learning and innovative work. Biomedical engineering is ever-changing, keeping things fresh and offering the rewarding potential of enhancing people's health. I've grown to love both prototyping and software development because of the field's interdisciplinary nature. My academic journey has been driven by a strong enthusiasm for interdisciplinary research. The focus of my current master’s degree has been on fiber optic sensors used in minimally invasive procedures, especially for diagnosing and treating occlusive arterial disease and prostate cancer. Jacynthe Francoeur Under the supervision of Professors Samuel Kadoury and Raman Kashyap, I designed a fiber optic sensor with the aim of integrating it into medical tools and robotic systems for multimodal sensing, like flexible needles and catheters. This work highlights my expertise in fiber optics and various detection methods, while also drawing connections between my research interests and the work of Prof. Sunil K. Agrawal, for instance. I'm driven by a profound passion for research, motivating me to pursue a Ph.D. in your program with an emphasis on medical robotics. This degree is not just another qualification for me; it represents a foundational step in my career. Undertaking it will not only deepen my expertise in the field but also expand my career prospects in both academia and the industry, perfectly aligning with my long-term aspirations. While I cherish my Canadian roots, the unparalleled academic and research opportunities in the U.S. make relocating a compelling choice. The U.S. is particularly appealing because of its robust support for biomedical research, fostering a vibrant atmosphere for innovation. I am particularly attracted to industry roles in biomedical engineering due to their structured environments, allowing me to concentrate on research and innovation without the administrative burdens often found in academia. Ultimately, earning a Ph.D. from a prestigious institution like yours would set the stage for a rewarding career that balances professional achievements with personal well-being. During my academic journey, I've been lucky to win many scholarships. Some notable ones came from the Natural Sciences and Engineering Research Council of Canada (NSERC) and Fonds de recherche du Québec Nature et technologies (FRQNT). Among these, the Fayolle Canada United States’ Prestige scholarship really stands out. Only two students from Polytechnique Montreal get Jacynthe Francoeur this each year. With this scholarship, I got to do a five-month internship at Johns Hopkins University. There, I worked closely with Prof. Iulian Iordachita at the Laboratory for Computational Sensing and Robotics (LCSR). We created a special needle with fiber Bragg grating strain sensors for certain prostate procedures. We then shared our findings in a paper for the International Conference on Robotics and Automation (ICRA) in 2024. Furthermore, one of the standout moments in my academic journey was my participation on a project closely tied to my master's research with Boston Scientific. This collaboration led to several achievements: a presentation at the Optical Sensors and Sensing Congress 2022, a poster at COPL 2022 Annual Day, and a special edition publication in Optics Express in 2023. This project and the related articles show both my success and my strong commitment to making advances in biomedical engineering. Together, my work with Boston Scientific and Johns Hopkins University has made me excited to pursue further studies as a Ph.D. student in medical robotics in the United States. During my undergraduate years, I was deeply involved in numerous research projects, supported by scholarships that enabled me to intern at various labs at Polytechnique Montreal. Here, I delved into diverse topics such as data science, ultrasonic imaging, nanoparticles, and lasers. A highlight of my experiences was designing a robot for scoliosis correction, which not only solidified my interest in robotics but also equipped me with invaluable hands-on knowledge. Moreover, as part of my academic endeavors, I developed tools integral to robotics and other fields. These included a pulse oximeter, motion sensor, heartbeat monitoring system, and a visual testing station for mouse vision. Another standout project was one I contributed to for a 3rd year engineering physics Jacynthe Francoeur course. These multifaceted experiences underscore my adaptability, versatility, and potent problem-solving capabilities, laying a robust groundwork for advanced research in the future. To sum up, my broad academic background and dedication to varied research, combined with my love for hands-on tasks like prototyping and software development, make me a good fit for your Ph.D. program. I am particularly inspired by the potential applications of robotics in improving the diagnosis and treatment of diseases. I'm truly grateful for the chance to apply and am excited about possibly joining your academic community. I feel that your program's supportive environment will help grow my research interests. My goal is to use my skills and passion to improve healthcare technology and create better health results. Thank you for considering my application. Sincerely, Jacynthe Francoeur",
    "Resume": "Protected when completed Date Submitted: 2023-10-08 17:44:26 Confirmation Number: 1675269 Template: CGS-Master's Ms. Jacynthe Francoeur Correspondence language: French Sex: Female Date of Birth: 6/16 Canadian Residency Status: Canadian Citizen Country of Citizenship: Canada Contact Information The primary information is denoted by (*) Address Home Primary Affiliation (*) 974 Decarie Blvd 971 Galilée Apt. #2 Beloeil Quebec J3G6M1 Montreal Quebec H4A3H9 Canada Canada Telephone Home 450-4670978 Mobile (*) 450-3414112 Email Personal (*) jfcoeur@hotmail.com Work jacynthe.francoeur@polymtl.ca i Protected when completed Ms. Jacynthe Francoeur Language Skills Language Read Write Speak Understand English Yes Yes Yes Yes French Yes Yes Yes Yes User Profile Research Disciplines: Biomedical Engineering and Biochemical Engineering, Physical Engineering Areas of Research: Optics and Photonics, Prototyping, Instruments Fields of Application: Foundations and Knowledge Acquisition, Pathogenesis and Treatment of Diseases Research Specialization Keywords: Backscattering, Fiber Bragg gratings, Fiber optics, Multimodal detection Degrees 2021/5 (2023/12) Master's Thesis, Master of Science (MSc), Biomedical Engineering, École Polytechnique de Montréal Degree Status: In Progress Supervisors: Kadoury, Samuel; Kashyap, Raman 2017/8 - 2021/5 Bachelor's, Bachelor of Engineering (BEng), Biomedical Engineering, École Polytechnique de Montréal Degree Status: Completed Recognitions 2017/8 - 2018/5 Admission scholarship for academic excellence - 2,000 (Canadian dollar) École Polytechnique de Montréal Prize / Award Employment 2020/1 Biomedical Engineering Program student representative at the university's open house day Biomedical Engineering, École Polytechnique de Montréal 2019/11 Biomedical Engineering Program student representative at the university's open house day Biomedical Engineering, École Polytechnique de Montréal 1 2023/1 - 2023/5 Visiting scholar - Design of an optical fiber-based shape sensing needle with embedded fiber Bragg grating strain sensors for minimally invasive surgical procedures Robotics, Whiting School of Engineering, Johns Hopkins University 2020/10 - 2021/5 UPIR research intern - Ergodic ultrasound probe design for pixel decoding based on fewer reception channels Department of Engineering Physics, École Polytechnique de Montréal 2020/5 - 2020/8 USRA research intern - Ergodic ultrasound probe design for pixel decoding based on fewer reception channels Department of Engineering Physics, École Polytechnique de Montréal 2020/6 - 2020/7 Course preparation student - Design of a tactile surface using a piezoelectric sensor Department of Engineering Physics, École Polytechnique de Montréal 2019/10 - 2020/5 UPIR research intern - Construction of a pulsatile flow phantom for optimization of pulsatility mapping by dynamic ultrasonic location microscopy Department of Engineering Physics, École Polytechnique de Montréal 2019/5 - 2019/8 USRA research intern - Functionalized plasmonic nanoprobes design for immunolabeling diagnosis Department of Engineering Physics, École Polytechnique de Montréal 2018/10 - 2019/5 UPIR research intern - Supervised classification algorithm design to understand the evolution of the employment relationship in the 21st century Department of Mathematical and Industrial Engineering, École Polytechnique de Montréal Leaves of Absence and Impact on Research 2020/5 - 2020/8 Other Circumstances, Mitacs In winter 2020, I was accepted into the competitive Globalink-RISE research internship program offered by Mitacs in partnership with the German Academic Exchange Service (DAAD). I was very excited to travel to Germany in summer2020 to participate in a research project at the Berlin Center for Advanced Neuroimaging at Charité University, one of Germany's leading biomedical research institutions. Much to my dismay, the internship, which was an opportunity for me to have a rewarding experience relevant to my professional growth, was cancelled due to the COVID-19 pandemic. Research Funding History Awarded [n=1] 2020/5 - 2020/8 Building volume conductor models of individual heads to improve the analysis of brain Principal Applicant activity in large EEG/MEG datasets - CANCELLED DUE TO COVID-19 Principal Investigator : Pellegrini, Franziska Funding Sources: 2020/5 - 2020/8 Mathematics of Information Technology and Complex Systems (MITACS) RISE-Globalink Research Internship Total Funding - 6,000 (Canadian dollar) Funding Competitive?: Yes Completed [n=6] 2022/5 - 2023/5 Design of an intravascular guidewire device integrating random Bragg gratings optical Principal Applicant fibers for multimodal detection during peripheral vascular procedures 2 Funding Sources: 2022/5 - 2023/5 Natural Sciences and Engineering Research Council of Canada (NSERC) Canada Graduate Scholarships – Master’s program Total Funding - 17,500 (Canadian dollar) Funding Competitive?: Yes 2022/5 - 2023/5 Fonds de recherche du Québec - Nature et technologies (FRQNT) Master’s (B1X) Research Scholarships Total Funding - 17,500 (Canadian dollar) Funding Competitive?: Yes 2023/1 - 2023/5 Design of an optical fiber-based shape sensing needle with embedded fiber Bragg grating Principal Applicant strain sensors for minimally invasive surgical procedures Co-director : Iulian Iordachita; Samuel Kadoury Funding Sources: 2023/1 - 2023/5 Natural Sciences and Engineering Research Council of Canada (NSERC) Canada Graduate Scholarships – Michael Smith Foreign Study Supplements Total Funding - 6,000 (Canadian dollar) Funding Competitive?: Yes 2023/1 - 2023/4 Fayolle Canada United-States’ Prestige Total Funding - 10,000 (Canadian dollar) Funding Competitive?: Yes 2020/5 - 2021/5 Ergodic ultrasound probe design for pixel decoding based on fewer reception channels Principal Applicant Principal Investigator : Provost, Jean Funding Sources: 2020/10 - 2021/5 École Polytechnique de Montréal UPIR - Participation and Research Introductory Unit Scholarships Total Funding - 1,500 (Canadian dollar) Funding Competitive?: Yes 2020/5 - 2020/8 Fonds de recherche du Québec - Nature et technologies (FRQNT) Supplements of the NSERC Undergraduate Student Research Awards - USRA (BPCA) Total Funding - 1,500 (Canadian dollar) Funding Competitive?: No 2020/5 - 2020/8 Natural Sciences and Engineering Research Council of Canada (NSERC) Undergraduate Student Research Awards - USRA (BPCA) Total Funding - 4,500 (Canadian dollar) Funding Competitive?: Yes 2019/10 - 2020/5 Construction of a pulsatile flow phantom for optimization of pulsatility mapping by dynamic Principal Applicant ultrasonic location microscopy Principal Investigator : Provost, Jean 3 Funding Sources: 2019/10 - 2020/5 École Polytechnique de Montréal UPIR - Participation and Research Introductory Unit Scholarships Total Funding - 1,500 (Canadian dollar) Funding Competitive?: Yes 2019/5 - 2019/8 Functionalized plasmonic nanoprobes design for immunolabeling diagnosis Principal Applicant Principal Investigator : Meunier, Michel Funding Sources: 2019/5 - 2019/8 Fonds de recherche du Québec - Nature et technologies (FRQNT) Supplements of the NSERC Undergraduate Student Research Awards - USRA (BPCA) Total Funding - 2,000 (Canadian dollar) Funding Competitive?: No 2019/5 - 2019/8 Natural Sciences and Engineering Research Council of Canada (NSERC) Undergraduate Student Research Awards - USRA (BPCA) Total Funding - 4,500 (Canadian dollar) Funding Competitive?: Yes 2018/10 - 2019/5 Supervised classification algorithm design to understand the evolution of the employment Principal Applicant relationship in the 21st century Principal Investigator : Berkelaar, Brenda Funding Sources: 2018/10 - 2019/5 École Polytechnique de Montréal UPIR - Participation and Research Introductory Unit Scholarships Total Funding - 1,500 (Canadian dollar) Funding Competitive?: Yes Editorial Activities 2020/6 - 2020/7 Course preparation student, Localization of finger impacts on a surface using an acoustic time-reversal method, Report I participated in the development of an academic project for the 3rd year course PHS3910 - Engineering Physics Experimental Techniques and Instrumentation for the Fall 2020 semester. I helped write a clear project statement and relevant report questions. Community and Volunteer Activities 2022/10 Optica-SPIE student committee volunteer, École Polytechnique de Montréal I volunteered to ensure the smooth running of the event (Innovation Day). 2022/6 Optica-SPIE student committee representative, Festival Eurêka! I hosted the Optica-SPIE student committee's science booth for children. 2020/1 - 2020/1 Biomedical Engineering Program student representative, École Polytechnique de Montréal I attended the school's winter open house as a student representative of the biomedical engineering program to present the program and answer questions from visitors. 4 2019/11 - 2019/11 Biomedical Engineering Program student representative, École Polytechnique de Montréal I attended the school's fall open house as a student representative of the biomedical engineering program to present the program and answer questions from visitors. 2017/6 - 2018/9 Recreation staff, Centre des loisirs de Beloeil During summer, I participated in the organization and running of several community events organized by the Centre des loisirs de Beloeil, namely the Festival Kaput, the Beloeil Summer Festival, family events, neighbourhood events and family outdoor movie nights. 2015/5 - 2017/2 Employee at Le Monde des Poilus, Minou Cherche Maison I participated in more than one stray cat adoption day organized by Minou Cherche Maison at Le Monde des Poilus. 2014/9 - 2015/6 International solidarity committee member, École d'éducation internationale de McMasterville This committee organized activities to raise awareness to international solidarity among the school's students. 2012/9 - 2015/6 Member, then head of the host and hostess committee, École d'éducation internationale de McMasterville The role of this student committee was to participate in the many events, both academic and non-academic, that took place at the school in order to ensure their smooth running. International Collaboration Activities 2023/1 - 2023/5 Visiting scholar, United States of America In a collaboration between Polytechnique Montréal and Johns Hopkins University, I traveled to Johns Hopkins to embed a flexible needle, used in minimally invasive prostate interventions, with a fiber optic shape sensor developed in our Montreal lab, using distributed light backscatter measurements. The primary goal was to compare our sensor's performance with their custom Fiber Bragg Grating (FBG)-based sensor. Insights from this project were compiled into a paper that was submitted to ICRA 2024. 2021/5 - 2022/2 Research and development, United States of America In this collaboration with Boston Scientific, I worked on software development for real-time 3D shape reconstruction of an optical fiber triplet from measurements obtained by optical frequency domain reflectometry (OFDR). Other Memberships 2021/11 - 2022/11 Treasurer and member in charge of communications, Optica-SPIE Student Chapter This student committee represents Optica and the Society of Photo-Optical Instrumentation Engineers (SPIE), two international optical societies, at Polytechnique Montreal. Its mission is to promote, vulgarize and make optics more accessible at various levels through various educational and networking activities inside and outside the school environment. Presentations 1. (2022). Real-time 3D Shape Sensing with a Random Fiber Bragg Grating Triplet. COPL Annual Day, Montréal, Canada Main Audience: Researcher Invited?: No, Keynote?: No, Competitive?: No 5 2. (2022). Real-time 3D Shape Sensing with a Random Fiber Bragg Grating Triplet. Optical Sensors 2022, Vancouver, Canada Main Audience: Researcher Invited?: No, Keynote?: No, Competitive?: Yes Publications Journal Articles 1. Francoeur, J*; Roberge, A*; Lorre, P*; Monet, F*; Wright, C; Kadoury, S; Kashyap, R. (2023). Optical frequency domain reflectometry shapesensing using an extruded optical fiber tripletfor intra-arterial guidance. Optics Express. 31(1): 396-410. First Listed Author Published Refereed?: Yes Number of Contributors: 6 Funding Sources: Natural Sciences and Engineering Research Council of Canada (NSERC) Reports 1. First Listed Author. Francoeur, J*. (2022). Real-time shape reconstruction with ROGUE triplets. 26. École Polytechnique de Montréal Synthesis?: Yes Number of Contributors: 3 Funding Sources: Boston Scientific Corp. 2. First Listed Author. Francoeur, J*. (2019). Gold nanostars assisted picosecond laser optoporation for gene delivery - Final report (Summer 2019 LP2L intership). 3. École Polytechnique de Montréal Synthesis?: Yes Number of Contributors: 2 Funding Sources: Fonds de recherche du Québec - Nature et technologies (FRQNT); Natural Sciences and Engineering Research Council of Canada (NSERC) Conference Publications 1. Francoeur, J*; Lezcano, D*; Zhetpissov, Y*; Kashyap, R; Iordachita, I; Kadoury, S. (2023). Fully Distributed Shape Sensing of a Flexible Surgical Needle Using Optical Frequency Domain Reflectometry for Prostate Interventions. IEEE International Conference on Robotics and Automation (ICRA). 2024 IEEE International Conference on Robotics and Automation (ICRA2024) Conference Date: 2024/5 Paper First Listed Author Submitted Refereed?: Yes, Invited?: No Number of Contributors: 6 Funding Sources: Natural Sciences and Engineering Research Council of Canada (NSERC); Fayolle Canada 6 2. Francoeur, J*; Roberge, A*; Lorre, P*; Monet, F*; Wright, C; Kadoury, S; Kashyap, R. (2022). Real-time 3D Shape Sensing with a Random Fiber BraggGrating Triplet. Optical Sensors and Sensing Congress 2022. Optical Sensors 2022 Conference Date: 2022/7 Abstract First Listed Author Published Refereed?: Yes, Invited?: No Number of Contributors: 7 7"
}