{
    "ID": "159558714",
    "SOP": "Vanessa YiRan Li I fondly remember my efforts to recreate the lung-on-a-chip platform in the open hallways of my high school. The day prior, I had scraped the surface of pig lungs bought from the wet market and seeded them into growth media I had read about in literature. To my disappointment, the cell media had turned yellow from overheating and was swarmed with bacteria. Though disheartened at the time, I cherish these moments of “failure” as I conduct experiments in the laboratory today. The opportunity to ask questions, to fail, and to grow as well as to occasionally find something life-changing captivates me. I am not only enthralled to discover more but also determined to utilize these steps of scientific inquiry as my toolbox to advance healthcare. As such, I am determined to pursue a Ph.D. in Biomedical Engineering at Columbia University to become a research scientist — with the goal of driving sustainable change in the world around me. As a first-year undergraduate student, I jumped at the opportunity to join the Weiss Lab at the Massachusetts Institute of Technology where I worked alongside a team of aspiring scientists to form cell swarms and properly learned to culture mammalian cells. Specifically, I genetically engineered human embryonic cells to release chemokine and characterized the movement of neutrophils toward these cells using transwell assays and fluorescent microscopy. I then moved from genetics to organs, working in the Zhang lab at Harvard Medical School to fabricate glomerulus-on-a-chip platforms with light-activated hydrogels and 3D bioprinters. The ability to engineer different pieces of the human body fascinates me as it redefines our definition of biology. It transforms today’s medicine, which is based on drugs, into personalized cell-based therapies developed using the building blocks of the human body. As such, I want to be a part of this extraordinary shift in biomedicine to tackle urgent health challenges in the 21st century. Vanessa YiRan Li Amidst the crisis of COVID and the sudden pause to my research at the Zhang Lab, I was given the opportunity to spend more time with my extended family in Japan, specifically my uncle. I watched him struggle physically and financially with unexpected episodes of heart attacks. As such, I started reading into heart diseases and clinical trials to become better informed on the procedures and treatments he endured. As I delved deeper into literature, my interest in the heart grew more and more not only because of its significance as a modulator of the entire human body but also its symbolism as a bridge that connects people. My interest led to an opportunity at the Yoshida Lab at Kyoto University’s Center for iPS Research and Application where I engineered heart organoids to study the effect of MAPK inhibitors and immunosuppressants on cardiac fibrosis. In the process, I was able to build upon skills I have previously used as well as learn new techniques, such as immunostaining and polymerase chain reaction, that I have come to use in my day-to-day life as a research assistant today. When I joined Columbia in 2022, I continued my exploration of the heart and its diseases at Professor Vunjak-Novakovic’s Laboratory For Stem Cells and Tissue Engineering. During my first two semesters, I conducted mitochondrial assays and analyzed surface proteins to contribute to an existing project exploring myocardial injury in systemic lupus erythematosus patients. Through this study, I was able to gain experience differentiating iPSC cells into cardiomyocytes and constructing bioreactors using PDMS, which I then combined to form 3D engineered cardiac tissues. Currently, I am pursuing my independent project embedding gold nanorods into engineered cardiac tissues with the hopes of stimulating electrical maturation in a way that more closely resembles the human myocardium. Through these studies, I have grown tremendously as a scientist with the incredible mentorship I have received and have learned to find joy in not only Vanessa YiRan Li the successful experiments but also the failures in between. Furthermore, I sincerely appreciate the sense of community in the lab from eating Serbian food in the East Village, building Christmas trees out of lab gloves, to summer picnics at Central Park. Being a part of this team has reaffirmed my interest in scientific research and most of all, the strong presence of female leadership has inspired me to set ambitious goals for myself. As a Ph.D. student, I intend to continue the research I have started and to make use of the skillset I have garnered to ask deeper scientific questions. Under the guidance of Professor Vunjak-Novakovic and Professor Cheng, I plan on studying the role of exosomes in cardioprotection using heart-on-a-chip platforms. I am curious about the pathogenic function of exosomes released upon diseases and injury, like ischemia-reperfusion injury, and their trafficking between different cell types within the heart. Furthermore, how do factors such as age, sex, and race affect EV content? Can exosomes be used for personalized diagnostic markers and therapeutic approaches in cardiovascular diseases? The emerging role of exosomes has the potential to unveil unknown mechanisms and new therapies and is currently being explored in Professor Cheng’s lab. Professor Vunjak-Novakovic’s lab offers a heart-on-a-chip platform to model and study cardiovascular diseases in vitro. As such, this collaborative effort combines the strength of both labs to explore unventured avenues in biomedicine and I am honored to be able to be a part of and take the lead on this project. In parallel to my research interests, I have always been passionate about the intersection of medicine, sociology, and advocacy. My upbringing in China, Japan, and the United States informed me of the immense privilege of having a voice in who I want to be knowing that this is not a global norm. As such, I seek for opportunities to advocate for equity in and out of the Vanessa YiRan Li laboratory. At Columbia, this has manifested in the form of being a student advocate as an ambassador for the BME department and the inter-school chair of the Engineering Graduate Student Council. I have organized events to foster interdisciplinary conversations on next- generation issues and offered support to students, especially those who are underrepresented in higher education, to find their place at Columbia Engineering. As a Ph.D. student, I hope to continue my advocacy efforts for the student body by stepping into leadership positions and taking an active role in community events. I intend to make a positive impact through both my lab work and community engagement efforts, working towards the goal of becoming a research scientist who will make a difference. Upon completing my Ph.D., I plan on engaging in a career in research to redefine what is possible in cardiovascular care and to advocate for equity in healthcare. I can envision myself developing personalized tissue models that reflect sex differences in diseases or fighting for the safe use of new biotechnology such as stem cell therapy. Along the way, I intend to use my compassion, curiosity, and leadership skills to make a real impact on the world. At Columbia, I am excited to be in a space that curates the perfect environment for me to thrive, and am even more elated to have found my community within this space. As I continue to pursue research, I wish to encounter more moments of growth from using brightfield microscopy to find lung cells to operating high throughput imagers to characterize cardiac tissues. I look forward to encountering more moments of “failures” I can look back and laugh at in the future as I bring scientific research closer to the world.",
    "Resume": "Vanessa YiRan Li yl5200@columbia.edu | +1 (339) 213-0689 | vanessaliyiran.webflow.io | New York City, NY Education Columbia University, Fu Foundation School of Engineering and Applied Sciences Expected Dec 2023 M.S. in Biomedical Engineering | GPA 4.21/4.00 New York, NY • Concentration in Biomaterials and Tissue Engineering Wellesley College May 2022 B.A in Chemistry (Honors) and Sociology | GPA 3.92/4.00 Wellesley, MA • Durant Scholars Summa Cum Laude and Sigma Xi Scientific Research Honor Society Massachusetts Institute of Technology (MIT) May 2022 Gordon-MIT Certificate in Engineering Leadership |GPA: 5.00/5.00 Cambridge, MA Research Experience Translational Therapeutics Accelerator (B. Fine Lab), Columbia University Team Member Jan 2023 – Present| New York, NY • Selected to take part in the Translational Therapeutics Accelerator Lab-to-Market Boot Camp to commercialize a STK25 inhibitor as a drug to ameliorate cardiac ischemia injury • Conducted stakeholder interviews and market analysis to understand the heart attack market and formulate a business model for this new drug Laboratory for Stem Cells and Tissue Engineering (G. Vunjak-Novakovic Lab), Columbia University Research Assistant Sep 2022 – Present| New York, NY • Model myocarditis using engineered cardiac tissues and patient antibodies to understand the underlying mechanism of this myocardial injury in systematic lupus erythematous patients • Initiated the Women in STEM database and created science-related content (i.e. articles and videos) on the Tissue Engineering Resource Center website to make science more accessible Y. Yoshida Laboratory, Center for iPS Cell Research and Application (CiRA), Kyoto University Research Intern June 2022 – Aug 2022 | Kyoto, Japan • Characterized disease phenotypes of cardiac fibrosis by evaluating key signaling pathways and biomarkers upon exposure to immunosuppressants and MAPK inhibitors • Modeled mature human hearts by engineering iPS cell-derived multi-lineage organoids for accurate and reliable drug screening and toxicity studies Senior Thesis at Flynn Laboratory, Department of Chemistry, Wellesley College Independent Researcher Aug 2021 – May 2022 | Wellesley, MA • Explored the application of water transfer printing to micropattern hydrogels onto 3-dimensional nonplanar surfaces for replicating microenvironments in the body • Designed assays to optimize material properties and hydrogel composition as well as to visualize micropatterns with fluorescent particles Y. Shrike Zhang Laboratory, Harvard Medical School-Brigham and Women’s Hospital Research Trainee Oct 2019 – Apr 2020 | Cambridge, MA • Synthesized tubular hydrogel constructs with self-constructed bio-printer to model renal tubules and blood-brain barrier for applications in disease modeling • Conceived the fabrication of glomerulus-on-a-chip and its accompanying bioreactor with microfluidic devices R. Weiss Laboratory, Department of Biological Engineering, Massachusetts Institute of Technology iGEM Undergraduate Research Intern Jan – Nov 2019 | Cambridge, MA • Engineered human embryonic kidney cells to induce swarm-like chemotactic behavior in neutrophils to form immunogenic cell swarms • Designed migration assays with Boyden chambers and fluorescent microscopy to communicate the migration index of HL-60 cells toward endogenous and transfected chemoattractants PROFESSIONAL EXPERIENCE Columbia University Graduate Engineering Student Affairs Biomedical Engineering Student Ambassador Feb 2023 – Present | New York, NY • Reviewed video interviews of MS applicants to evaluate applications for Fall 2023 entry • Organized mentorship program between incoming and current MS students • Represented BME master’s program at informational session as well as serve as point of contact for incoming students on inquiries regarding program experience and life at Columbia Pforzheimer Learning and Teaching Center at Wellesley College Cafe Tutor and Accessibility Notetaker Sep 2019 – May 2022 | Wellesley, MA • Supported student learning in introductory and organic chemistry courses by teaching sessions tailored towards the needs of each tutee with up to 20 students at a time • Assisted students in the planning and organization of course material and study schedules to increase performance in chemistry courses Innovating Environmental Health Founder and Executive Director Jan 2020 – October 2021 | Wellesley, MA • Managed 15 students in the design of low-cost air filtration devices and air quality sensors to improve the respiratory health of school children in Nepal, amassing 800+ followers on social media platforms • Designed and delivered 6-week courses on sustainability and design thinking to 80+ students in Nepal and China as a Davis Project for Peace Grant recipient (2021) Siemens Healthineers Innovation Think Tank Fellow May – Jul 2021 | Shanghai, China • Conducted 20+ hours of physician interviews and 100+ hours of research on radiography equipment in three tiers of hospitals in China • Analyzed urine and blood analysis systems for product innovation and business modeling targeting community healthcare facilities SurgiBox Inc., Massachusetts Institute of Technology D-Lab Biomedical Engineering Intern Feb 2019 – Jan 2020 | Cambridge, MA • Constructed origami-inspired air filters to increase the portability of operating-room-in-a- backpack device to unique settings around the world • Implemented failure modes and effects analysis by coding an automated google sheets document to deploy safe surgery PUBLICATIONS “An Engineered Human Cardiac Tissue Model Reveals Contributions of Systemic Lupus Erythematosus Autoantibodies to Myocardial Injury.” In Preparation. “Immunosuppressants Tacrolimus and Sirolimus revert the cardiac antifibrotic properties of p38-MAPK inhibition in 3D-multicellular human iPS-heart organoids.” Y. Tian, Y. Tsujisaka, V.Y. Li, K. Tani, A. Lucena-Cacace, and Y. Yoshida. Frontiers in Cell and Developmental Biology. November 11, 2022. “Water Transfer Printing: Hydrogel Micropatterning of Complex 3-Dimensional Surfaces for Biological Applications.” V.Y. Li and N. Flynn. Wellesley College Digital Depository. 2022. “The Glomerulus: A Review on Current Biomimetic Models.” M.G. Valverde, L.S. Mille, K. Figler, E. Cervantes, V.Y. Li, J. Bonventre, R. Masereeuw, Y.S. Zhang. Nature Reviews Nephrology. January 21, 2022. “The Directed Migration of Neutrophil-Like Cells Through Engineered Chemokine Secretion.” YiRan Li, Melody Wu, Margaret Zhang, Nika Shakiba, Shiva Razavi, Ron Weiss. MIT Undergraduate Research Journal Volume 38. Fall 2019. PRESENTATIONS \"Understanding myocardial injury with clinical systolic dysfunction in systemic lupus erythematosus patients using iPSC-derived engineered cardiac tissues.\" S. Fleischer, T. Nash, M. Tamargo, R. Lock, G. Venturini, M, Morsink, V. Y. Li, M. Lamberti, P. Graney, M. Liberman, Y. Kim, R. Zhuang, J. Whitehead, R. Friedman, R. Soni, J. Seidman, C. Seidman, L. Geraldino-Paradilla, R. Winchester, G. Vunjak- Novakovic. Poster presentation at the Columbia Summer Research Symposium. New York, NY. July 26, 2023. “Disease Pathway: Wound Healing Disorder.” External Innovation Think Tank Exhibition. July 28, 2021. \"Innovating Environmental Health: Providing Clean Air to Children through Collaborative Engineering and Education.\" V.Y. Li. Social Impact Lab Presentation at the Unite for Sight Global Health and Innovation Conference. April 10, 2021. \"Innovating Environmental Health: Building Air Filtration Devices to Clean the Air in Nepali Secondary Schools.” V. Y. Li, S. Sedhain, B. Mandal, B. Y. Li. Poster presentation at the 12th Annual Consortium of Universities for Global Health Conference. March 21, 2021. AWARDS AND HONORS Sigma Xi Grants in Aid of Research Recipient (June 2023): Awarded 1000 USD to study the electrical and metabolic maturation of engineered cardiac tissues in the Vunjak-Novakovic Lab Summer at SEAS Fellowship (March 2023): Awarded 6000 USD to conduct summer research in the School of Engineering and Applied Sciences at Columbia University BostInno’s 25 Under 25 Honoree (September 2021): Selected as one of Massachusetts’ 25 young innovators under the age of 25 by digital media and events company BostInno Davis Project for Peace Grant 2021 Recipient (June 2021): Awarded 10,000 USD to improve the air quality for children in Nepal as nominated by Wellesley College and selected by the Davis Foundation Social Innovation Warehouse Global Fellow (February 2021): Selected to take part in a 5-week capacity-building program for young innovators to grow their social innovation projects Albright Institute of Global Affairs Fellow (January 2021): Selected as one of 40 Wellesley Students, guided by Secretary M. Albright, to engage in global leadership seminars with the goal of bridging education and practice Introductory Chemistry Award (April 2020): Awarded for outstanding performance in an introductory chemistry course at Wellesley College International Genetically Engineering Machine Gold Medal (November 2019): Awarded to teams who have shown excellence in key pillars of an iGEM project as a part of the MIT iGEM team at R. Weiss Laboratory LEADERSHIP EXPERIENCE Interschool Chair and Lead Department Representative, Columbia Engineering Graduate Student Council (Sep 2022 – Present) – Organize social/networking events between different schools at Columbia to foster interdisciplinary 21st century discussions Founder and Co-Editor in Chief, Wellesley Undergraduate Research Journal (Sep 2020 – May 2022) – Launched biannual peer-reviewed journal to showcase multidisciplinary research at Wellesley College, providing an opportunity for students to undergo the peer-review process Technology Lead, MIT Hacking Medicine (May 2019 – May 2022) – Managed event hosting 400+ participants around the world to address medicine, COVID, and racism to foster an innovative ecosystem that solves healthcare problems worldwide President and Project Manager, Wellesley Engineering Society (Oct 2018 – May 2022) – Initiated 3D- printed e-NABLE prosthetics project, Design for Social Change Ideation, and Wellesley in Minecraft project to diversify the engineering community at Wellesley COMMUNITY OUTREACH Event Organizer, Columbia BME Diversity, Equity, and Inclusion Committee (Jan 2023 -Present) – Organize speaker events and social media content to celebrate women’s history month at Columbia University with the goal of increasing the visibility of women-identifying scientists Social Media Manager, Health Tech Without Borders (Nov 2022 – Present) – Create social media posts to raise awareness for the humanitarian emergency in Ukraine and to leverage telemedicine to provide immediate access to health resources, garnering 40,000+ impressions on published posts HYPOTHEKids, Maker Lab Instructor (July 2023) – Designed and taught a computational biology curriculum to underserved high school students in New York interested in STEM Research and Advocacy Volunteer, The Family Van (Sep 2021 – Dec 2021) – Engaged in research on mobile health clinics around the United States as well as compiled healthcare data and resources to bring mobile health services to vulnerable populations in greater Boston Health Partnerships Coordinator, Boston Healthcare for the Homeless (Sep 2019 – May 2021) – Led community-based learning and reflection for volunteers at Boston Healthcare for the Homeless and organized games/music concerts for the residents"
}