{
    "ID": "882259412",
    "SOP": "Tieu Hoang Huan Pham 1 Tieu Hoang Huan Pham Personal Statement Computer Science at Columbia University Intended program: PhD in Computer Science (M.S. leading into Ph.D.) From the vibrant streets of Saigon to the historic corridors of York, my academic and cultural journey has been a tapestry of diverse experiences. During my early days in York, the stark contrast between my Vietnamese upbringing and the British education system was not merely academic but also deeply cultural. I remember instances when classmates would share anecdotes from their childhood, rooted in British traditions, while I nostalgically recall the vibrant streets of Saigon during the Tet festival. Often, the cultural gap was as subtle as when jokes from Blackadder and Monty Python resonated deeply with the British students, leaving me puzzled. These moments, although seemingly trivial, painted a broader picture of the deep-seated differences that lay between our worlds. Yet, it was these very differences that shaped my resilience, adaptability, and unique perspective—qualities I believe are essential in the ever- evolving field of computer science. My time in the UK made me realize the immense difficulty of being a minority in a predominantly monocultural community, with structural rigidity that limited my ability to grow, particularly in computer science, as there was no access to this subject in my boarding school. Columbia, with its commitment to diversity and its esteemed computer science program, presents the ideal environment for someone like me, who values both cultural richness and academic rigor. Tieu Hoang Huan Pham 2 In the U.S., while I was finally navigating the intricate waters of computer science, I simultaneously grappled with understanding the American way of life. The concept of Thanksgiving, the emphasis on individualism, and even the spirited college sports culture were all novel to me. However, with each passing event, I took it upon myself to learn, adapt, and share my own stories, weaving a tapestry of shared experiences with my peers. Initially, I found computer science daunting because of its intricate logic and the precision it demanded. The abstract nature of algorithms and the initial hurdles of syntax felt foreign, contrasting starkly with the subjects I had previously studied. To bridge this gap, I adopted a proactive approach. I frequently visited professors during their office hours, spending extra time after class to clarify doubts and deepen my understanding. I also sought mentorship from senior students and dedicated countless hours to self-study. Collaborating with peers became a regular practice, allowing me to grasp complex concepts from multiple perspectives. This hands-on, collaborative approach not only helped me navigate the intricacies of the subject but also instilled in me resilience and a never-give-up attitude. From grappling with a basic “hello world” program in C++ to authoring a paper for the International Conference on Machine Learning and Applications (ICMLA 2023), my journey has been one of consistent growth. My experiences have equipped me with the resilience, curiosity, and collaborative mindset that I believe will allow me to thrive within Columbia’s outstanding computer science program. During the summer of 2023 at Hofstra, I joined Professor Wu and Professor John in applying machine learning in the neuro-imaging field. By using GAN and its various derivatives, we were hoping to see whether we could feed raw 4D functional MR data straight into GAN without preprocessing to determine whether they outperform traditional algorithms in classifying patients with schizophrenia. I was tasked with handling the raw 4D MR data and testing the various GAN Tieu Hoang Huan Pham 3 models. However, since we were working with 4D tensors, I was working on how to make a 2D slice. In weekly lab meetings, I was exposed to many exciting terminologies in the neuro- imaging field. I also assisted Professor Shan with a particular computer system project, evaluating Gemini performance under memory pressure. In the virtualized cloud, a huge page misalignment caused the application to perform poorly. To mitigate this problem, Professor Shan, in a previous paper, created Gemini, a subsystem that turns misaligned huge pages into well-aligned huge pages. I was tasked with expanding Gemini's use cases. I designed test cases to see how Gemini would perform under complex scenarios such as memory deduplication, memory ballooning, and swapping. In spring 2023, I chose to explore the application of machine learning in the mortgage sector for my honors thesis, guided by Professor Puerzer and Professor Lane. My interest in this area stems from the critical role mortgages play in determining homeownership and, by extension, the socio-economic mobility of individuals. As fintech companies increasingly harness AI and machine learning, I was alarmed by papers from the Journal of Financial Economics that highlighted the presence of algorithmic bias. Using statistical techniques, particularly the chi- square test, I was able to confirm disparities in mortgage approval rates across different demographics in New York. These findings have profound societal implications. If unchecked, these biases in machine learning models perpetuate systemic discrimination, further marginalizing already vulnerable groups. As computer scientists, we bear the responsibility to ensure that technology serves as an enabler of equity, not a perpetuator of bias. I enjoyed the learning process because it was more than just coding or data analysis; it was about understanding the real-world implications of our algorithms. Every line of code, every Tieu Hoang Huan Pham 4 dataset, and every model choice had the potential to impact lives. The interdisciplinary nature of my research, which involved finance and urban studies, further enriched my understanding. It made me realize that the challenges in machine learning are not just technical but deeply societal. I am eager to collaborate with Professor Bareinboim, the director of the Causal Artificial Intelligence Lab and a renowned expert in fairness analysis. His recent work, which delves into the intricate relationship between data, AI, and fairness, resonates deeply with my research interests. His innovative approach, melding causality language with legal doctrines involving discrimination, offers a promising avenue for addressing the biases inherent in modern AI systems. As I discuss in my thesis, Professor Bareinboim's emphasis on translating societal norms into measurable statistical terms could be invaluable. At Hofstra, my passion for computer science and mathematics was not confined to just my personal academic endeavors. Recognizing the challenging nature of these disciplines, I took on weekly tutoring roles in both the computer science and mathematics departments. This responsibility was about more than just knowledge dissemination; it required immense adaptability and patience. Every student, with their unique characteristics, meant that a one-size- fits-all approach would not suffice. I constantly innovated and tailored my teaching methods to cater to individual needs. Assisting international students added another layer of complexity. Language barriers, cultural nuances, and diverse educational backgrounds necessitated effective communication. Tutoring students from various countries, including Uganda, El Salvador, and the Philippines, I often found myself breaking down concepts differently, using relatable examples from their cultures, or rephrasing explanations until clarity was achieved. Through these sessions, I not only imparted knowledge but also learned immensely about diverse cultures, broadening my own perspective and understanding. It was a journey of not just guiding them Tieu Hoang Huan Pham 5 academically but also assisting them in navigating a new educational system, drawing parallels from my own experiences as an international student. Building on the cultural mosaic that my life has become, my journey has been underscored by the challenge of fostering inclusivity and understanding across diverse settings. The transition from a conservative household in Saigon to a British boarding school was my first taste of the challenge. In environments unfamiliar to one's upbringing, the potential to grow and innovate can sometimes feel stifled. Yet, these experiences, albeit difficult, underscored the importance of fostering a community that celebrates differences. In essence, to truly thrive, it is not just about integrating into a new society but enriching it with a diverse tapestry of perspectives that inspire transformative change. As I look ahead, I am drawn to New York City and Columbia, a global institution embodying this ethos of diversity and inclusivity. Seeking a PhD in computer science at Columbia, particularly through the MS leading to PhD track, will allow me to deepen my knowledge in the expansive realm of AI and machine learning and to contribute meaningfully to the community at the pinnacle of research. Even as an undergraduate, I have been driven by a desire to understand the state-of-the-art advancements in machine learning and AI, especially the role of fairness as these models transition from theory to real-world application. My primary objective is to conduct research that ensures that, as we advance in the domain of AI and machine learning, these technologies are applied ethically, prioritizing and protecting humanity's interests. I am particularly drawn to exploring the implications of AI in criminal justice, aiming to develop models that counteract racial biases in predictive policing; in healthcare, where I intend to design diagnostic algorithms that are inclusive of all demographic groups; and in financial services, where I plan to investigate and mitigate the effects of underlying prejudices in lending decisions. Tieu Hoang Huan Pham 6 Beyond research, I am deeply passionate about teaching and mentoring the next generation of computer scientists, emphasizing both technical expertise and ethical considerations. My long- term goal, post-PhD, is to secure a tenure-track position at a leading university where I can seamlessly blend groundbreaking research with transformative teaching. I am confident that my diverse experiences and the challenges I have overcome will enrich Columbia's community.",
    "Resume": "Tieu Hoang Huan Pham Mineola New York, NY 11501 (347) 414-6644 • josephpham1406@gmail.com EDUCATION Hofstra University, Fred DeMatteis School of Engineering and Applied Science, Hempstead, NY Bachelor of Science (Honors with Distinction), Computer Science and Mathematics; Dean’s list – all terms; GPA: 3.8 December 2023 Relevant Coursework: Abstract Algebra I, Real Analysis I, Probability and Statistics II, Linear Algebra, Algorithm and Design Analysis, Introduction to AI, Introduction to Programming Languages HONORS AND GRANTS Graduated summa cum laude (2023) Computer Science and Mathematics Departmental Honors (2023) Phi Beta Kappa (2023) Pi Mu Epsilon (2023) Pi Mu Epslion (2023) Hofstra University Provost Scholarship (2020) RESEARCH EXPERIENCE Hofstra University, Zucker School of Medicine Research Assistant, Summer 2023 Advisors: Professor Majnu John, Professor Yihren Wu Applied Generative Adversarial Networks (GANs) to neuro-imaging for Schizophrenia classification using raw 4D functional MR data. Tested various GAN models, while addressing the challenge of deriving 2D slices from 4D tensors. Hofstra University, Computer Science Department Research Assistant, Summer 2023 Advisor: Professor Jianchen Shan Expanded the use cases of Gemini, a subsystem engineered to realign misaligned huge pages. Designed test cases to assess its efficacy under complex scenarios such as memory deduplication, memory ballooning, and swapping. Hofstra University, Computer Science Department Honors Thesis, Spring 2023 Advisor: Professor Richard Puerzer, Professor Andrew Lane Explored the application of machine learning in the mortgage sector. Employed statistical analysis, particularly the chi-square test, to investigate mortgage approval rates across different demographics in New York. Key findings revealed algorithmic biases that underscored the critical need for equitable technology practices within the financial sector to prevent systemic discrimination. PUBLICATION Examining Biases in AI in the Mortgage Sector with Andrew Lane in ICMLA (International Conference on Machine Learning and Applications), 2023 – weakly accept, borderline, weakly reject, reject TEACHING EXPERIENCE Hofstra University, Computer Science Department Tutor, September 2022 – December 2023 Guided students on all first-year computer science courses (CS14,15,16,17,24,110,112), covering core concepts and practical applications. Adapted teaching methods to meet diverse student needs, ensuring understanding of both foundational and emerging topics. Assisted students in breaking down complex coding questions for methodical problem-solving. Reviewed and provided feedback on students' coding solutions to improve correctness and performance. Hofstra University, Mathematics Department Tutor, September 2022 Conducted personalized 1-1 tutoring sessions, adapting approach to each student's unique needs and learning styles for quizzes and exams preparation. Assisted students in tackling challenging math problems through visualization techniques, aiding in the comprehension of abstract concept. PROFESSIONAL EXPERIENCE Navitas - London Intern, Summer 2019 Successfully designed and executed a data collection project. Enhanced the company's understanding of its target audience by assisting in the creation of a comprehensive framework which utilized Google Surveys for data gathering. Addressed and met client-specific needs by delivering tailored, efficient, and reliable solutions in collaboration with the team. Improved team communication and project outcomes by actively participating in team discussions and feedback sessions, learning effective and concise communication. Nhu Hai Cat Tuong Co., LTD – Ho Chi Minh Chief Technology Officer, Summer 2023 Led the launch of my family tea business by crafting a comprehensive business plan covering all operational facets from production to consumption. Conducted industry analysis using Python and Matlab for data analysis, and developed web scraping tools to gather essential data. Employed logistic regression and random forest models for industry trend forecasting, aiding in precise supply and demand strategizing. This initiative not only positioned the business effectively within the industry but also translated academic learnings into practical business solutions. OTHER EXPERIENCE Hofstra University, Zarb School of Business Student Managed Investment Fund (SMIF), Fall 2023 Presented analysis and investment recommendation of ESG focused ETF stocks to Hofstra’s SMIF Supervisory Board, alumni and investment practitioners. Resulted in the purchase of VHT stocks which makes up 19% of the ESG portfolio. CERTIFICATION Bloomberg ESG – December 2023 Bloomberg Finance Fundamentals – December 2023 Bloomberg Market Concepts – December 2023 TECHNICAL SKILLS Computational: Eclipse, MS Visual Studio, Oracle VM Virtual Box, MATLAB, Pandas, NumPy, Pytorch, Keras, Excel, TensorFlow, Scikit-Learn, Seaborn, Matplotlib Coding languages: Python, C++, C#, C, Java, F#, Rust, Perl LANGUAGES English (fluent) Vietnamese (native) Tieu Hoang Huan Pham Mineola New York, NY 11501 (347) 414-6644 • tpham10@pride.hofstra.edu EDUCATION Hofstra University, Fred DeMatteis School of Engineering and Applied Science, Hempstead, NY Bachelor of Science (Honors with Distinction), Computer Science and Mathematics; Dean’s list – all terms; GPA: 3.8 Expected December 2023 Relevant Coursework: Abstract Algebra I, Real Analysis I, Probability and Statistics II, Linear Algebra, Algorithm and Design Analysis, Introduction to AI, Introduction to Programming Languages HONORS AND GRANTS Phi Beta Kappa (2023) Pi Mu Epsilon (2023) Pi Mu Epslion (2023) Hofstra University Provost Scholarship (2020) RESEARCH EXPERIENCE Hofstra University, Zucker School of Medicine Research Assistant, Summer 2023 Advisors: Professor Majnu John, Professor Yihren Wu Applied Generative Adversarial Networks (GANs) to neuro-imaging for Schizophrenia classification using raw 4D functional MR data. Tested various GAN models, while addressing the challenge of deriving 2D slices from 4D tensors. Hofstra University, Computer Science Department Research Assistant, Summer 2023 Advisor: Professor Jianchen Shan Expanded the use cases of Gemini, a subsystem engineered to realign misaligned huge pages. Designed test cases to assess its efficacy under complex scenarios such as memory deduplication, memory ballooning, and swapping. Hofstra University, Computer Science Department Honors Thesis, Spring 2023 Advisor: Professor Richard Puerzer, Professor Andrew Lane Explored the application of machine learning in the mortgage sector. Employed statistical analysis, particularly the chi-square test, to investigate mortgage approval rates across different demographics in New York. Key findings revealed algorithmic biases that underscored the critical need for equitable technology practices within the financial sector to prevent systemic discrimination. PUBLICATION Examining Biases in AI in the Mortgage Sector with Andrew Lane in ICMLA (International Conference on Machine Learning and Applications), 2023 – Submitted TEACHING EXPERIENCE Hofstra University, Computer Science Department Tutor, September 2022 - current Guided students on all first-year computer science courses (CS14,15,16,17,24,110,112), covering core concepts and practical applications. Adapted teaching methods to meet diverse student needs, ensuring understanding of both foundational and emerging topics. Assisted students in breaking down complex coding questions for methodical problem-solving. Reviewed and provided feedback on students' coding solutions to improve correctness and performance. Hofstra University, Mathematics Department Tutor, September 2022 Conducted personalized 1-1 tutoring sessions, adapting approach to each student's unique needs and learning styles for quizzes and exams preparation. Assisted students in tackling challenging math problems through visualization techniques, aiding in the comprehension of abstract concept. PROFESSIONAL EXPERIENCE Navitas - London Intern, Summer 2019 Successfully designed and executed a data collection project. Enhanced the company's understanding of its target audience by assisting in the creation of a comprehensive framework which utilized Google Surveys for data gathering. Addressed and met client-specific needs by delivering tailored, efficient, and reliable solutions in collaboration with the team. Improved team communication and project outcomes by actively participating in team discussions and feedback sessions, learning effective and concise communication. Nhu Hai Cat Tuong Co., LTD – Ho Chi Minh Chief Technology Officer, Summer 2023 Led the launch of my family tea business by crafting a comprehensive business plan covering all operational facets from production to consumption. Conducted industry analysis using Python and Matlab for data analysis, and developed web scraping tools to gather essential data. Employed logistic regression and random forest models for industry trend forecasting, aiding in precise supply and demand strategizing. This initiative not only positioned the business effectively within the industry but also translated academic learnings into practical business solutions. TECHNICAL SKILLS Computational: Eclipse, MS Visual Studio, Oracle VM Virtual Box, MATLAB, Pandas, NumPy, Pytorch, Keras, Excel, TensorFlow, Scikit-Learn, Seaborn, Matplotlib Coding languages: Python, C++, C#, C, Java, F#, Rust, Perl LANGUAGES English (fluent) Vietnamese (native)"
}