{
    "ID": "198186667",
    "SOP": "Ethan Yi-Chen Liu Ph.D. in Electrical Engineering Statement of Purpose The seed of fervent passion and insatiable curiosity, destined to unveil how beautiful things could be through various engineering processes, was gently sown in the fertile soil of my childhood. After enjoying the colorful popsicles and blossoms of coolness on our taste buds, I spent several hours contemplating, “Where does the color come from?” This curiosity guided me into the realm of engineering, unveiling the intricate science underlying these captivating shades. This revelation ignited an ardent ambition within me – to channel the potential of evolutionary technology and processes towards infusing life with vibrancy and render humanity itself 'colorful' through innovation and progress. This journey reinforced the essence of immersive research training and a sturdy knowledge foundation. In consequence, studying in Columbia’s Ph.D. program in Electrical Engineering, in which countless research resources are accessible, along with brilliant researchers and extraordinary faculty, assuredly holds immense significance in fulfilling my dream. Embarking on this odyssey necessitates an enduring spirit of perseverance and relentless consistency — qualities ingrained in my spirit. Despite not ranking first in my class, my unyielding and unwavering dedication defined my journey. This ethos bore fruit when graduate study invitations poured in from all the top five universities in my country. Similarly, my journey at Columbia University was riddled with initial academic challenges. The transformation, however, was profound. From 'striving harder' to 'striving smarter.’ Undeterred, the outcome was remarkable—a perfect 4.0/4.0 academic performance that bears witness to my growth and adaptability. These experiences underscore my readiness for a Ph.D. In addition to curriculum studying, I also took the initiative to join research groups at National Tsing Hua University to enhance my critical thinking and problem-solving capacity. I undertook the project of the Volatile Organic Compounds (VOCs) ozonation in a Rotating Packed Bed (RPB) to tackle wastes from the semiconductor factory through mathematics models. During this project, we built the model for analyzing ozone absorption and oxidation efficiency, as well as established the empirical correlations that are highly applicable in an industrial setting. Through optimization, our exploration revealed the effect of the usage of the acid catalyst plays a pivotal role in oxidation simulation, leading to a remarkable reduction of deviations from 97.5% and 57% to an impressive 7.3% for o-cresol and 11.5% for phenol. Following our research, I presented an oral presentation at the key conference (PSE Asia 2022) and was awarded a fellowship from the Ministry of Science and Technology of Taiwan. As recognition, my expertise in RPB also caught the attention of the Chemical Engineering department at the University of Notre Dame, leading to a collaborative investigation into the effect of MEA, DETA, and piperazine on CO2 capture using RPB, an opportunity I secured amidst stiff competition. The result of our publication at the international conference (ICSREE 2021) and these experiences drove me to delve in-depth into the field. As of this writing, I am working as a research assistant at Columbia University, aiming to optimize the Excimer Laser Annealing (ELA) conditions for Indium-Gallium-Zinc-Oxide (IGZO) thin film transistors, via sponsorship of Samsung Display Company. To date, the ELA heat treatment on Ethan Yi-Chen Liu Ph.D. in Electrical Engineering Transparent Amorphous Oxide Semiconductor (TAOS) offers the potential to ameliorate the transistor performance and revolutionize the field of display technology. Exploring the complex interplay between oxygen vacancies, IGZO’s structural properties, and their impact on device characteristics, I have honed my skills in device microfabrication, mastering techniques like Thermal Evaporation Deposition, Plasma-Enhanced Chemical Vapor Deposition, Lithography, and Wet/Dry etching. Furthermore, I’ve become proficient in essential metrology equipment, including Atomic Force Microscopy, Transmission Electron Microscopy, X-ray Photoelectron Spectroscopy, X-ray Diffraction, Profilometry, and Probe station. Those hands-on experience has equipped me to integrate seamlessly into various research environments and dedicate myself to innovative project. ability and helped me get ready to be able to fit in quickly and make valued contributions to any ongoing research. With profound gratitude for my journey so far, I yearn to anticipate new challenges and discoveries in the next phase of my academic adventure. As I've advanced in my academic pursuits, I’ve sought chances to make a positive impact and share the knowledge I’ve gained. By serving as a teaching assistant for the Process Control and Unit Operation Laboratory, I was able to assist fellow students both theoretically and experimentally. Additionally, as the captain of the basketball team in our department, I’ve held and led a national sports event that brought students from chemical engineering departments all around the country, which not only strengthened my leadership ability but highlighted my passion for fostering camaraderie among peers. Looking to branch out further, I served as the secretary of the Taiwanese Grad Student Association, in which we organize events and provide support to all the students from Taiwan at Columbia University. This role enabled me to connect with diverse groups of people, which deepened my commitment to helping others and contributing to the well-being of my fellow students. In the near future, I eagerly look forward to embarking on innovative research projects, particularly the semiconductor science. Leveraging the advanced equipment and resources at the Columbia Nano Initiative (CNI) to push the boundaries of this field makes it an ideal place for groundbreaking accomplishments. I hope to work with Prof. Savannah Eisner to delve into advancing the Gallium Nitride High-Electron-Mobility-Transistor (GaN HEMTs) as a robust candidate for mixed-signal electronics in extreme conditions, making them indispensable for various critical applications. Both in-situ transistor electrical characterization and advanced microscopy analysis toward stress conditions on epitaxial and device structure can demonstrate an outstanding performance of Enhancement-mode GaN transistors. After graduation, my vision extends beyond personal success. I aspire to embark on a career path that transcends boundaries, where I can be instrumental in shaping unconventional chip manufacturing processes in the semiconductor industry. I hope to eventually be committed to not only giving back to my alma mater through the donation of facilities and scholarships but inspiring future generations and establishing myself as an influential alumnus as well.",
    "Resume": "ETHAN (YI-CHEN) LIU +1 (332) 256 1405 | yl5188@columbia.edu | www.linkedin.com/in/Ethan-Yi-Chen-Liu EDUCATION Columbia University, New York, US Sept.2022-Dec.2023(Expected) Master of Science in Material Science and Engineering National Tsing Hua University, Hsinchu, TW July.2020-July.2022 Master of Science in Chemical Engineering National Chung Cheng University, Chiayi, TW Sept.2015-Jan.2020 Bachelor of Science in Chemical Engineering WORK EXPERIENCES Effect of Laser Annealing on Indium-Gallium-Zinc-Oxide (IGZO) Thin-Film Transistors Researcher Student Research Advisors: Prof. James S. Im, Columbia University Oct.2022- Present  Simulated laser-induced crystallization of thin films using 3-D numerical simulation (3DNS) program to analyze thermal behavior and optimize process parameters.  Fabricated the bottom-gate transistor with varying composition and thickness of IGZO and heat conductive layer and performed annealing of oxide layers using Excimer Laser and Flashlamp system.  Optimized Excimer Laser annealing energy density based on the tendency of oxygen vacancies and electrical characterizations with X-ray photoelectron spectroscopy (XPS) to achieve desired material properties and applied X-ray diffraction (XRD) to assess crystallization process of IGZO.  Evaluated the conductivity and sustainability of devices after high-density laser annealing, ensuring superior performance and reliability. Model-Building for Ozone Absorption and VOCs ozonation in a Rotating Packed Bed Researcher Assistant Research Advisors: Prof. Shi-Shang Jang, NTHU, and Prof. David Shan-Hill Wong, NTHU July.2020-July.2022  Developed a generic high-gravity rotating-bed model in Aspen Custom Modeler to predict ozone absorption and VOCs ozonation.  Selected suitable combination of mass transfer correlations through numerous comparisons and reduced deviation between simulation and experiment data to 9% and 3.2% in ozone and oxygen absorption, respectively.  Modified the Enhancement Factor in mass transfer from VOC concentration-based to pH-based, resulting in an improvement in simulation accuracy and reducing deviation from 97.5% and 57.8% to 7.3% and 11.5% in simulating two VOCs ozonation.  Validated model applicability and universality and presented at Asian Symposium on Process Systems Engineering (PSE Asia 2022). Study on the influences of Different Solvents for CO2 Capture in Rotating Packed Bed (RPB) Researcher Assistant Research Mentor: Prof. Jeffrey Kantor, University of Notre Dame Jan.2021-May. 2021  Compared CO absorption of MEA and DETA (as solvents), then studied effect of adding PZ, discovered a mixture 2 of DETA and PZ was assessed to highest mass transfer coefficient, K . Ga  Analyzed absorption performance of RPB and traditional absorption tower and demonstrated the potential for substituting the traditional packed tower with RPB based on comparative data.  Presented at International Conference on Sustainable and Renewable Energy Engineering (ICSREE 2021). SKILLS ____ Simulation/Programming: Aspen Plus, Aspen Custom Modeler, Origin, Microsoft Office (Word, Excel, PowerPoint…), Python, Layouteditor. Device Fabrication/Skills: Photolithography, Plasma-Enhance Chemical Vapor Deposition, Wet and Dry Etching, Laser Annealing, Flashlamp Annealing, Wafer Dicing, Chemical Mechanical Polishing, Physical Vapor Deposition. Metrology/Equipment: Optical Microscope, X-ray Photoelectron Spectroscopy, Atomic Force Microscope, Ellipsometer, Raman spectrometer X-ray Diffraction, Probe Station."
}