{
    "ID": "765161652",
    "SOP": "Isaac Olatunji PERSONAL STATEMENT I was the first on call in the Maxillofacial department during my National Youth Service year when I was invited to attend to a 19-year-old male patient who presented with a rapidly growing, severely painful, ulcerated facial swelling that had extended from left to right side of his lower face and neck. As I had to refer him to a more equipped hospital for a comprehensive management, the boy’s father asked me in their native language “Doctor, are you sure everything will return to normal once we get there?”. Of course, I couldn’t give a definitive answer even though I knew the most likely outcome, from putting one and two together. How cool would it have been if I could write a prescription on the spot and reassure them? After completing my first degree in Dental Surgery in Nigeria, I already knew I would have a research career. From my experiences, and observations during my clinical years as a student, I had become more curious about the presentations, and course of some conditions beyond the scope of clinical practice, particularly cancer. Rather atypical of a pure clinician’s training, I began to dig more into the molecular basis for cancer, and I did find interesting revelations in the literature. However, with more knowledge came more questions. In summary, this led to the publication of my article titled “Potential Application of Tumor Suppressor MicroRNAs for Targeted Therapy in Head and Neck Cancer”. Along the way, I found it cool the idea of creating something from the scratch, and building it based on one’s specifications. In short, I taught myself how to program! The combination of these knowledge, and other skills from various sources have all culminated in my research interests, and current work. In our recently published work, which was part of my masters thesis, we explored the use of multimodal data- genomic, clinical, and histopathology images for the prediction of Distant Metastasis (DM) in carcinoma patients. In this work, we applied an optimization technique with Isaac Olatunji the random forest algorithm for identification of gene expression biomarkers in distant metastasis samples, and also investigated whether similarities exist between metastatic genes in the three different types of cancer studied. The genes selected by our method performed better than differentially expressed genes that were selected using the DESeq2 software. Also, our results confirmed that no single specific gene can certify the presence or absence of DM, rather DM is influenced by various combination of genes which are different in each cancer type. To predict DM directly from histopathology images, we tested the DenseNet121 Convolutional Neural Network (CNN) architecture as well as KimiaNet, a DenseNet121 architecture model pretrained on ImageNet data and finetuned on about 250000 domain histopathology images. KimiaNet did not provide a tangible advantage over DenseNet121 in the task of prediction of DM from histopathology images. Overall, combining genomic, image, and clinical data for prediction of DM gave better results, however genomic data provided the highest contribution. Beside my thesis work I have also been actively involved in multiple group and individual projects, some of which are listed on my resume. I am passionate about application of AI in precision medicine, and drug discovery. Going through the list of faculty members, I am fascinated by the research of Dr. Mohammed AlQuraishi, Dr. Elham Azizi, and Dr. David Knowles. I believe my past experiences have prepared me well for this position. I possess a combination of computational and statistical skills, strong knowledge of molecular biology, as well as clinical patient management experience. This means I can identify research gaps, design research with consideration of its final clinical applications, and with my technical skills carry out the research. I am certain that the PhD Computer Science program at Columbia University will be just perfect Isaac Olatunji to merge my skills, and experiences as I look forward to creating better healthcare solutions. Perhaps in future, a 19-year-old’s life will be saved by writing a prescription.",
    "Resume": "ISAAC TOLULOPE OLATUNJI 🞂 27, River Meadow Drive, Rochester, NY 14623 Phone: +1(585-303-3673) E-mail: iospring24@gmail.com EDUCATION ● Rochester Institute of Technology, Rochester, USA, 2021 – 2023 o Master of Science in Bioinformatics ● College of Medicine of the University of Lagos (CMUL), Lagos, Nigeria, 2009-2016. o Bachelor of Dental Surgery (BDS) PUBLICATION(S) AND PROJECT(S) ● Olatunji I and Cui F (2023) Multimodal AI for prediction of distant metastasis in carcinoma patients. Front. Bioinform. 3:1131021. doi: 10.3389/fbinf.2023.1131021 ● Isaac Olatunji, Feng Cui. Machine Learning Predicts Genes Associated with Cancer Metastasis. Poster Presentation. AI@RIT Summit. ● Isaac Olatunji. Potential application of tumor suppressor microRNAs for targeted therapy in head and neck cancer: A mini-review. Oral Oncology, Volume 87, 2018, Pages 165-169, ISSN 1368-8375. ● Breast Cancer Segmentation on Histopathology Images. A Convolutional Neural Network based project where U-net architecture was coded from scratch using tensorflow, and other python libraries. Model was trained with image datasets downloaded from Kaggle to make predictions. ● Differential gene expression analysis in sulphoraphane treated versus vehicle treated obese rats. Aim was to investigate if any of the Differentially Expressed Genes (DEGs) are related to the leptin receptor or Nuclear Factor Erythroid 2 Related Factor (NRF2) pathways. Data acquisition from SRA, Quality Control, Alignment, Count Matrices, Differential Gene Expression Analyis, Visualization, DEGs interpretation. ● Assessment of ligand protein binding in statins-HMG Co-A reductase complex. Molecular docking of various statin class ligands (ex. simvastatin, pravastatin, etc) to the HMG Co-A reductase protein using AutoDock Vina in the PyRx software in order 🞂 Resume: OLATUNJI ISAAC TOLULOPE to assess their binding affinities. Visualization and analysis of the various statin- HMG Co-A complex interactions based on features like hydrophobicity, and B factor in the UCSF Chimera software. ● Machine Learning Predicts Cancer Recurrence and Metastasis in Head and Neck Cancer. A project in R that assessed ability of three types of machine learning algorithm (NaïvF e Bayes, SVM- with linear, polynomial, radial basis kernel functions, and Random Forest) to accurately predict cancer recurrence and metastasis from patients clinical data downloaded from TCGA. ● Molecular Modelling and Proteomics Course Individual Projects ○ Python implementation of Chou Fasman algorithm for protein secondary structure prediction. ○ Sequence specific retention calculator for calculation of retention time in reverse phase chromatography. ○ Python scripts within Chimera software for download and manipulation of PDB data. ● Diagnose Your Toothache. A novel algorithm to diagnose pain of dental origin from information about patient’s symptoms, and medical history. (Python, MySQL) JOURNAL REVIEW ACTIVITIES ● Reviewer, Journal of Surgery and Operative Care (online journal). ● Reviewer, Journal of Cervical Cancer Research (online journal). ● Reviewer, Journal of Medical Oncology (online journal). ● Reviewer, Journal of Clinical Oncology and Cancer Research (online journal). ● Reviewer, Journal of Otolaryngology, Head and Neck Cancer (online journal). ● Reviewer, Springer book proposal (Medicine, Life Sciences and Biomedicine). ● Reviewer, Journal of Receptors and Signal Transduction (online journal). ● Reviewer, Acta Biochimica Polonica (online journal). SKILLS ● Programming Languages: Python, R, C / C++, SQL, Linux. ● Libraries and Tools: Pandas, NumPy, Matplotlib, Sklearn, OpenCV, Keras, TensorFlow, Pytorch, OpenSlide, Tiatolbox, PathML, HISAT2, DESEQ2, Modeller, PyRx, Chimera. ● Databases: MySQL, Google BigQuery. ● Concepts: Machine Learning, Deep Learning, Convolution Neural Network, Graph Neural Network, Transformer, Molecular Biology, Genomics, Proteomics, Computational Pathology, Algorithms, Statistics, Dentistry, Medicine. WORK EXPERIENCE ● Research Assistant, Feng Cui Lab, Jun 2023 – Present: 🞂 Page 2 | 08161725680 🞂 Resume: OLATUNJI ISAAC TOLULOPE o Application of AI techniques for analysis of biomedical data o Literature review. o Research. ● Graduate Teaching Assistant, General Biology Laboratory, Jan 2022 – Dec 2022: o Delivered lab instructions to two classes of twenty-eight students. o Graded student’s submissions. o Held office hours. ● Dental Team Lead, EHA Clinics, 2019-2021: o Diagnosis and treatment of patients with oral and maxillofacial diseases. o Administrative duties and communication between the dental department and upper management. o Actively involved in writing of standard operating procedures. o Worked with the Informatics team to create a digitized dental patient evaluation form. AWARDS / RECOGNITIONS  Google CS Research Mentorship Program (CSRMP), 2023. Mentorship from Google Researchers towards a computer science research career  Google PhD Fellowship Summit Invited CSRMP Alumni, 2023.  John Wiley Jones Scholarship for International Students, 2022.  Bioinformatics Department Merit Scholarship, 2021. LEADERSHIP SERVICES ● Dental Team Lead, EHA Clinics, 2021. ● Member, Constitution Review Committee, Medical Community Development Service group, Bauchi state, 2018. ● Medical Advisory Chairman, National Youth Service Corps orientation camp clinic, Bauchi state, 2017 ● Pioneer member, University of Lagos Association of Dental Students (ULADS) Senate, 2014/2015 ● Chairman, Ethics and Disciplinary Committee, University of Lagos Association of Dental Students (ULADS) Senate, 2014/2015 EXTRACURRICULAR ACTIVITIES ● Head Coach of undergraduate class football team for 3 years (2013-2015): o Won the ULADS cup with the team twice and came 1st runner-up once. 🞂 Page 3 | tisla91@gmail.com 🞂 Resume: OLATUNJI ISAAC TOLULOPE o Decided tactics, lead training sessions, players selection and co-ordination, man management. ● Football management games and other video games ● Singing 🞂 Page 4 | 08161725680"
}