{
    "ID": "412295099",
    "SOP": "Maksat Kuanyshbay SEAS, Columbia University Personal Statement G.H. Hardy once said: “I have added something to knowledge, and helped others to add more; and … these somethings have a value.” This sentiment profoundly resonates with my academic journey, which began in a high school renowned for nurturing gifted minds in mathematics. It's here that I first discovered my passion for mathematics, a journey that has led me to the pursuit of a PhD in Computer Science at Columbia University, driven by a desire to contribute to the field of computational innovation. My passion for mathematics, particularly geometry, was evident from my early years. It was this fascination with spatial thinking and problem-solving that fueled my success in mathematical competitions and later crystallized my interest in computer science during my undergraduate years at Nazarbayev University, the foremost higher educational institution in Kazakhstan. Here, I discovered the symbiotic relationship between mathematics and computer science, which was further exemplified in my project “Imaging in Seismic Explorations” under Professor Yogi Erlangga. This project entailed applying the method of difference potentials in 2D space on a circular domain, challenging me to translate mathematical theory into practical computational solutions. This early exposure to research was instrumental in shaping my approach to problem-solving and computational thinking. My graduate studies at NYU's Courant Institute of Mathematical Sciences were pivotal in shaping my research trajectory, beginning with a transformative experience in the Computer Graphics course. Under Professor Daniele Panozzo, I discovered the fascinating interplay of geometry and computer science, reshaping my perspective on the practical applications of mathematical concepts I had engaged with since my school days. A significant milestone was my capstone project with Professor Ben Peherstorfer, focused on accelerating ray tracing algorithms using parallel computing. This work deepened my understanding of high-performance computing, which is crucial in complex computer science research. These experiences at NYU Courant were complemented by my work in Professor Rob Fergus' Computer Vision class, where I delved into cutting-edge topics such as Diffusion Models, Transformers in Vision, Semantic Segmentation, GANs, Optical Flow, Stereo Reconstruction, and Text-to-Image models. The culmination of this class was the 'Emoji Diffusion' project, an exploration of denoising diffusion Maksat Kuanyshbay SEAS, Columbia University probabilistic models. It was a significant step in my journey towards understanding the transformative power of computer vision in interpreting and generating visual data. Currently, I am engaged in a research project titled “Surgical Simulation for Manipulating the Omentum” with Professor Gizem Kayar. This research involves developing realistic physical representations of deformable objects using numerical integration methods like Euler’s and Verlet’s methods, an essential aspect of surgical simulations. This research has honed my technical skills and emphasized the real-world impact of computational research in healthcare. My teaching assistantship roles, from being a recitation leader in Honors Linear Algebra to grading for Graduate Computer Graphics, were instrumental in refining my ability to simplify complex concepts. These experiences not only solidified my subject matter expertise but also enhanced my communication and leadership skills, crucial for a career in academia. At Columbia, I am particularly enthused by the opportunity to work with faculty like Professor Changxi Zheng, whose work in physical simulation aligns with my interest in computational models. Professor Carl Vondrick’s research in computer vision offers a perfect platform for further exploration in this field, particularly in the areas of robust and versatile perception models. Additionally, the expertise of Professor Shree Nayar in computational imaging and vision systems aligns with my aspirations in physics- based models for vision and graphics. In joining Columbia University’s PhD program, I aim to contribute to the field of computer science by developing innovative computational models and algorithms. I also look forward to sharing my experiences in programming and mathematics competitions, nurturing a culture of intellectual curiosity and problem-solving skills among students. In conclusion, my journey has been a testament to my commitment to computational research and academic excellence. At Columbia, I am eager to continue this trajectory, evolving as a researcher and educator, and making impactful contributions to the scientific community and beyond, in line with the ethos of G.H. Hardy.",
    "Resume": "Maksat Kuanyshbay mk7756@cims.nyu.edu EDUCATION 01/2021—12/2022 M.S. in Scientific Computing, Courant Institute of Mathematical Sciences, New York University – New York, USA • Cumulative GPA: 3.7 / 4.0 08/2016—06/2020 B.S. in Mathematics, Nazarbayev University – Astana, Kazakhstan • Cumulative GPA: 3.8 / 4.0 • Magna Cum Laude 05/2019—07/2019 Summer Studies in STEM, University at Buffalo – NY, USA HONORS AND AWARDS International 11/2018 2nd Prize, The 1st Al-Khorezmi International Mathematical Olympiad – Urgench, Uzbekistan 05/2018—06/2018 4th Prize, 2nd International Summer School on “Mathematical Methods in Science and Technology” – Almaty, Kazakhstan 04/2018 3rd Prize, 5th North Countries Universities Mathematical Competition – Astana, Kazakhstan 08/2017 3rd Prize, 24th International Mathematics Competition for University Students – Blagoevgrad, Bulgaria National 11/2020 International Bolashak Scholarship, awarded to cover all the expenses related to graduate studies at NYU in amount of $ 140,000 04/2019 2nd Prize, Republican Olympiad in Mathematics – Astana, Kazakhstan 04/2018 3rd Prize, Republican Olympiad in Mathematics – Almaty, Kazakhstan 04/2017 3rd Place, Republican Student Olympiad in Mathematical and Computer Modeling – Astana, Kazakhstan 2016—2018 Dean’s List • For attaining a semester GPA of at least 3.75 out of 4.0 • 5 times for Fall 2016, Spring 2017, Fall 2017, Fall 2018, Fall 2019 2014—2015 Participant of IMO Training Camps • Was among top 12 high school students who were gathered in winter and spring camps for special training and further selection for International Mathematical Olympiad RESEARCH EXPERIENCE 07/2023—Present Research Assistant, Nazarbayev University – Astana, Kazakhstan Name of Project: Multiattribute Utility Functions under Proper Partial Utility Independence Condition: Methods and Applications Principal Investigator: Yerkin Abdildin • Reproduced the research results from “Analysis of Decision Alternatives of the Deep Borehole Filter Restoration Problem” written by Y. Abdildin, A. Abbas (2016) • Constructed multiattribute utility functions for the cases when attributes are fully independent, partially dependent and fully dependent 05/2023—Present Research Assistant, Courant Institute of Mathematical Sciences, New York University – remote Name of Project: Surgical Simulation for Manipulating the Omentum Principal Investigator: Gizem Kayar Page 1 Maksat Kuanyshbay • Studying “Working with Volumetric Meshes in a Game Engine: a Unity Prototype” written by L. Pitzalis, G. Cherchi, R. Scateni, and L. D. Spano (2020). • Studying numerical integration methods, including Euler’s method, Euler-Cromer method, and Verlet’s method for the implementation of mass-spring system that is used to create the physical representation of deformable object 09/2022—12/2022 Graduate Project, Courant Institute of Mathematical Sciences, New York University – New York, USA Name of Project: An Augmented Large Language Model for Patent Acceptance Prediction Course Title: CSCI-GA 2565 Machine Learning Course Grade: A- Course Instructor: Rajesh Ranganath • Designed and implemented an augmented hierarchical language model for the Harvard USPTO Patent Dataset in a 3-person team using Python • Implemented Sentence Transformer with SciBERT word embeddings to transform the input sequence 09/2022—12/2022 Graduate Project, Courant Institute of Mathematical Sciences, New York University – New York, USA Name of Project: Emoji Diffusion Course Title: CSCI-GA 2271 Computer Vision Course Grade: A Course Instructor: Rob Fergus • Experimented with a simplified version of denoising diffusion probabilistic model (DDPM) on an emoji dataset in a 3-person team using Python • Experimented with varying noise scheduler (linear and cosine), loss function (L1 and L2), and model architecture 01/2022—05/2022 Capstone Project, Courant Institute of Mathematical Sciences, New York University – New York, USA Name of Project: Accelerating Ray Tracing Course Title: MATH-GA 2012 Advanced Topics in Numerical Analysis: High- Performance Computing Course Grade: A Course Instructor: Benjamin Peherstorfer • Designed and implemented ray tracing algorithms with parallelization in OpenMP and CUDA in a 3-person team using C++ on Linux • Implemented OpenMP parallelization of ray casting loops for different scheduling and number of threads that provided a near 3x speedup over the original algorithm 11/2019—05/2020 Research Assistant, Nazarbayev University – Astana, Kazakhstan Name of Project: Micro-Electro-Mechanical Systems Problem Principal Investigator: Anastasios Bountis • Implemented in Python professor Bountis’ pull-in solution of the main differential equation according to Singularity analysis • Found the solution using the Python implementation of the 4th order Runge-Kutta method and compared the results 09/2018—07/2019 Research Assistant, Nazarbayev University – Astana, Kazakhstan Name of Project: Imaging in Seismic Exploration Principal Investigator: Yogi Erlangga • Reproduced the research results from “The Method of Difference Potentials for the Helmholtz Equation Using Compact High Order Schemes” written by M. Medvinsky, S. Tsynkov, E. Turkel (2012) • Learned to derive polar forms of the 1st and 2nd approximations of the highly absorbing local boundary conditions using conformal mapping • Used five-node stencil for the numerical approximation of both solution and data Page 2 Maksat Kuanyshbay • Applied the method of difference potentials in 2D space for circular domain RESEARCH INTERESTS My research interests primarily lie with the mathematical foundations of machine learning. I am also interested in the application of numerical methods in differential equation solvers for Computational Fluid Dynamics, 3D Reconstruction in Computer Graphics and Virtual Reality, and Optical Flow of Fluids in Computer Vision. PUBLICATIONS 1. Skrzypacz, P, He, J‐H, Ellis, G, Kuanyshbay, M. A simple approximation of periodic solutions to microelectromechanical system model of oscillating parallel plate capacitor. Math Meth Appl Sci. 2020; 1– 8. https://doi.org/10.1002/mma.6898 WORK EXPERIENCE AND UNIVERSITY SERVICE 01/2021—12/2022 Recitation Leader, Courant Institute of Mathematical Sciences, New York University – New York, USA Course List: Honors Linear Algebra, Math for Economics • Worked 10 hours per week as a recitation leader for the class of around 70 students at the Courant Institute of Mathematical Sciences • Held weekly recitation sessions and office hours, proctored, graded, and gave feedback on students' quizzes and exams 01/2021—12/2022 Grader, Courant Institute of Mathematical Sciences, New York University – New York, USA Course List: Graduate Computer Graphics, Numerical Analysis, Linear, Nonlinear Optimization • Worked 10 hours per week as a grader for the class of around 40 students at the Courant Institute of Mathematical Sciences • Held weekly office hours, graded, and gave feedback on students' assignments 08/2018—05/2019 Board Member of the Student Government, Nazarbayev University – Astana, Kazakhstan • Actively participated in organizing events such as: Scholarship Fair, Informal Sessions with Professors, Winter Camp, Midterm Preparation Nights 08/2018—05/2019 Students’ Representative in the Self-Evaluation Group, Nazarbayev University – Astana, Kazakhstan • Participated on biweekly meetings and discussions about the University’s external Follow up Evaluation process by the European University Association 06/2018—08/2018 Intern in Financial Management Department, KPMG – Astana, Kazakhstan • Developed a sentiment analysis algorithm to study KPMG’s perceived reputation in Kazakhstan • Performed data pre-processing on unstructured data about private and governmental companies listed on Kazakhstan Stock Exchange (KASE) 09/2015—11/2015 Mathematics for Olympiads Tutor, Nurorda High School – Astana, Kazakhstan • Prepared a group of high school students for regional and international competitions in mathematics specifically geometry, number theory, algebra and combinatorics TECHNICAL COMPETENCIES https://github.com/KMaxx Page 3 Maksat Kuanyshbay Python 4 completed graduate courses at New York University: • CSCI-GA 2271 Computer Vision (3 assignments, 1 group project) • CSCI-GA 2565 Machine Learning (2assignments, 1 group project) • MATH-GA 2010 Numerical Methods I (7 assignments) • MATH-GA 2704 Applied Stochastic Analysis (6 assignments) 4 completed undergraduate courses at Nazarbayev University: • ROBT 407 Statistical Methods and Machine Learning (2 group projects) • PHYS 270 Computational Physics with Laboratory (11 laboratory sessions, 6 assignments) • CSE 474 Intro Machine Learning (2 group projects) • ROBT 205 Signals and Sensing with Lab (2 laboratory sessions) MATLAB 2 completed graduate courses at New York University: • CSCI-GA 2945 Advanced Topics in Numerical Analysis: Convex and Nonsmooth Optimization (10 assignments) • MATH-GA 2020 Numerical Methods II (6 assignments) 1 completed undergraduate course at Nazarbayev University: • ROBT 205 Signals and Sensing with Lab (11 laboratory sessions) C++ 2 completed graduate courses at New York University: • MATH-GA 2012 Advanced Topics in Numerical Analysis: High-Performance Computing (4 assignments, 1 group project) • MATH-GA 2270 Computer Graphics (6 assignments) Mathematica 10 solved Wolfram Language Challenges in Programming & Computational Thinking, that helped to get acceptance for Wolfram Summer School. Java 1 completed undergraduate course at Nazarbayev University: • CSCI 152 Performance and Data Structures (11 laboratory sessions, 2 assignments) 12-week app development bootcamp C 1 completed undergraduate course at Nazarbayev University: • CSCI 151 Programming for Scientists and Engineers (11 laboratory sessions, 2 assignments) MATHEMATICAL COURSEWORK Advanced Partial Differential Equations, Fluid Dynamics, Nonlinear Differential Equations, Probability, Mathematical Statistics, Regression Analysis, Real Analysis, Applied Finite Element Methods LANGUAGES English (Fluent), Kazakh (Native), Russian (Fluent), Turkish (Conversational) REFERENCES Prof. Robert V. Kohn Prof. Leslie Greengard Email: kohn@cims.nyu.edu Email: greengar@cims.nyu.edu Prof. Sylvia Serfaty Prof. Yogi Erlangga Email: serfaty@cims.nyu.edu Email: yogi.erlangga@zu.ac.ae Page 4"
}