{
    "ID": "493075143",
    "SOP": "Personal Statement Ever since I embarked on my academic journey, my passion for research and innovation within the realm of construction materials has continued to flourish. As I start a new chapter in my academic journey, I want to express my strong interest in the Ph.D. program in Civil Engineering at Columbia University and share the reasons that fuel my enthusiasm for this opportunity. My journey in research of civil engineering began with an exploration of novel construction materials, a subject that has captivated my curiosity. During my previous academic experience, I focused on understanding the complexities of low-carbon cement. This experience gave me a profound appreciation for the significance of lowering carbon emissions in the construction industry, a sector that is crucial to modern society. My involvement in this research allowed me to delve into the intricate world of construction materials and their environmental impact, thereby laying the foundation for my academic and research interests. As a current Master's student in Chemical Engineering at Columbia University, I possess a strong academic foundation in chemical engineering. This educational background equips me with the interdisciplinary knowledge necessary to approach the study of innovative construction materials from a comprehensive standpoint. An illustrative example of this interdisciplinary approach lies in the quest to enhance the carbonation degree of cement for increased CO 2 absorption. This challenge revolves around transport phenomena and reaction kinetics, domains rooted in chemical engineering principles. The seamless integration of these principles into construction materials research presents a unique opportunity to address pressing environmental issues and optimize material performance. This convergence of disciplines has ignited my passion for this field and reaffirmed my commitment to advancing it further. While pursuing my Master’s degree at Columbia University, I engaged in two significant research projects aimed at addressing environmental challenges. In my first project, which began in June 2023 and is ongoing, I delved into the area of carbon-neutral cement development. This research extended beyond traditional Portland cement, as I explored alternative cement systems, including magnesium oxide cement and fly ash-substituted ordinary Portland cement, with a primary focus on carbonation curing. My investigations encompassed an intricate analysis of various parameters, such as mix design, and their influence on the physical properties and carbonation degree of the cement. To gain a comprehensive understanding, I learned and employed a range of mechanical testing machines to measure the physical properties of cement samples. I also learned and employed thermogravimetric analysis to quantify their mineral compositions. One of the most exciting outcomes of this project was the development of a mix design optimized for high CO uptake, which holds great potential for reducing the carbon 2 footprint in construction materials. Simultaneously, I engaged in another research since May 2022, concentrating on the chemical stabilization of heavy metals within Waste-to-Energy (WTE) fly ash. The primary focus of this project was to find sustainable disposal solutions for WTE fly ash, aiming to make it safe for landfills or suitable for reuse in civil engineering applications. My work involved the exploration of the intricate reaction mechanisms associated with both inorganic stabilization and organic chelation to reduce the leaching of heavy metals. Through rigorous experiments, I uncovered the effectiveness of various chemical agents in reducing heavy metal leachability, leading to the identification of optimal agents. Moreover, I developed cost-effective combinations of agents designed to efficiently stabilize heavy metals within the fly ash. I am drafting a comprehensive manuscript that encapsulates these findings, offering a transformative blueprint for sustainable waste management practices. My knowledge on WTE fly ash has enabled me to make a valuable contribution as the second author to a published review paper titled \"Environmental Standards and Beneficial Uses of Waste-to-Energy (WTE) Residues in Civil Engineering Applications.\" My research experiences have broadened my comprehension of sustainable construction materials and deepened my commitment to the environment and the pursuit of sustainable engineering practices. These endeavors have illustrated the pressing demand for innovative sustainable solutions, thereby fortifying my determination to pursue a Ph.D. program that would empower me to make a meaningful impact. As I contemplate my future academic journey, I am excited by the prospect of joining Columbia University. The program's distinguished faculty, including Professor Kawashima, whom I have had the privilege of interacting with, embodies the kind of mentorship and collaborative spirit that I believe is essential for academic growth. Professor Kawashima's approachability and willingness to support new ideas resonate with my own aspirations for academic exploration and innovation. Additionally, the extensive resources and facilities offered by Columbia University, coupled with its rich network of connections in both academia and industry, are particularly appealing. The Carleton Laboratory, with its state-of-the-art research space and testing equipment, represents an environment where I can realize my research ambitions. It is one of my dream places to work and contribute to cutting-edge research in construction materials. In closing, my journey in research, my academic background in chemical engineering, and my commitment to sustainable construction materials have prepared me to embark on a Ph.D. program that aligns with my aspirations. I am eager to further my education at Columbia University and immerse myself in its vibrant academic community to explore novel frontiers in construction materials research, with a focus on carbon capture, utilization, and storage. I look forward to the challenges and opportunities for growth that this program offers and am excited to contribute to the ongoing efforts to create a more sustainable future for the construction industry.",
    "Resume": "Shengwei Dai 4212 28th St, Apt 11E, New York, NY 11101 • (717) 962 - 6611 • sd3436@columbia.edu • https://linkedin.com/in/dai-shengwei RESEARCH INTERESTS A Chemical Engineering graduate student who is interested in chemical, environmental, and biochemical areas with 4-year laboratory experiential and analytical experience, especially the research topics about sustainable construction material and carbon capture and utilization. EDUCATION Columbia University, The Fu Foundation School of Engineering and Applied Science, New York, NY Master of Science in Chemical Engineering, GPA: 3.7/4.0 Expected Dec 2023 Courses: Advanced Chemical Engineering Thermodynamics, Atmospheric Aerosols, Solid Waste Management, Polymer Physics, Process Control and Safety, Solid State Chemistry, Surface Reaction & Kinetics Columbia University, The Fu Foundation School of Engineering and Applied Science, New York, NY Bachelor of Science in Chemical Engineering, GPA: 3.8/4.0 Sep 2020 – May 2022 Courses: Topics in Soft Materials, Process & Product Design, Linear Algebra, Transport Phenomenon, Alternative Energy Resources, Chemical Engineering Thermodynamics, Energy, Mineral, Material system Dickinson College, Carlisle, PA Bachelor of Science in Chemistry (GPA: 3.6/4.0) Sep 2018 – May 2020 Courses: Organic Chemistry, Inorganic Chemistry, Structures and Functions of Biomolecules, Quantum Chemistry and Spectroscopy, Medicinal Chemistry, Genetics RESEARCH EXPERIENCE Research of CO Cured Cement, Columbia University, Department of Civil Engineering 2 June 2023 – Present § Investigated the possibility of different cement systems including MgO cement and fly ash substituted OPC for carbonation curing. Explored the effect of different parameters such as mix design on cement's physical properties and carbonation degree. § Measured the physical properties of cement samples using various mechanical testing machines and analyzed their mineral composition using the thermogravimetric analyzer. § Development of suitable mix design for high CO 2 uptake cement Chemical Stabilization of Heavy Metals in Waste-to-Energy (WTE) Fly Ash, Columbia University, Department of Earth and Environmental Engineering May 2022 – Present § Conducted independent research to experimentally measure and analyze the chemical stabilization effects of WTE (Waste-to-Energy) fly ash, with a focus on ensuring safe disposal in landfills or its reuse in civil engineering applications. § Investigated the intricate reaction mechanisms involved in both inorganic stabilization and organic chelation techniques to mitigate the presence of heavy metals in WTE fly ash. § Explored the efficacy of a single agent in reducing the leachability of heavy metals within WTE fly ash, leading to the identification of optimal solutions. Formulated cost-effective combinations of agents to efficiently stabilize heavy metals. § Executed comprehensive leaching tests on stabilized WTE fly ash in accordance with U.S. EPA procedures and standards. Utilized ICP- OES for precise examination of element concentrations in leachates. Provided valuable insights into the long-term stability of contaminants and their potential environmental impacts. § Developed and refined an engineering-applicable stabilization procedure for WTE plants. Conducted a comparative analysis with existing literature to optimize practicality and assess potential technical and economic benefits. Currently drafting the manuscript. Research of Filtration Efficiency through Masks, Columbia University, Department of Chemical Engineering Sep 2021 – May 2022 § Conducted an extensive investigation into the filtration efficiency of masks from major brands under the Covid-19 context, evaluating their effectiveness in filtering airborne particles § Designed a specialized reaction chamber to simulate the ambient atmospheric environment for rigorous testing of mask filtration § Synthesized a respiratory solution, consisting of NaCl in physiological concentration, mucin, and lung surfactants for research purposes. Investigated the phase transition and evaporation properties of respiratory droplets, providing valuable insights into their behavior and potential impact on filtration efficiency § Determined the filtration efficiency of masks offered by major brands and analyzed the size distribution of unfiltered droplets. Provided customers with essential guidance for selecting suitable products tailored to their individual needs and preferences. Characterization of APTMS Coated ZnO, Dickinson College, Department of Chemistry May 2019 – July 2019 § Conducted a comprehensive study on photocatalytic properties of unmodified and modified ZnO and their potential usages in wastewater treatment § Synthesized unmodified and APTMS-coated ZnO for photocatalysis experiments; characterized ZnO and APTMS-coated ZnO through SEM and XRD § developed detailed experimental design for determining photocatalytic properties of ZnO and APTMS-coated ZnO using UV-Vis spectrophotometer; evaluated the applicability of ZnO and modified ZnO in wastewater treatment PROJECT EXPERIENCE / SOCIAL SERVICE Design of Co-generation Power Plant Coupled with Desal-Unit, Columbia University Sep 2021 – Dec 2021 § Designed a coal-fired power plant with a desalination unit, achieving desired electricity generation and ideal potable water production using ASPEN § Determined optimal pressure and temperature for reaction chambers; calculated plant size, running hour, estimated cost, and revenue of desalination unit § Optimized power plant for minimal greenhouse effect by modifying system parameters and reduced greenhouse effect by 4% Certified Nursing Assistant May 2018 – Aug 2018 The University of Pittsburgh Medical Center, Harrisburg, PA § Assisted 15+ residents each shift with daily living activities, ensuring they were on time for all meals and activities; provided social and emotional support to improve residents’ morale § Established rapport with team members, residents, and residents’ families; organized and scheduled 20+ weekly patient visits, sending follow-up reminders § Helped residents with daily hygiene, including showering, oral and peri care, and incontinence care; followed RN and LPN instruction for a variety of activities including range-of-motion exercise and sore-relieve exercise PUBLICATION § Yixi Tian, Shengwei Dai, Jianfeng Wang. 2023. Environmental Standards and Beneficial Uses of Waste-to-Energy (WTE) Residues in Civil Engineering Applications. Waste Disposal & Sustainable Energy, Published. TECHNICAL SKILLS Programming: § Python for data analysis Software: § Originlab § ASPEN Laboratory facilities: § PANalytical XPert3 Powder X-ray Diffraction (XRD) § TAM Air Isothermal Calorimeter analysis § Inductively coupled plasma-optical emission spectrometry (ICP-OES) § UV-Vis Spectrophotometer § Zeiss Scanning electron microscopy (SEM) § Micromeritics ASAP 2020 HV BET analyzer"
}