{
    "ID": "445177306",
    "SOP": "For a long while, I have been captivated by the wonders of that chemistry created in the domain in life sciences. The way the chemical reactions and molecular interactions are almost like a hidden language revealing the mysterious story of life. This fascination has fueled my academic journey and drives my curiosity to delve deeper into the intricate world of life sciences. Pursuing my undergraduate and master's degree in chemical engineering, only further deepened my passion for the field. Through a PhD, I aim to explore new research areas, make meaningful contributions and collaborate with esteemed researchers to address complex challenges, particularly in protein engineering from a chemical engineering standpoint. Fundamentals of chemical engineering are vital in protein engineering for designing and optimizing bioprocesses by studying their kinetics through different chemical reactions, enabling the production of valuable proteins for various applications. As a master's student, my practical engagement, including participation in courses like Biopharmaceutical Process Laboratory, and my involvement in Dr. Banta's Research Group has significantly enhanced my practical skills as well as theoretical understanding. Notably, my research endeavors, such as exploring protein-ligand interactions through various analytical methods, provided me with a platform to excel in experimental design and data analysis. Our research on metal binding proteins deepened my appreciation for the intersection of molecular biology and chemical engineering, motivating me to pursue a PhD in these areas. During the research I had to explore the behavior of various intrinsically disordered proteins by culturing them in the lab and then performing analytical experiments such as Fluorescence Resonance Energy Transfer (FRET) and Circular Dichroism (CD) to analyze the binding affinity of those proteins to different rare earth elements. Subsequently, I used various softwares to perform protein-ligand docking in order to view the coordination chemistry and examine the correlation between the structural motifs and the ligand binding sites. Doing so would bring us a step closer towards screening out suitable proteins that can be used in biomining to mine out rare earth elements. I am genuinely intrigued by biotechnology, one of the applications of chemical engineering to refine proteins, a process exemplified by directed evolution and rational design. This field possesses the potential to revolutionize industries and enhance human well-being. This technique allows scientists to selectively alter specific DNA sequences within genes, resulting in tailored changes in protein structure and function. Such precision engineering can lead to the development of novel proteins with optimized properties, ranging from enhanced therapeutic efficacy in medicines to more efficient enzymes for industrial processes. My time at Columbia University, including a summer spent on research, not only advanced my technical capacity but also involved mentoring new students who significantly contributed to my research in the later stages. Teaching them the basics of laboratory techniques in a stepwise manner along with the concepts revolving around them not only reinforced my understanding of the concepts surrounding the experiments we conduct but also improved my ability to handle multiple tasks while conducting my own research. Working simultaneously on multiple projects, including assisting fellow researchers, has honed my teamwork, troubleshooting, and leadership skills, fostering an environment of shared scientific pursuit. After just seven months, I have learned a lot of hands-on techniques and methods of data analysis. However, when I see the depth of knowledge my mentors at Columbia University have, it's clear I have much more to grasp. I believe there is still a wealth of learning for me here, and that is why I am eager to extend my stay and dive into a PhD program. Columbia offers a unique environment for me to gain a deeper understanding of science and research, and I am excited to explore these opportunities further. My ambition involves combining hands-on experimentation and computational simulations to unravel the intricate mechanisms governing protein functionality. Subsequently, I aspire to leverage this profound understanding to engineer innovative solutions for significant challenges within the realm of biotechnology. This educational journey will equip me with invaluable skills, knowledge, and a strong network, empowering me to make a meaningful difference in the realm of chemical engineering. I am excited about the potential for growth and exploration that a PhD offers, and I embrace the challenges and opportunities that lie ahead in my academic pursuit.",
    "Resume": "PIYUSH KUMAR +1 646-240-8689|piyush.k@columbia.edu|https://www.linkedin.com/in/piyushskumar/ EDUCATION Columbia University, New York, NY Masters of Science in Chemical Engineering; GPA: 3.92/4 Expected Dec 2023 • Relevant Coursework: Computer Simulations in Biology, Solid State Chemistry in Pharmaceutical, Advanced Chemical Kinetics, Advanced Chemical Engineering Thermodynamics, Project Management. Dwarkadas J. Sanghvi College of Engineering, Mumbai, IN Bachelor of Engineering in Chemical Engineering; CGPA: 9.31/10 Jun 2022 • Relevant Coursework: Biotechnology, Mass Transfer, Engineering Chemistry, Chemical Reaction Engineering. WORK EXPERIENCE Columbia University, New york, NY May 2023 - Present Student Research Worker • Assembling proteins in pET vector and designed its primers by using Benchling and NEbuilder Assembly tool in tandem. • Performing heterologous protein expression via cell culture technique and purified it using affinity chromatography. • Performing FRET and CD to study the metal binding affinity of the different proteins obtained with 8 rare earth metals. • Conducting protein-ligand molecular docking using various software tools to analyze protein binding sites. • Managing technical training of interns, resulting in a 33.33% reduction in the time required to gather data on various proteins. Columbia University, New york, NY Sep 2023 - Present Grader • Working for CHEN E4800 Protein Engineering with prof. Scott Banta to grade homework and exams. Columbia University, New York, NY Jan 2023 - May 2023 Graduate Research Assistant • Gained hands-on experience in molecular cloning techniques and standard laboratory procedures such as calibration of bioreactor, autoclaving, gel electrophoresis, DNA extraction, and FPLC protein purification technique. • Altered DNA sequences using Gibson Assembly and restriction digest and cultured them in E-coli. Adage Automation Private Limited, Verna, IN Jul 2021 - Jul 2021 Engineering Intern • Received hands-on experience with respect to process gas analyzer, gas chromatograph, and CV analyzer along with its applications. Aaharya Technologies, Vijayawada, IN Feb 2021 - Mar 2021 Engineering Intern • Designed 80% of flowsheet of Dimethyl-Ether manufacturing plant on Aspen Hysys single handedly and designed more than 10 heat exchangers using Aspen Exchangers software and succeeded in its energy optimization by approximately 60%. PROJECTS AND RESEARCH Columbia University, New york, NY Sep 2022 - Dec 2022 Biopharmaceutical Process Laboratory • Performed protein purification on a mixture of lysozome and α-chymotrypsinogen by employing ion-exchange chromatography, analyzed the chromatograms for retention time, absorbance and improved the resolution to a value of 1.86. • Conducted an Powdered X-Ray Diffraction (PXRD) analysis on crystals grown under 5 different conditions to assess its characteristics. • Conducted a water permeability test and the desalination of water by employing the tangential filtration model with a 5k membrane. • Simulated fermentation conditions by varying agitation and flow rates in the bioreactor during depletion and replenishing of oxygen. • Compacted a blend of MCC and tartrazine by using MTS machine at 3 different pressures and then tested its solubility properties. Dwarkadas J. Sanghvi College of Engineering, Mumbai, IN Jul 2021 - Apr 2022 Manufacturing of Sorbate and Sorbic Acid • Performed material and energy balance for more than 15 equipments, devise and simulated process flow sheets using Smartdraw and Aspen Hysys and worked on optimization of the process and modified the process thus increasing the flexibility of the process. TECHNICAL SKILLS • Laboratory Skills: Chromatography (Ion exchange - UNICORN software, Affinity, AKTA), Optical Microscopy, PXRD analysis, Compaction (MTS 7 kip compaction system), Filtration (minimate TFF capsule), Western Blot, Gel Electrophoresis, PCR, electroporation, Primer Design and Plasmid Construction (Benchling, NEbuilder Assembly tool), SDS-PAGE, Western Blot, Staining, Buffer and Media Preparation, Cell Culture, DNA extraction (Plasmid and Genomic), RNA extraction, FRET (Softmax Pro Software), Nanodrop. • Programming Language: Python (NumPy, Pandas). • Simulation Softwares: Autodock, PyRx, Vega ZZ, Open Babel GUI, Avogadro, PyMOL, AlphaFold, Aspen (Hysys, EDR), Polymath, Sympy, Chemsep, MATLAB, AutoCAD, Canva, Smartdraw. LEADERSHIP AND ACTIVITIES • Selected as the MS Ambassador of the chemical department to mentor the incoming MS candidates with their program onboarding. • At PACE EOS, spearheaded a 40-member team and collaborated with 14+ institutions' committee heads to ensure seamless execution of events with national-level celebrities. • Completed the Bronze level of Duke of Edinburgh Awards."
}