{
  "document_name": "Zhao, Xiaoyu (001160467).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Zhao, Xiaoyu; DOB: 07/28/2000; ID: 001160467\nXiaoyu Zhao\nMy love for Raman imaging began when I was a first-year bachelor student at Imperial College\nLondon. At that time, I was a huge fan of Professor Molly Stevens, and she kindly accepted me to\njoin her group. My resume was very fortunately picked up by Dr. Vernon LaLone, who later became\nmy supervising postdoc for the next 3 years.\nI had no idea what Raman imaging was at that time, but I always saw the sparkles in Vernon’s eyes\nwhenever he talked about Raman imaging. It was probably one of my luckiest decisions because\nover the next 3 years, we developed one of the top Raman technologies in the world—the ultra-\nquantitative Raman analysis method. This method transformed semi-quantitative Raman analysis to\na fully quantitative level in terms of concentration. We became the first group in the world that\ncould visualise the 3D distribution of drug metabolism and drug deposition within human liver\norganoids without any need for sample preparation.\nOur first and only paper was published in Cell Reports Methods in April 2023, and all the Raman\ndata in this paper were processed and generated by myself. The paper soon received comments from\nProfessor Lev T. Perelman from Harvard University for its significance in the medical field.\nVernon went back to the US after my bachelor's study finished. I was very worried that nobody\nwould answer my questions after Vernon left, so I found his supervisor, Dr. Conor Horgan, who was\nworking at a spin-out company from King's College London called HyperVision Surgical. The\ncompany focused on hyperspectral imaging for tumor detection and anastomotic leakage. I\nimmediately applied for an internship position and explained to the team how I developed the\nalgorithm for ultra-quantitative Raman imaging. I received the offer during the interview and soon\nstarted working part-time throughout my entire master's degree. I worked during the day and caught\nup with my studies at night. I felt extremely excited, tired, but blessed during that time. Towards the\nconclusion of my studies at Imperial College London, I attained a First-Class Honours degree in\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Zhao, Xiaoyu; DOB: 07/28/2000; ID: 001160467\nXiaoyu Zhao\nBiomedical Engineering and secured UROP scholarships for three consecutive years. Additionally, I\nearned an honorary appointment at King's College London and received a UK National Health\nService honorary appointment at Guy’s and St Thomas’ Hospital in recognition of my contributions\nat HyperVision Surgical.\nI felt extremely lucky because this small company turned out to be one of the fastest-growing\nstartups in London and was presented at the annual NVIDIA GTC 2022 keynote by CEO Jensen\nHuang as part of the “I am a visionary” section. Within one year, we started with the basic\nalgorithm and finished with 90 in-patient studies, including 9 colorectal surgeries and 81\nneurosurgeries. The company grew extremely fast, and I learned huge amounts of knowledge from\neveryone on the team. My CEO, Dr. Michael Ebner, showed me the possibility of starting my own\nstartup company with the technology I love.\nAfter my Raman algorithm was fully developed, I kept looking for a suitable application for it. At\nthat time, the best image I generated was of some human-engineered cartilage samples from a\nresearch group at ETH Zurich. I showed my Raman results to Professor Marcy Zenobi-Wong, and I\nobtained a Ph.D. position in her lab. However, after I finished my last experiment for an animal\nstudy in which we implanted the human-engineered cartilage subcutaneously under the rats, I\nnoticed a huge problem from the samples through my Raman analysis. Almost all the glycogen\nwithin the cells got depleted, which means the engineered cartilage samples will die in a matter of\ntime. Although the cartilage culture didn’t go very well, my Raman analysis was always beautiful!\nDuring my time at ETH, I became the organizing committee of the 6th Raman workshop and got\nthe opportunity to present my work. It was my happiest day when I received an email from our\nsponsor, Dr. Mirjana Dimitrievska, who is the group leader at Empa, Swiss Federal Laboratories for\nMaterial Science and Technology: 'I had a hard time deciding on the 3rd candidate, as in the other\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Zhao, Xiaoyu; DOB: 07/28/2000; ID: 001160467\nXiaoyu Zhao\nabstracts I feel that Raman spectroscopy plays a side role, and it is more used as a general technique\nto support the project, rather than the center of it. Honestly, I think that it might be a good idea to\nkeep Xiaoyu Zhao as an applicant and give her the award in the end, as her work is more deserving\nthan the other applications. She presents a different aspect of Raman spectroscopy that could\npotentially have a high impact in health and medicine, and I think it deserves to be acknowledged,\nespecially as it seems better than the other 4 candidates. Also, as you are giving 3 awards, I think it\nis okay that she is in the organizing committee and getting it. We need to support good work, and\nshe is doing it, so I feel that it is fair.'\nAs a technique that is extremely new but is for sure a transforming tool, Dr. Dimitrievska’s\ncomment encouraged me a lot because it was a journey that is extremely work-intensive but pays\nback very little in the first couple of years. I had no interest at all in culturing cartilage, and I was\nkept amazed by Professor Wei Min’s work.\nThe primary limitation with my current technique lies in the hardware; spontaneous confocal\nRaman microscopy is an extremely slow tool, and the majority of my images took 8-20 hours to\nfinish. However, with the stimulated Raman imaging system that Professor Min has developed,\nimages could be taken within minutes. I always wanted to combine my algorithm with a stimulated\nRaman imaging system and increase my imaging speed. I also had a huge desire for a Professor\nwho could teach me more about biological Raman imaging, especially about the hardware. I believe\nRaman imaging stands as a highly promising method for addressing various challenges in biological\nresearch. Its unique non-invasive nature makes it the only technique capable of investigating living\nsamples and leaving them intact.\nDespite my enthusiasm for Raman, I am fully aware that there is a huge gap exists in my\nunderstanding, and I recognise that mastering the construction of a stimulated Raman microscope\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Zhao, Xiaoyu; DOB: 07/28/2000; ID: 001160467\nXiaoyu Zhao\ncompatible with my software demands a more comprehensive skill set. Therefore, a PhD with a\nspecific focus in the field of biological Raman imaging would be necessary for me to delve deeper\nin analytical chemistry.\nI had an interview with Professor Min and got his full support for a Ph.D. position at Columbia\nUniversity. I immediately quit my Ph.D. at ETH and started to self-study the fundamental\nknowledge in photonics and chemistry. I also lead a team to launch the first online platform for\nbiological Raman analysis with the aim to fully understand the best application for quantitative\nRaman imaging. During the gap period, I attended many competitions in China and received many\nawards. I met all the companies in China who are working in the field of Raman, and got many\nsamples for independent investigation. This hands-on experience solidified my conviction that\nbiological Raman analysis is a vital asset for the imaging market, and I foresee Raman becoming a\ndynamic and rapidly expanding field in the coming years.\nHaving spent five years immersed in Raman research, I am certain that it is my lifelong passion. For\nthe next five years, I want to do more research, promote biological Raman analysis in the scientific\nfields and show more people that Raman analysis has an indispensable role in basic research. I am\neager to join Columbia University to further my knowledge in super multiplexed Raman imaging,\nwith the ultimate goal of developing the most advanced Raman imaging system in the near future.\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}