{
  "document_name": "Jimenez, Daniella (021687000).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Jimenez, Daniella; DOB: 04/05/2000; ID: 021687000\nDaniella Jimenez\nI was first introduced to biomedical engineering as a rising senior in high school as I\nparticipated in a six-week intensive summer program where I learned about applying engineering\nprinciples for clinical translation. Since this experience, I have felt an inclination towards the\nfield and sought out opportunities such as internships to exercise biomedical engineering work.\nDuring my undergraduate career, I chose to achieve an understanding of the physical sciences\nand majored in biochemistry while minoring in mathematics; however, I always maintained\nbiomedical engineering in sight. Thus, pursuing a Master’s degree seemed to be the most natural\nnext step in my academic career.\nUpon enrolling at Columbia University for my Master of Science in biomedical\nengineering, I recalled my greatest learning experience at the Ultrasound & Elasticity Imaging\nLaboratory where I interned for almost two years as an undergraduate student. Here, I dabbled in\nboth wet and dry laboratory skills as I executed experiments to assess the acoustic stability of\nlipid-shelled microbubbles under therapeutic ultrasound which are typically used for focused\nmediated blood-brain barrier opening. Specifically, I learned how to make microbubbles and\nprepare tissue mimicking phantoms to characterize the acoustic cavitation occurring within safe\nfocused ultrasound parameters. Within this work, I was also exposed to coding as we used\nMATLAB to analyze the data acquired. This experience allowed me to learn beyond attaining a\nskill set. Among the life lessons I received, I recognized the importance of mentorship. I had the\nprivilege to work with a postdoctoral mentor who, from the beginning, established his trust in me\nas a young researcher. As a result, I felt confident in my own thought processes and abilities to\nexecute an experimental design and was more likely to ask questions and express concerns due\nto his approachability. Consequently, the following summer I was successfully able to lead nine\ninterns in conducting their own individual projects as I channeled the mentorship that was\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Jimenez, Daniella; DOB: 04/05/2000; ID: 021687000\nDaniella Jimenez\nprovided to me. I credit this experience for highlighting teaching as an unequivocal skill. I\nunderstood that the ability to simplify advanced concepts such that others can comprehend was\nnecessary to impart knowledge and keep students encouraged and motivated. This was one of the\nmost important skills I learned as an intern and that which I continue to embody as an instructor\nat the CCNY Stem Institute, as a tutor, and now as a mentor once more upon my return to UEIL.\nUEIL has taught me invaluable skills. In addition to the significance of mentorship,\ntroubleshooting and optimization have also been emphasized. Upon my return to the lab, I have\nhad the incredible opportunity to perform research as a Master’s student and grew to be\nindependent rather rapidly. As my lab mentor graduated, I was given the rare opportunity to\ninherit her work and undertake work to be presented at one of the lab’s most prestigious\nultrasound conferences. While this was an exciting experience, it was also quite daunting as I\nwas tasked to design experiments and optimize factors such as staining and imaging protocols\nand perform in vivo murine research. I was entrusted to investigate the effects of focused\nultrasound-mediated blood-brain barrier opening on the blood-cerebrospinal fluid barrier which\nhas never been studied before. Here, it was inevitable to become overwhelmed as the research\nand the skills were incredibly novel, let alone with the anticipation of deadlines. Fortunately, I\nrelied on my thought processes as well as the expertise of my colleagues whose collaboration\nfacilitated the progress of the research. Through this experience, I recognized the difficulty of\nleading a project at first hand. However, I became confident in my ability to optimize factors in\nthe workflow of an experiment. Moreover, I further emphasized the need for collaboration and\nteamwork in order to produce a fruitful outcome.\nAt this point in my academic career, I am confident that the work I have executed and the\nexperiences I have undergone have prepared me to take on the next step - to enroll in a doctoral\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Jimenez, Daniella; DOB: 04/05/2000; ID: 021687000\nDaniella Jimenez\nprogram for biomedical engineering. I envision myself practicing the skills I have attained thus\nfar and building upon them such that I will continue to make advancements in the field. I look\nforward to mentorship opportunities where I can share what I have learned and inspire others,\nespecially those resonating with my background, to conquer trailblazing experiences, including\npursuing graduate studies. Specifically, I am excited to continue to explore the potential of\nultrasound applications, promising potential for noninvasive resolutions to our most critical\nmedical needs, including the treatment of Alzheimer’s disease. I am confident that I will be\nsuccessful in achieving my goals within this endeavor as I strive toward becoming a doctoral\nstudent in Professor Elisa Konofagou’s Ultrasound & Elasticity Imaging Laboratory.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}