{
  "document_name": "Wei, Haochen (085541001).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Wei, Haochen; DOB: 04/19/1999; ID: 085541001\nMy parents asked me a question when I had just received my college offer: \"What is your life's\ngoal? Is it money or position?\" I couldn't provide an immediate answer, but this question\ncontinued to linger in my mind. During my junior year, I had the opportunity to intern at Beijing\nAutomotive Group Co., Ltd. (BAIC), where I assisted in powertrain calibration. The job was\nenjoyable, but I yearned for more freedom in product development. Fortunately, during my\ngraduate studies at Johns Hopkins, I was privileged to work in SMARTs lab. Although the\nresources and project scope at the university were incomparable to the vehicle design work at\nBAIC, I found immense satisfaction in the freedom to develop my projects. It was during this\ntime that I came to understand my life's true goal. It wasn't about money or fame. As an engineer,\nmy life's purpose is to create something beneficial for the world. This realization set me on a\npath to pursue a Ph.D. degree. I aspire to secure a research position in an institute or company,\nwhere I can explore new ideas and create innovations. A Ph.D. is the foundational step on this\njourney, leading me toward the fulfillment of my life's goal.\"\nBased on my previous experience and my interesting. I want to join the Columbia University CS\nPHD Program and focus on MR Application/Robotics visual servoing or Visualization and\nComputer Graphics study.\nMy Ph.D. career will build upon the knowledge and experience I gained during my master's\nprogram. I graduated from the JHU MSE Robotics program in May 2023, where I acquired a\nsubstantial foundation in robotics-related subjects and conducted research at LCSR. I gained\nexpertise in various areas, including Linux, ROS (Robot Operating System), Unity, AR/VR\ndevelopment, gaze tracking, computer vision, and machine learning. I also have practical\nexperience with the Da Vinci Research Kit (dVRK). My involvement at JHU centered around\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Wei, Haochen; DOB: 04/19/1999; ID: 085541001\ntwo major research projects: the development of a robotic surgery first assistant training tool and\nthe creation of a VR Virtual Dizziness Clinic.\nThe robotic surgery first assistant training tool originated as a course project. I enrolled in the\nComputer Integrated Surgery II class, where I undertook a semester-long project under the\nguidance of Professor Peter Kazanzides. The project stemmed from the recognition that the role\nof the first assistant is pivotal in the success of robot-assisted surgeries. There was a lack of\navailable simulators for first assistants to co-train with the primary surgeon who operates the\nrobotic system. I initiated the project by focusing on instrument localization since knowing the\nprecise location of instruments is essential for first assistants to interact accurately within the\nvirtual environment. After evaluating various methods, considering factors such as accessibility,\nlatency, accuracy, and minimizing modifications to the handheld instruments, I decided to\nemploy a stereo camera and traditional computer vision techniques to address this challenge.\nOnce I successfully obtained accurate instrument positions, I designed a pipeline to transmit this\ninformation to Unity using a UDP socket, allowing for the correct rendering of instruments\nwithin the Unity environment. The course project reached its conclusion due to time constraints,\nbut I was determined to extract more value from the system. Consequently, I continued my work\nwithin the lab, aiming to enhance the system. I explored additional features, including endoscope\nlocalization via endoscope views, experimented with instrument detection using background\nsubtraction, and attempted to use the disparity map to ascertain the status of the end effectors on\nthe instruments. Although some of these endeavors faced challenges, like issues related to\nmodeling and resource limitations, I successfully transitioned the system from Unity to the\nAsynchronous Multi-Body Framework (AMBF), an open-source simulation environment\ndeveloped by research scientist Adnan Munawar at JHU.\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Wei, Haochen; DOB: 04/19/1999; ID: 085541001\nAt this point, the system had evolved to effectively collaborate with the da Vinci Research Kit\n(dVRK). The initial results of this work were accepted and presented at the International\nSymposium on Medical Robotics (ISMR).\nThe second project originated from a collaboration with Dr. Kemar Green, a neuro-\nophthalmologist. During the COVID-19 pandemic, Dr. Green encountered a significant\nchallenge in telemedicine. For the accurate diagnosis of certain conditions, particularly those\nrelated to gaze patterns, neuro-ophthalmologists require precise gaze data. While gaze estimation\nis possible through video, the data obtained this way may not be as accurate as needed for\ndiagnostic purposes. Unfortunately, sending specialized devices to patients' homes for these\nmeasurements was impractical. To address this issue, a solution using off-the-shelf hardware\nbecame essential. I conducted a rapid assessment of the task and developed a prototype using the\nHoloLens 2, which offered a simple user interface and automated data collection, ensuring the\nquantitative and accurate analysis of gaze patterns. This project is still ongoing, with the initial\nwork aimed at presentation at the IEEE VR conference.\nBoth projects were primarily undertaken by me under the guidance of Professor Peter\nKazanzides. Professor Peter provided the overarching vision and valuable insights. I was\nresponsible for designing the pipeline, writing, testing, and debugging the code, as well as\ncreating and modifying the hardware and phantom models. I also received significant assistance\nfrom numerous research scientists at the LCSR Lab. This experience allowed me to step out of\nmy comfort zone, beyond classroom learning, and acquire a wealth of new knowledge from\npractical research.\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Wei, Haochen; DOB: 04/19/1999; ID: 085541001\nAs I reflect on my journey, I find immense satisfaction not only in the outcomes but also in the\npersonal growth I've achieved. My foray into the world of robotics began in the fall of 2021, at a\npoint when I had limited knowledge of Linux, ROS, AR, and computer vision. However, over\ntime, I not only acquired expertise in these areas but also developed the skills to facilitate\ncommunication between programs, navigate complex research platforms, and optimize software\nperformance. Equally important was my ability to establish strong connections with my\ncolleagues in the lab. Engaging in research was a profoundly enjoyable experience, one that\nfueled my intrinsic motivation to create something novel and valuable. This experience markedly\ncontrasted with my prior internship in a large corporation and solidified my decision to pursue a\nPh.D. program. In retrospect, it affirmed my capacity for rapid learning, my proficiency in\ncommunication, and my unwavering commitment to excel in my Ph.D. journey.\nI am enthusiastic about specializing in AR/VR, visual servoing, computer graphics, computer\nvision, and related fields, and I believe that Columbia University is the perfect institution to\nnurture my growth in these areas. My swift transition from a mechanical background to\ncomputer science robotics illustrates my capacity for quick adaptation. Although I didn't take\nclasses on data structures or computer networks, my research experience substantiates my\nknowledge in the fundamental computer science domains. Furthermore, I haven't overlooked my\nmechanical knowledge, which includes expertise in control, CAD, and FEA. These skills can\nsignificantly enhance my contributions to the field of robotics.\nI sincerely wish Columbia could allow me to dive further into this area. I am confident that I will\nbe successful in my Ph.D. career and provide a step forward to the community!\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}