{
  "document_name": "Ganesh Bhat, Mahesh (085892373).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Ganesh Bhat, Mahesh; DOB: 11/08/1996; ID: 085892373\nMaheshGaneshBhat\nIt seemed like magic when I got my first video gaming console: an array of objects working\ntogether to provide a new experience made possible by something. I realised the science of that\nmagic when I started understanding the world of electricals, electronics, and integrated circuits.\nThe idea of a bunch of tiny devices being able to contain so much data and perform so many\nfunctions attracted me towards electronics.\nMy strong academic foundation during my Pre-University studies facilitated my pursuit of an\nundergraduate degree in Electronics and Communications Engineering at The National Institute\nof Engineering. Participation in Robotics workshops and implementation of\nmicrocontroller-based projects, such as obstacle-avoiding bots, line-following bots, and\nDTMF-Controlled bots, piqued my interest in Microcontrollers, Control Systems, and Embedded\nSystems. This led me to undertake projects based on Arduino during my undergraduate studies,\nincluding the development of a Resistive Touchscreen-based Smart Wheelchair for the\ndifferently-abled. This project motivated me to delve deeper into microcontroller architecture. For\nmy graduation team project, I designed a Visible Light Communication system using the\nSystem-on-Chip RaspberryPi for medium bit-rate data transmission of files. The system\nachieved speeds of a few Megabits per second and successfully transmitted data of up to 6\nkilobytes with minimal errors.\nMy fascination with the realm of technology has motivated me to further my education and\npursue a graduate degree. After evaluating various academic institutions, I elected to enrol in\nthe Communications Engineering master's program at the prestigious Technical University of\nMunich. Despite its nomenclature, the program is a culmination of diverse courses and electives\nthat encompass a range of subjects relevant to communication technology, including hardware,\nsoftware, and mathematical concepts. Based on my prior interests and current knowledge, I\nhave identified two streams that are of particular interest to me: Embedded Systems and\nSecurity, and Data Networks and the Internet of Things (IoT).\nThe German higher education system offers a valuable opportunity for students to gain practical\nexperience in research through a structured course format that includes a research internship\nand a master's thesis. In this regard, I was fortunate to secure a research internship at the\nFraunhofer Institute for Applied and Integrated Security (AISEC), where I worked for three\nmonths on integrating Compute Unified Device Architecture (CUDA) into the institute's secure\nvirtualisation solution. During my time at the institute, I gained hands-on experience with the\nYocto-based Linux distribution and acquired fundamental knowledge of operating system\ndevelopment. Building on my prior student project experiences, I was able to secure a research\nopportunity for my master's thesis at Huawei Munich Research Center, a leading industry player\nin telecommunications and data networks.\nDuring my time at Huawei, I conducted an investigation and comparison of Network\nManagement Protocols for Industrial Networks. This involved the development of prototype\nimplementations of complete RESTCONF and the newly proposed CORECONF stack in C,\nusing standard GNU libraries. The performance of these protocols was then compared against\nthe currently used NETCONF, with respect to key parameters. The test network was emulated\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Ganesh Bhat, Mahesh; DOB: 11/08/1996; ID: 085892373\nMaheshGaneshBhat\nusing a combination of mininet in docker virtualisation. This experience provided me with\nvaluable technological and personal skill improvement and practical research skills related to\nliterature survey, timeline and milestone determination, and documentation. The research has\nbeen submitted to the IEEE IoT Journal and is under review. These experiences have prepared\nme for the extensive effort required in successfully pursuing and completing a Doctoral research\ndegree.\nI am a diligent and disciplined student who likes to keep simple goals and keep expanding along\nwith newer add-ons. Being a part of various co-curricular student bodies like the quiz club and\nthe Innovation and Multimedia committee, I have paid utmost attention to balancing academics\nand extra-curricular tasks, constantly trying to expand my knowledge of the core basic subjects\nof electronics. This is an important reason for me to take up this course to enhance my learning.\nI believe that with these experiences working on relatively niche concepts with little to no prior\nheadstart, I have gained devotion towards dedicated research work to satiate my curiosity which\nmight be a good fit for a doctoral research candidate.\nColumbia University is a highly esteemed academic institution renowned for its significant\nresearch contributions. The Department of Electrical Engineering covers a plethora of domains\nthat intrigue me, given my interest and prior research experience in the Internet of Things (IoT).\nIn particular, the research interests of Dr. Zoran Kostić seem very interesting and appealing\ngiven my affection towards the areas of Industrial IoT, Security and Embedded Systems and I\nwould be glad to get an opportunity to work under his tutelage. I am eager to pursue my\nacademic aspirations at Columbia University and contribute to the institution's legacy of\nexcellence in research and education.\nThe pursuit of a doctoral degree is of great interest to me as it would allow me to delve deeply\ninto and broaden my understanding of the fundamental components that make daily living\npossible. Upon completion of the program, my primary objective is to join an organization and\ngenerate original ideas that satisfy people's curiosity. As a model student, I would enhance the\nreputation of the university. The academic knowledge and practical experience gained through\nthe PhD program would enable me to add value to the esteemed institution. After a thorough\nexamination of the available courses, I am confident that I will be guided towards a\ndistinguished career path.\nIn a nutshell, I yearn to be a part of the Ph.D. program at Columbia University. Being part of the\nelite and revered institute would be an honour. I look forward to having a great learning\nexperience, and I greatly appreciate your consideration of my application.\nThank you in advance for considering my application.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}