{
  "document_name": "Jaikumar, Shreyas (125307276).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Jaikumar, Shreyas; DOB: 12/08/1995; ID: 125307276\nSTATEMENT OF PURPOSE\n“I can accept failure. Everyone fails at something. But I can’t accept not trying.” I can say that this quote by\nMichael Jordan is the epitome of my coding endeavors and per my ideology are words to live by. During\nmy undergraduate days, I developed a strong affinity towards mathematics which thereby strengthened\neven more while pursuing my Master's Degree in Financial Engineering from Stevens Institute of\nTechnology. My master's journey, however, had a tumultuous start wherein I hit rock bottom from both an\nacademic and a personal perspective. This was mainly because the type and the level of exposure I had in\nmathematics and computer science during my undergraduate days was different compared to that of the\nrigorous master's program. A major “eye-opening” experience was when I had taken this elective called\n“C++ Programming in Finance” wherein it had started at a novice level but progressed geometrically in\nterms of difficulty thereby getting into the depths of Object Oriented Programming. My entire summarization\nof this course can be equated to the quote that I referenced at the start of the paragraph. I worked hard to\nget each of my codes to compile and run as per the assignment’s expectations and the moment that\nhappened it was always a euphoric feeling that cannot be described in words and I have experienced that\nfeeling only a handful number of times in my lifetime.\nThat was when I became extremely enamored and intrigued by the power of coding and its real-world\napplication in the field of Quantitative Finance and Algorithmic Trading and there was no looking back, ever\nsince then. Having then decided and aspired to a career as a Quantitative/Algorithmic Trader, I decided to\nshape my coursework as programming intensive as possible. While certain courses such as Market\nMicrostructure & Trading Strategies, Portfolio Theory & Applications, and Algorithmic Trading Strategies\nrequired the usage of R and Python programming languages, other courses such as Advanced Derivatives\nand Computational Methods in Finance mostly required the usage of Object Oriented Programming in C++.\nMy final project had two parts to it wherein the first part was Quantifying & Increasing Diversification in\nInvestment Portfolios by employing certain concepts such as Effective Number of Bets, Principal\nComponent Analysis, and Minimum Linear Torsion. The second part of the project was Asset Allocation\nOptimization using Clustering and Deep Learning Techniques. This multi-faceted curriculum thereby\nSHREYAS JAIKUMAR\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Jaikumar, Shreyas; DOB: 12/08/1995; ID: 125307276\nenabled me to study, comprehend and implement a wide array of quantitative skills and programming\nlanguages which served to be extremely beneficial during the onset and on to the later stages of my\nprofessional career as a data scientist and as a data analyst as well.\nAfter having graduated from my master's program by May 2020 wherein at that time almost any sort of job\naspirations (let alone ambitious and high-paying jobs) were hindered due to the worldwide bleak economic\nclimate, as a result of COVID-19. However, I did manage to capitalize on that scenario by trading options\n& derivatives in the stock market and thereby pragmatically applying all the knowledge and skills that I had\nlearned so far in graduate school. I also secured a job as a consultant in Tata Consultancy Services Limited\nwherein my first role was as a data scientist at JetBlue Airways Corporation and my successive role as a\ndata analyst for an online travel agency, Priceline. Both these diverse roles required me to learn a different\nset of skills and thereby required the usage of various programming languages. For example, R and mainly\nPython were used for predictive modeling, unit testing, and data warehousing processes such as extraction,\ntransformation, curation, and loading. SQL was used for querying to analyze and extract data from various\ndatabases like Snowflake, Oracle DB, and Google Cloud Platform. I was also responsible for the conversion\nof SQL to Spark SQL queries to perform the necessary executions in Databricks’ clusters and to satisfy\ncertain framework requirements. Lastly, Tableau and Spotfire were used to visually represent the\nexploratory and explanatory data analysis of the EMS (Even More Space) pricing module thereby identifying\npricing opportunities, demand, booking behavior, and potential outliers.\nWhilst pursuing my former role in JetBlue, various Machine Learning and Ensemble models were modeled\nby us and also a good amount of computing power and clusters were required to run the respective models.\nThat was when I realized that I only knew what had to be done when from an application point of view and\nconsequently, I wanted to obtain a detailed working knowledge regarding the mechanics behind the\nassociated hardware and software used. Having been a financial engineering student and a data scientist,\nI have realized the significance of Artificial Intelligence in both the financial and airline industries and its\npotential to revolutionize the way we approach complex situations and problems. I have also come to\nappreciate the importance of Computer Architecture and its impact on the performance of the algorithms\nSHREYAS JAIKUMAR\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Jaikumar, Shreyas; DOB: 12/08/1995; ID: 125307276\nwe use. This motivated me to go on a brief learning path towards AI, GPUs, SSDs, and CUDA, which further\nled to the reading and comprehending of various research and white papers in the field of Computer Science\nand Engineering along with those papers which were overlapping with that of Algorithmic Trading as well.\nHaving obtained an Undergraduate Degree in Electrical and Electronics Engineering, I believe that\nadvancing to a Ph.D. in Computer Science from the world-renowned Columbia University will equip me with\nthe necessary skills and knowledge to further explore these areas of interest and help tackle the associated\nproblems. Consequently, I am interested in exploring the intersection of Artificial Intelligence and Computer\nArchitecture, especially in the context of developing efficient algorithms for large-scale and multi-\ndimensional data processing. The rise of Big Data has led to a need for faster and more efficient computing,\nand I am excited to be a part of this rapidly evolving field. I am also interested in exploring the potential of\nAI in optimizing hardware performance and improving power efficiency. Furthermore, I am eager to\ncontribute to ongoing research in these areas and work towards developing practical solutions that can be\nimplemented in real-world scenarios. I also believe that a Ph.D. in Computer Science from Columbia\nUniversity will provide me with the opportunity to conduct in-depth research and collaborate with leading\nexperts in the field, allowing me to further explore my interests and contribute to the development of cutting-\nedge technologies.\nShould I be offered an opportunity to attend Columbia University, you can rest assured that I will take\nadvantage of the academic excellence offered by the institution and its faculty whilst contributing to\nmeaningful dialogue during lectures and workshops. In conclusion, my academic journey so far has been\na culmination of challenges, hard work, and perseverance, which has ultimately led me to my passion for\nprogramming, quantitative finance & algorithmic trading, data science, and now, artificial intelligence and\ncomputer architecture. I am confident that this prospective degree will equip me with the necessary skills\nand knowledge to make significant contributions to the field, and I am eager to take on the challenges and\nopportunities that lie ahead.\nSHREYAS JAIKUMAR\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}