{
  "document_name": "Wang, Shao-Ju (128093427).pdf",
  "total_pages": 5,
  "pages": [
    {
      "page_number": 1,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nShao-Ju Wang\nA 3.66 GPA is not among the bests of your applicants. And yet, I am proud of it when it\ncomes to completing dual degrees in Computer Science and Electrical Engineering plus a minor\nin Computer Engineering within four years of college. My college education aim was to build the\nmost holistic training in different engineering disciplines possible because I believe that better\nproblem-solving skills and ideas come from a combination of knowledge and skills from various\nperspectives. Therefore, I tried to reach this goal with dual degrees with a minor and research\nprojects with professors of different engineering backgrounds. And now, I am ready for my next\naim of focusing and sharpening my knowledge and skills in Automatic Control and Embedded\nSystems.\nWithin automatic control, I am especially interested in AI and robotics that free-up\nmanpower, particularly those requiring less cost to own and operate. At Penn State, I\naccomplished two projects involving computer vision, one in a fruit fly 3D model and the other\nin a metal deposition. These two projects show me the unlimited potential of how computing can\nhelp remove redundancy works and automation's potential. Furthermore, living in a developing\ncountry for six years, I had the opportunity to witness some deplorable living conditions where\nShao-Ju Wang\n10/07/2024 09:54 Personal Statement 1/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nShao-Ju Wang\npeople don't even have access to essential utilities. Those encounters have motivated my quest to\nimprove technologies and devices that are beneficial and affordable to those with limited\nresources. And I believe that my graduate training in automatic control will be the way for me to\nachieve that goal.\nThe second area of specialty that I would like to acquire further is embedded system. To\nachieve the goal of building affordable devices that aid people, I am eager to learn more about\nthe architecture of embedded systems, particularly microcontrollers. At Penn State, I took\ncourses in algorithm frameworks, such as divide and conquer, dynamic programming, and\nmicrocontrollers and MIPS architecture. I aim to tackle the optimization problem with both\nsoftware and hardware approach; achieving more than double effectiveness.\nMy interest in research projects began from my favorite course at Penn State, CMPEN 454,\nIntroduction to Computer Vision. The course combines the physical world, bits, and math\naltogether. After taking the course, I began working with some of the professors at Penn State,\ndeveloping computer vision programs that aid their research. First, I joined Professor Jean\nShao-Ju Wang\n10/07/2024 09:54 Personal Statement 2/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nShao-Ju Wang\nMongeau's Bio-motion Systems Lab of Mechanical Engineering to help them recreate a fruit fly\n3D model with stereo images. Although I did not work on the core computer vision code, I\nhelped optimize the user experience and learned a lot about the techniques and flow. After\ncompleting the project, I assisted Professor Sanjay Joshi from Industrial Engineering in creating\na program that automatically determines the dimension of metal deposition from the cross-\nsectional image. Meanwhile, I am developing a single-lens camera distance detection algorithm\nthat works on the phone with Professor Kyusun Choi in Computer Engineering. This device will\ndetect obstacles in front of a micromobility to prevent traffic accidents. These project\nexperiences in software and low-power hardware have shown me my limitations in these areas,\nthe fun of finding solutions on my own or within a team, and, more importantly, the urge to study\nfurther.\nNot only did projects with the professors in engineering research, but I also helped\nProfessor Yunting Liu from Electrical Engineering in settling and improving her lab session in\nEE 413, Introduction to Power Electronics. I assisted her and her TA in finding and solving the\nmissing or confusing parts of the lab operation. I also made some technical suggestions on the\nShao-Ju Wang\n10/07/2024 09:54 Personal Statement 3/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nShao-Ju Wang\ntypesetting of the lab manual. From this experience, I learned the development process of lab\ndesign and how to conduct the lab.\nI enjoyed the teamwork research with the professors and their team members. And yet, I am\nalso trying to solve some of my questions in engineering on my own. The project on converting\nUSB PD to ATX motherboard connections is my own attempt to solve the complexity of desktop\npower. Conventional ATX power supply takes several cables to supply power to the\nmotherboard, while I am trying to provide the power with a single USB type-c cable. There are\nstill many engineering questions that I wish I could find the answers to and the solutions from\nmy training in your Master's program.\nIn my last year of undergraduate education, I was the treasurer of the IEEE- Eta Kappa Nu\n(HKN) honor society. Aside from managing cash flow, I enjoyed tutoring members and non-\nmembers on electrical and computer-related coursework and assisting them with course\nselections. I was delighted when I could find ways to help these students understand the concepts\nthey tried to learn in class. It was a mutually beneficial experience because I learned to express\nShao-Ju Wang\n10/07/2024 09:54 Personal Statement 4/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Wang, Shao-Ju; DOB: 12/22/2000; ID: 128093427\nShao-Ju Wang\nmyself better and thought more profound about this knowledge or skills. And I hope I will have\nmore of these opportunities in the future.\nAcademic education in CS, EE with a minor in CE exposed me to the spectrum between\nhardware and software. From project and tutoring experiences, I know I want to be a researcher\nand a professor at the university in my career life. Therefore, I am working step by step toward\nthat goal. The CS graduate program at Columbia University has been one of the best in the\nworld. I will be able to learn research skills that will further lead me to the future goal, learning\nfrom and contributing to our world as a professor. My life goal is to develop and improve\ntechnology to improve human life, especially for those with limited resources.\nShao-Ju Wang\n10/07/2024 09:54 Personal Statement 5/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}