{
  "document_name": "Agarwal, Gopal (134186870).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Agarwal, Gopal; DOB: 02/20/1997; ID: 134186870\nIn my opinion, the most important thing anyone can achieve in their life is a sense of purpose. While it\nvaries from person to person, for me, it is clearly relevant in the field of science and technology, more\nspecifically in the field of mechanics; improving the lives of common people through technical\ndevelopment. So I would like to pursue a doctoral degree in engineering mechanics from Columbia\nUniversity. I am currently obtaining a master’s degree in computational engineering at Leibniz Universität\nHannover and I have faith in the quote said by the greatest scientist Albert Einstein:“ Tell me and I forget;\nteach me and I may remember; involve me and I learn.” This quote inspires and motivates me to engage\nin research in the field of mechanics, through which I am able to expand my knowledge and also contribute\nto it.\nI was born and raised in a small town in eastern India. I consider myself fortunate because I was raised in\na culture where knowledge is more valued than money. Thus, pursuing knowledge by achieving a higher\ndegree is very common in our society.\nI have completed my bachelor's from Jadavpur University, one of the most prestigious universities in my\ncountry, majoring in Mechanical Engineering and during this period of my education I have realized that\nknowledge is boundless and whatever you have thrived is never enough; one must continuously learn and\nrefine his or her skill to make a difference someday. Since my second year of bachelor's, I have involved\nmyself in research work, which marks the beginning of my learning. I have started to develop skills that\nare needed in the field of mechanics, through which I was able to publish several research journals during\nmy bachelor's, contributing to the mechanical society.\nYet, after successfully completing my bachelor’s degree, when I was offered a job at Reliance Industries\nLtd. in Jamnagar Complex, the largest refinery in the world and a notable global brand, I was very keen to\njoin. The reason being, the job profile I got is among the best in the industry, as Reliance has a wide range\nof machinery with some advanced technologies and exposure to such an industrial environment provides\nme with a better understanding of the growing technologies and their demand. I was ready to explore the\nopportunity, as I always crave new experiences and challenges.\nEven with my bachelor's degree and first-hand experience in an industry, I never felt like an expert and\nhad the eagerness to learn more. To widen my expertise, I started my master's at Leibniz Universität\nHannover, one of the TU9 of Germany, in the field of computational mechanics. Through my master's\ncourses, I was introduced to several new concepts in the field of mechanics such as advanced FEM\nanalysis, stochastic analysis, uncertainty quantification, model order reduction, ML in mechanics and\nseveral others. Similar to my bachelor's approach, I have started working in parallel with my course work\nas a research student in the IBNM department of the university. Through this opportunity, I have\ndeveloped technical skills to solve coupled equations in FEM, while simultaneously contributing to open\nsource communities on GitHub such as FEnics and RBnics. Soon I was offered a project at Continental\nReifen Deutschland GmbH to develop a framework to produce Hexahedral meshing for their tire tread\npatterns. To add to my achievement, the framework developed can produce hex-mesh automatically,\nthrough which the simulation time and accuracy have significantly increased, which adds to savings in\ncomputational time and cost.\nPhysics and mathematics are the subjects where I have always found my interest, especially the concepts\nof Newtonian mechanics. During my schooling, I extensively studied it out of interest and even\nparticipated in school exhibitions, building some real small machinery stuff, and thus I was a person whom\nmy peers contacted when they needed some discussion or to clear any doubts on this topic.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Agarwal, Gopal; DOB: 02/20/1997; ID: 134186870\nThroughout my life, I have always tried to be in the good books of people, which has eventually helped\nme. Through sheer motivation and not-easily-giving-up skill, professors in my universities have given me\nimmense support and motivation to pursue a doctoral degree in the field of mechanics. Through my\nprofessors, I have been in contact with Prof. Haim Waisman at Columbia University. I have found the work\nof Prof. Waisman team very fascinating, and the work on the topics of material topological advancement\nand phase-field interactions has enthralled me.\nI have always been engulfed in innovative work and have gained good knowledge in the field of mechanics\nthrough my learning and work experiences. I am proficient in several programming languages, such as\nMATLAB, Python, and C++. Likewise, I have developed my coding skills not because of coursework or\ncoding materials but through my involvement in writing codes for the research topics I have been working\non. I am also well-equipped with various simulation and modeling software packages like AutoCAD, ANSYS\nand SolidWorks. Several of my research projects required simulating and modeling tasks, and I have\nbecome quite handy with a lot of software packages and am open to exploring new ones as well. One\nthing I have realized during my work is that these commercial software packages are very costly to use\nand many researchers lack the funds to use them and proceed with their work. So in order to motivate\npeople to contribute more to research, I have always favored the use of open source software like Julia,\nOpenFoam, FEnics, Gmsh and several others. In this way, one significantly decreases the cost involved in\na project, and for the development of these open source software packages, I have contributed to it too\nthrough some tutorials in their GitHub community. It is one of my strongest desires to make these open-\nsource environments capable enough to solve all kinds of complex problems, which will motivate a huge\nresearch group to pursue their work further.\nThis urge for research can be traced back to my childhood. As a curious child, I was a voracious reader of\nscience magazines and always tried to build some small stuff, which pleases me. Reading books has\nsignificantly enhanced my imagination capability, and enacting those knowledge is something I believe is\none of my greatest strengths.\nIn addition to the above, I consider creativity an important aspect of my character. From childhood, I never\nwanted to follow the masses. For me, one of my biggest achievements in life was when, in 12th standard,\nI was the zonal topper in physics out of around 8,000 candidates in the FTRE organized by FIITJEE and also\nwhen I, along with one of my academic professor, published my first research paper. I was even selected\nfor the INAE scholarship for my summer internship, which chooses only 50 students throughout the\ncountry. The joy felt after having the first positive results from the work was immense. But I found similar\nsatisfaction and pride when I made my first piece of music with lyrics, or wrote my first poem for my\nschool magazine.\nMaintaining my eagerness to learn and explore the field of mechanics while strengthening my skills and\nexpertise, I want to pursue a doctoral degree in this field. Columbia University, part of the Ivy League, has\nan extravagant reputation as a university throughout the world. Pursuing my doctoral degree at this\nuniversity will have a very great impact on my career and work. The research at this university from the\nengineering mechanics department has fascinated me and I am eager to join the department to learn\nfrom them and work with them. Through my several meetings with Prof. Waisman in engineering\nmechanics, I have been allured by the work of his team. I want to join Prof. Waisman team and work on\nhis project topics related to XFEM and material topology. Under his leadership and guidance, I can learn\nand see myself grow, expanding my expertise and contributing to the field of computational mechanics.\nPostgraduation from Columbia University will boost my profile and knowledge exponentially and it will\nhelp me grasp greater opportunities in the near future.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}