{
  "document_name": "Qin, Yifan (134745944).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Qin, Yifan; DOB: 06/12/2000; ID: 134745944\nYifan Qin\nOriginating from my hometown, Shanxi, a region renowned for its abundant coal mines, I am\nacutely aware of the environmental challenges accompanying such prosperity. The significant coal\nmining activities and subsequent coal combustion in the area have precipitated severe\nenvironmental issues. I vividly recall days when the air pollution index soared off the chart and\nwitnessed friends grappling with pneumonia. Back then, I learned that Chemical Engineering plays\na pivotal role in addressing such pressing issues, and this realization fueled my initial passion for\nthe major. This fervor was further fueled when recent wildfires in Canada painted the skies orange\nand filled the air with pungent odors, invoking memories of my childhood. The juxtaposition of\nthose recollections against the present reality solidified my unwavering commitment to dedicating\nmy career to chemical engineering. My academic journey, from undergraduate studies to master's\nresearch experiences, has been firmly rooted in these concerns, propelling me toward the next step\nin my academic pursuit. To this end, I am deeply motivated to apply for the Ph.D. program in\nChemical Engineering at Columbia University, where I aspire to continue my research under the\nguidance of Prof. Kumar, with a focus on developing commercially viable nanoparticle-based\nmembranes in the air purification sector that boast outstanding performance and are economically\npractical.\nWith curiosity and desire to address the problems that concerned me, I deemed that exploring the\nintrinsic properties of substances themselves was essential. This led me to pursue a chemistry\nmajor in my undergraduate studies. This intellectual curiosity pushed me to a point where I was in\nthe top 10% of students at Shanghai Jiao Tong University, I had the privilege of being admitted to\nthe Zhiyuan Honors Program. This program's rigorous emphasis on foundational sciences provided\nme with a robust mathematical and scientific foundation. Concurrently, I delved into organic\nchemistry, physical chemistry, and polymer chemistry, immersing myself in these domains.\nBeyond the realm of academic study, I was determined to gain experience as a researcher in\nlaboratories as early as possible. Consequently, toward the conclusion of my freshman year, I had\n1\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Qin, Yifan; DOB: 06/12/2000; ID: 134745944\nYifan Qin\nthe privilege of joining the SJTU Qiu Group, specializing in Precision Hierarchical Self-Assembly.\nAfter undergoing over 100 hours of training in research methodologies and experimental\ntechniques, I embarked on my journey in polymer science research under the esteemed guidance\nof Prof. Huibin Qiu. In my first literature review research titled \"A Self-Assembly Pathway to Soft-\nmatter Toroidal Nanostructures,\" I provided an overview of toroidal nanostructure preparation,\nwith a particular focus on the evolving self-assembly routes of soft materials. This hands-on\ninvolvement in polymer science, coupled with my profound interest in refining materials and\nintegrating superior alternatives into industrial production, solidified my commitment to research\nin polymer nanocomposites and nurtured my aspiration to cultivate skills capable of translating\ninnovative concepts into substantive research projects.\nExpanding my research horizons, I applied to the Zhiyuan Scholars Research Program. As the team\nleader, I independently formulated and presented the project proposal. Standing out among 50\nresearch groups, we secured a project grant of 75,000 RMB for two years. Our objective was to\npioneer nano-horticulture using poly(lactide) (PLLA) containing micellar brushes, leveraging the\nbiocompatibility of PLLA for applications in biomedical domains such as antibacterial measures\nand cellular screening. Throughout this intricate journey, I significantly honed my practical skills.\nI employed an array of characterization tools, ranging from NMR, MALDI-TOF-MS, and GPC\nfor determining the optimal polymerization degree of PLLA, to utilizing TEM and SEM for\nvisualizing micelle morphology, whether in solution or on material surfaces. Furthermore, the\nproject cultivated my inventive spirit, compelling me to design a myriad of experiments to unravel\nthe assembly dynamics of block copolymers in solution.\nMy studies and research provided me with a solid chemistry foundational theory and practical\nskills for crafting high-performance polymer materials. Yet, a gap exists between laboratory studies\nand industrial use. This spurred my pursuit of Chemical Engineering at Columbia University for a\nmaster's, enhancing engineering theories and computational chemistry for predicting material\n2\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Qin, Yifan; DOB: 06/12/2000; ID: 134745944\nYifan Qin\nproperties. Simultaneously, my dedication to addressing air purification and my profound interest\nin polymer nanocomposites and gas transport drove me to seek further advancement in my research\npursuits. I became a part of Prof. Sanat K. Kumar's lab, investigating the impact of\npolyoligoanilines inclusion in poly (methyl acrylate) (PMA) containing graft nanoparticles (GNPs).\nRheological measurements using small amplitude oscillatory shear (SAOS) were performed on the\nsystem. It was determined that modifying polyoligoanilines placement within GNPs indicated a\nhuge impact on mechanical properties. My ongoing research primarily centers around the thorough\nexploration of the mechanical and gas transport characteristics of GNPs while incorporating\nvarying proportions of free chains. Our objective rests upon the determination of the activation\nenergy governing diverse gas permeabilities within discrete GNP membranes. This multifaceted\nendeavor combines meticulous experimentation with insightful analysis, aiming to uncover the\nintricate mechanisms through which free chains exert their influence on the gas permeability of\nGNP membranes.\nDuring my tenure in Prof. Kumar's laboratory, I not only acquired an extensive repertoire of\ncharacterization techniques for diverse properties of polymer films but also developed a keen\nability to comprehend the inner workings of instruments in an engineering capacity. This journey\nencompassed grasping the design principles underpinning instruments such as gas permeation cells,\nand progressing toward the conceptualization and construction of setups for characterization. This\nlearning extended beyond mere material characterization methods, delving into the realm of\nprocess engineering. This dimension of growth significantly appeals to me, marking a pivotal\nhighlight in my academic journey.\nMy continuous learning journey has led me to recognize the substantial potential of polymer\nnanocomposite membranes in applications concerning air purification and gas separation. Fueled\nby this realization, my aspirations drive me to pursue further research endeavors. Consequently,\nI'm enthusiastic about seeking admission to the Ph.D. program in Chemical Engineering at\n3\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Qin, Yifan; DOB: 06/12/2000; ID: 134745944\nYifan Qin\nColumbia University. My goal is to further investigate gas transport phenomena under the adept\nguidance of Prof. Kumar. Should I be granted the privilege of embarking on a Ph.D. journey, my\nforthcoming research will pivot toward the understanding of gas transport mechanisms. One of the\navenues is to do high-pressure conditioning of membranes crafted from GNPs. This pursuit\ninvolves probing the mechanisms through which increased pressure heightens gas permeability\nand scrutinizing the enduring impact of this treatment.\nIn closing, I wish to express my heartfelt appreciation for your meticulous consideration. This\npromises to be an enthralling and profoundly significant pursuit, one that I eagerly anticipate\nundertaking.\n4\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}