{
  "document_name": "Wu, Benjamin (134884402).pdf",
  "total_pages": 6,
  "pages": [
    {
      "page_number": 1,
      "content": "Wu, Benjamin; DOB: 05/16/2000; ID: 134884402\nBenjamin Wu\nPersonal Statement\nGod created our brains to be beautiful and complex, capable of understanding His own creation\nand the beginning of comprehending His glory. The brain fascinates me beyond any other area of science\nbecause as we study it, we inherently discover more about ourselves and the process of learning itself.\nAs the field of computational neuroscience accelerates, I want to become an authority on neuroscience\nresearch so I can interface with an expanding network of similar minds who desire to understand how the\nbrain works – in doing so, I want to transform my own mind and lift my own limitations when it comes to\nlearning. From my time at Columbia, engaging with the Zuckerman Institute, and taking coursework under\nProfessor Lazar, as well as my time working as an Air Force Research Lab Scholar, I am convinced that a\ncareer in this field will be intellectually exciting and transformative in how I think about the world. My goal\nin completing a Ph.D. is to develop a rigorous way of thinking and obtain the professional credentials that\nwill enable me to understand, internalize, and build upon neuroscience literature and any other field of\ninquiry.\nAt the beginning of my undergraduate studies, I set my eyes on the field of neuroscience but\nfound that the neurobiology track was outdated – so I made my own. I entered the field of computational\nneuroscience through the study of computational science. As an undergraduate, I wedged my foot in the\ndoor of an HPC laboratory working on parallelizing jobs for computing clusters and then in the door of a\nquantum computing laboratory, where I wrote my first preprint on using quantum random walks to solve a\nclass of sparse linear systems of equations. With my experience, I applied for a position at AFRL working\nin my current laboratory – my initial project in the summer of 2021 was using CNNs to track the motion of\nflying insects in high-quality video recordings. As I became more interested in the field and in making\nresearch my career, I began looking into graduate programs and discovered the remote Fly Circuits\nJournal Club at Columbia. I entered the master’s program, and in the summer of 2022, I returned to AFRL\nto work on programming a neural network on a custom neuromorphic multi-color optoelectronic synapse\nsensor, resulting in my first cross-institutional collaboration and peer-reviewed publication.\nAs I entered the master’s program last fall, I undertook coursework with Aurel Lazar and enrolled\nin the theoretical neuroscience course at the Zuckerman Institute. Simultaneously, my boss invited me to\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Wu, Benjamin; DOB: 05/16/2000; ID: 134884402\nBenjamin Wu\npropose my own project for my work with AFRL. I began to learn the visualization and execution tools of\nthe Bionet Lab and interface with researchers at ZI to draft a project involving the computational modeling\nof the Drosophila visuomotor decision-making process for long versus short escape takeoff responses.\nAfter the project was approved, I began planning for the summer 2023 term. Throughout the spring, as I\nconducted the literature review, I took ECBM6070 under Professor Lazar, where I learned about the\nbeautiful and intelligent alignment of the fruit fly retinal columns. Here, I knew that neuroscience was the\nright field for me. However, a hurdle presented itself in my project planning in that the simulation tools of\nthe Bionet lab were limited and highly convoluted even for the medulla 7 columns simulation, let alone the\ndownstream neurons. At the right time, as part of my advanced theory course at the Zuckerman Institute,\nI discovered work by Srini Turaga at Janelia that introduced the Deep Mechanistic Network, which is just\nwhat I needed. With the pieces in place, this summer, I led a small team of AFRL Scholars to carry out my\nproject plan, leading to a successful department presentation, poster presentation, and technical\nengineering memorandum. This fall, I have continued fleshing out the project independently and have\nextended the model to account for multi-colored visual input. Throughout this process, I have solidified my\ndesire to work in the research industry, and my purpose for pursuing the Ph.D. has further clarified: to\ngain the license necessary to autonomously manage my projects in the future instead of just working\nunder others’ shifting timelines and funding.\nIn the long term, I aim to become a leader in neuroscience research at the intersection of\nacademia, industry, and defense. Within the engineering department at Columbia, I am excited by the\nprospect of applying what I have learned working with the Deep Mechanistic Network model to expand\nthe simulation capabilities of the Bionet Lab tool infrastructure to recently added datasets such as the\nventral nerve cord and optic lobe. At Columbia, more broadly, I am excited by the prospect of\ncollaborating with researchers in the Zuckerman Institute whom I have previously conversed with during\nmy coursework – particularly those doing connectomic research with the fruit fly. From my discussion with\nleaders in the field, there is a need for high-quality recording data processing pipelines for pose-tracking,\nand the engineering department at Columbia is well-positioned to fulfill this need. I am excited to be a\nliaison between professors within these two departments and employ my computational research\nexperience to further the field of neuroscience.\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Wu, Benjamin; DOB: 05/16/2000; ID: 134884402\nBenjamin Wu\nThere have already been many times when I have had doors closed in my face. As I finished my\nfinal year of undergraduate and applied for the master’s at Columbia, I attended the Fly Circuits Journal\nClub at Columbia hosted by now assistant professor Gabrielle Gutierrez – but when I entered the\nprogram, the journal club shut down. As I worked with the AFRL on optoelectronic synapses and gained\nthe opportunity to draft my own project description, I took it one step further and fleshed it out for an\nNDSEG fellowship application. However, after passing the initial rounds of subject-matter expert reviews,\nit was rejected in April by the DoD panelists. This fall, hoping to get a head-start on Ph.D. preparations, I\nasked about the possibility of a funded position but found out that AFOSR funding had fallen through.\nAfter completing my fall research commitment with the AFRL and applying for next spring and summer to\nfinish this project, I have one last chance to knock on the door to fulfill this Ph.D. dream – but I am also\nnot putting all my hope in it, as I apply for full-time defense research positions. Thank you for taking the\ntime to consider my application.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Wu, Benjamin; DOB: 05/16/2000; ID: 134884402\nBenjamin Wu\nPersonal Statement\nGod created our brains to be beautiful and complex, capable of understanding His own creation\nand the beginning of comprehending His glory. The brain fascinates me beyond any other area of science\nbecause as we study it, we inherently discover more about ourselves and the process of learning itself. As\nthe field of computational neuroscience accelerates, I want to become an authority on neuroscience\nresearch so I can interface with an expanding network of similar minds who desire to understand how the\nbrain works – in doing so, I want to transform my own mind and lift my own limitations when it comes to\nlearning. From my time at Columbia, engaging with the Zuckerman Institute and taking coursework under\nProfessor Lazar, as well as my time working as an Air Force Research Lab Scholar, I am convinced that a\ncareer in this field will be intellectually exciting and also transformative in how I think about the world. My\ngoal in completing a PhD is to develop a rigorous way of thinking and obtain the professional credentials\nthat will enable me to understand, internalize, and build upon neuroscience literature and any other field\nof inquiry.\nAt the beginning of my undergraduate studies, I set my eyes on the field of neuroscience but\nfound that the neurobiology track was outdated – so I made my own. I entered the field of computational\nneuroscience through the study of computational science. As an undergraduate, I wedged my foot in the\ndoor of an HPC laboratory working on parallelizing jobs for computing clusters and then in the door of a\nquantum computing laboratory, where I wrote my first preprint on using quantum random walks to solve a\nclass of sparse linear systems of equations. With my experience, I applied to a position at AFRL working\nin my current laboratory – my initial project in summer of 2021 was using CNNs to track motion of flying\ninsects in high-quality video recordings. As I became more interested in the field and in making research\nmy career, I began looking into graduate programs, and discovered the remote Fly Circuits Journal Club\nat Columbia. I entered the master’s program, and in the summer of 2022, I returned to AFRL to work on\nprogramming a neural network on a custom neuromorphic multi-color optoelectronic synapse sensor,\nresulting in my first cross-institutional collaboration and peer-reviewed publication.\nAs I entered the master’s program last fall, I undertook coursework with Aurel Lazar and enrolled\nin the theoretical neuroscience course at the Zuckerman Institute. Simultaneously, my boss invited me to\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Wu, Benjamin; DOB: 05/16/2000; ID: 134884402\nBenjamin Wu\npropose my own project for my work with AFRL. I began to learn the visualization and execution tools of\nthe Bionet Lab and interface with researchers at ZI to draft a project involving the computational modeling\nof the Drosophila visuomotor decision-making process for long versus short escape takeoff responses.\nAfter the project was approved, I began planning for the summer 2023 term. Throughout the spring, as I\nconducted the literature review, I took ECBM6070 under Professor Lazar, where I learned about the\nbeautiful and intelligent alignment of the fruit fly retinal columns. Here, I knew that neuroscience was the\nright field for me. However, a hurdle presented itself in my project planning in that the simulation tools of\nthe Bionet lab were limited and highly convoluted even for the medulla seven columns simulation, let\nalone the downstream neurons. At the right time, as part of my advanced theory course at the Zuckerman\nInstitute, I discovered work by Srini Turaga at Janelia that introduced the Deep Mechanistic Network,\nwhich is just what I needed. With the pieces in place, this summer, I led a small team of AFRL Scholars to\ncarry out my project plan, leading to a successful department presentation, poster presentation, and\ntechnical engineering memorandum. This fall, I have continued fleshing out the project independently and\nhave extended the model to account for multi-colored visual input. Throughout this process, I have\nsolidified my desire to work in the research industry, and my purpose for pursuing the PhD has further\nclarified: to gain the license necessary to autonomously manage my projects in the future insted of just\nworking under others’ shifting timelines and funding.\nIn the long term, I aim to become a leader of neuroscience research at the intersection of\nacademia, industry, and defense. Within the engineering department at Columbia, I am excited by the\nprospect of applying what I have learned working with Deep Mechanistic Network model to expand the\nsimulation capabilities of the Bionet Lab tool infrastructure to recently added datasets such as the ventral\nnerve cord and optic lobe. At Columbia, more broadly, I am excited by the prospect of collaborating with\nresearchers in the Zuckerman institute whom I have previously conversed with during my coursework –\nparticularly those doing connectomic research with the fruit fly. From my discussion with leaders in the\nfield, there is a need for high-quality recording data processing pipelines for the purposes of pose-\ntracking, and the engineering department at Columbia is well positioned to fulfill this need. I am excited to\nbe a liaison between professors within these two departments and employ my computational research\nexperience to further the field of neuroscience.\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 6,
      "content": "Wu, Benjamin; DOB: 05/16/2000; ID: 134884402\nBenjamin Wu\nThere have already been many times where I have had doors closed in my face. As I finished my\nfinal year of undergraduate and applied for the master’s at Columbia, I attended the Fly Circuits Journal\nClub at Columbia hosted by now assistant professor Gabrielle Gutierrez – but when I entered the\nprogram, the journal club shut down. As I worked with the AFRL on optoelectronic synapses and gained\nthe opportunity to draft my own project description, I took it one step further and fleshed it out for an\nNDSEG fellowship application. However, after passing the initial rounds of subject-matter expert reviews,\nit was rejected in April by the DoD panelists. This fall, hoping to get a head-start on PhD preparations, I\nasked about the possibility of a funded position, but found out that AFOSR funding had fallen through.\nAfter completing my fall research commitment with the AFRL and applying for next spring and summer to\nfinish this project, I have one last chance to knock on the door to fulfill this PhD dream – but I am also not\nputting all my hope in it, as I apply for full-time defense research positions. Thank you for taking the time\nto consider my application.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}