{
  "document_name": "Li, YiRan (159558714).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nVanessa YiRan Li\nI fondly remember my efforts to recreate the lung-on-a-chip platform in the open\nhallways of my high school. The day prior, I had scraped the surface of pig lungs bought from\nthe wet market and seeded them into growth media I had read about in literature. To my\ndisappointment, the cell media had turned yellow from overheating and was swarmed with\nbacteria. Though disheartened at the time, I cherish these moments of “failure” as I conduct\nexperiments in the laboratory today. The opportunity to ask questions, to fail, and to grow as well\nas to occasionally find something life-changing captivates me. I am not only enthralled to\ndiscover more but also determined to utilize these steps of scientific inquiry as my toolbox to\nadvance healthcare. As such, I am determined to pursue a Ph.D. in Biomedical Engineering at\nColumbia University to become a research scientist — with the goal of driving sustainable\nchange in the world around me.\nAs a first-year undergraduate student, I jumped at the opportunity to join the Weiss Lab at\nthe Massachusetts Institute of Technology where I worked alongside a team of aspiring scientists\nto form cell swarms and properly learned to culture mammalian cells. Specifically, I genetically\nengineered human embryonic cells to release chemokine and characterized the movement of\nneutrophils toward these cells using transwell assays and fluorescent microscopy. I then moved\nfrom genetics to organs, working in the Zhang lab at Harvard Medical School to fabricate\nglomerulus-on-a-chip platforms with light-activated hydrogels and 3D bioprinters. The ability to\nengineer different pieces of the human body fascinates me as it redefines our definition of\nbiology. It transforms today’s medicine, which is based on drugs, into personalized cell-based\ntherapies developed using the building blocks of the human body. As such, I want to be a part of\nthis extraordinary shift in biomedicine to tackle urgent health challenges in the 21st century.\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nVanessa YiRan Li\nAmidst the crisis of COVID and the sudden pause to my research at the Zhang Lab, I was\ngiven the opportunity to spend more time with my extended family in Japan, specifically my\nuncle. I watched him struggle physically and financially with unexpected episodes of heart\nattacks. As such, I started reading into heart diseases and clinical trials to become better informed\non the procedures and treatments he endured. As I delved deeper into literature, my interest in the\nheart grew more and more not only because of its significance as a modulator of the entire\nhuman body but also its symbolism as a bridge that connects people. My interest led to an\nopportunity at the Yoshida Lab at Kyoto University’s Center for iPS Research and Application\nwhere I engineered heart organoids to study the effect of MAPK inhibitors and\nimmunosuppressants on cardiac fibrosis. In the process, I was able to build upon skills I have\npreviously used as well as learn new techniques, such as immunostaining and polymerase chain\nreaction, that I have come to use in my day-to-day life as a research assistant today.\nWhen I joined Columbia in 2022, I continued my exploration of the heart and its diseases\nat Professor Vunjak-Novakovic’s Laboratory For Stem Cells and Tissue Engineering. During my\nfirst two semesters, I conducted mitochondrial assays and analyzed surface proteins to contribute\nto an existing project exploring myocardial injury in systemic lupus erythematosus patients.\nThrough this study, I was able to gain experience differentiating iPSC cells into cardiomyocytes\nand constructing bioreactors using PDMS, which I then combined to form 3D engineered cardiac\ntissues. Currently, I am pursuing my independent project embedding gold nanorods into\nengineered cardiac tissues with the hopes of stimulating electrical maturation in a way that more\nclosely resembles the human myocardium. Through these studies, I have grown tremendously as\na scientist with the incredible mentorship I have received and have learned to find joy in not only\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nVanessa YiRan Li\nthe successful experiments but also the failures in between. Furthermore, I sincerely appreciate\nthe sense of community in the lab from eating Serbian food in the East Village, building\nChristmas trees out of lab gloves, to summer picnics at Central Park. Being a part of this team\nhas reaffirmed my interest in scientific research and most of all, the strong presence of female\nleadership has inspired me to set ambitious goals for myself.\nAs a Ph.D. student, I intend to continue the research I have started and to make use of the\nskillset I have garnered to ask deeper scientific questions. Under the guidance of Professor\nVunjak-Novakovic and Professor Cheng, I plan on studying the role of exosomes in\ncardioprotection using heart-on-a-chip platforms. I am curious about the pathogenic function of\nexosomes released upon diseases and injury, like ischemia-reperfusion injury, and their\ntrafficking between different cell types within the heart. Furthermore, how do factors such as\nage, sex, and race affect EV content? Can exosomes be used for personalized diagnostic markers\nand therapeutic approaches in cardiovascular diseases? The emerging role of exosomes has the\npotential to unveil unknown mechanisms and new therapies and is currently being explored in\nProfessor Cheng’s lab. Professor Vunjak-Novakovic’s lab offers a heart-on-a-chip platform to\nmodel and study cardiovascular diseases in vitro. As such, this collaborative effort combines the\nstrength of both labs to explore unventured avenues in biomedicine and I am honored to be able\nto be a part of and take the lead on this project.\nIn parallel to my research interests, I have always been passionate about the intersection\nof medicine, sociology, and advocacy. My upbringing in China, Japan, and the United States\ninformed me of the immense privilege of having a voice in who I want to be knowing that this is\nnot a global norm. As such, I seek for opportunities to advocate for equity in and out of the\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Li, YiRan; DOB: 03/28/2000; ID: 159558714\nVanessa YiRan Li\nlaboratory. At Columbia, this has manifested in the form of being a student advocate as an\nambassador for the BME department and the inter-school chair of the Engineering Graduate\nStudent Council. I have organized events to foster interdisciplinary conversations on next-\ngeneration issues and offered support to students, especially those who are underrepresented in\nhigher education, to find their place at Columbia Engineering. As a Ph.D. student, I hope to\ncontinue my advocacy efforts for the student body by stepping into leadership positions and\ntaking an active role in community events. I intend to make a positive impact through both my\nlab work and community engagement efforts, working towards the goal of becoming a research\nscientist who will make a difference.\nUpon completing my Ph.D., I plan on engaging in a career in research to redefine what is\npossible in cardiovascular care and to advocate for equity in healthcare. I can envision myself\ndeveloping personalized tissue models that reflect sex differences in diseases or fighting for the\nsafe use of new biotechnology such as stem cell therapy. Along the way, I intend to use my\ncompassion, curiosity, and leadership skills to make a real impact on the world. At Columbia, I\nam excited to be in a space that curates the perfect environment for me to thrive, and am even\nmore elated to have found my community within this space. As I continue to pursue research, I\nwish to encounter more moments of growth from using brightfield microscopy to find lung cells\nto operating high throughput imagers to characterize cardiac tissues. I look forward to\nencountering more moments of “failures” I can look back and laugh at in the future as I bring\nscientific research closer to the world.\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}