{
  "document_name": "Liu, Yi-Chen (198186667).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Liu, Yi-Chen; DOB: 01/27/1997; ID: 198186667\nEthan Yi-Chen Liu\nPh.D. in Electrical Engineering\nStatement of Purpose\nThe seed of fervent passion and insatiable curiosity, destined to unveil how beautiful things could\nbe through various engineering processes, was gently sown in the fertile soil of my childhood. After\nenjoying the colorful popsicles and blossoms of coolness on our taste buds, I spent several hours\ncontemplating, “Where does the color come from?” This curiosity guided me into the realm of\nengineering, unveiling the intricate science underlying these captivating shades. This revelation ignited\nan ardent ambition within me – to channel the potential of evolutionary technology and processes\ntowards infusing life with vibrancy and render humanity itself 'colorful' through innovation and\nprogress. This journey reinforced the essence of immersive research training and a sturdy knowledge\nfoundation. In consequence, studying in Columbia’s Ph.D. program in Electrical Engineering, in which\ncountless research resources are accessible, along with brilliant researchers and extraordinary faculty,\nassuredly holds immense significance in fulfilling my dream.\nEmbarking on this odyssey necessitates an enduring spirit of perseverance and relentless\nconsistency — qualities ingrained in my spirit. Despite not ranking first in my class, my unyielding\nand unwavering dedication defined my journey. This ethos bore fruit when graduate study invitations\npoured in from all the top five universities in my country. Similarly, my journey at Columbia University\nwas riddled with initial academic challenges. The transformation, however, was profound. From\n'striving harder' to 'striving smarter.’ Undeterred, the outcome was remarkable—a perfect 4.0/4.0\nacademic performance that bears witness to my growth and adaptability. These experiences underscore\nmy readiness for a Ph.D.\nIn addition to curriculum studying, I also took the initiative to join research groups at National\nTsing Hua University to enhance my critical thinking and problem-solving capacity. I undertook the\nproject of the Volatile Organic Compounds (VOCs) ozonation in a Rotating Packed Bed (RPB) to\ntackle wastes from the semiconductor factory through mathematics models. During this project, we\nbuilt the model for analyzing ozone absorption and oxidation efficiency, as well as established the\nempirical correlations that are highly applicable in an industrial setting. Through optimization, our\nexploration revealed the effect of the usage of the acid catalyst plays a pivotal role in oxidation\nsimulation, leading to a remarkable reduction of deviations from 97.5% and 57% to an impressive\n7.3% for o-cresol and 11.5% for phenol. Following our research, I presented an oral presentation at\nthe key conference (PSE Asia 2022) and was awarded a fellowship from the Ministry of Science and\nTechnology of Taiwan. As recognition, my expertise in RPB also caught the attention of the Chemical\nEngineering department at the University of Notre Dame, leading to a collaborative investigation into\nthe effect of MEA, DETA, and piperazine on CO2 capture using RPB, an opportunity I secured amidst\nstiff competition. The result of our publication at the international conference (ICSREE 2021) and\nthese experiences drove me to delve in-depth into the field.\nAs of this writing, I am working as a research assistant at Columbia University, aiming to optimize\nthe Excimer Laser Annealing (ELA) conditions for Indium-Gallium-Zinc-Oxide (IGZO) thin film\ntransistors, via sponsorship of Samsung Display Company. To date, the ELA heat treatment on\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Liu, Yi-Chen; DOB: 01/27/1997; ID: 198186667\nEthan Yi-Chen Liu\nPh.D. in Electrical Engineering\nTransparent Amorphous Oxide Semiconductor (TAOS) offers the potential to ameliorate the transistor\nperformance and revolutionize the field of display technology. Exploring the complex interplay\nbetween oxygen vacancies, IGZO’s structural properties, and their impact on device characteristics, I\nhave honed my skills in device microfabrication, mastering techniques like Thermal Evaporation\nDeposition, Plasma-Enhanced Chemical Vapor Deposition, Lithography, and Wet/Dry etching.\nFurthermore, I’ve become proficient in essential metrology equipment, including Atomic Force\nMicroscopy, Transmission Electron Microscopy, X-ray Photoelectron Spectroscopy, X-ray\nDiffraction, Profilometry, and Probe station. Those hands-on experience has equipped me to integrate\nseamlessly into various research environments and dedicate myself to innovative project. ability and\nhelped me get ready to be able to fit in quickly and make valued contributions to any ongoing research.\nWith profound gratitude for my journey so far, I yearn to anticipate new challenges and discoveries in\nthe next phase of my academic adventure.\nAs I've advanced in my academic pursuits, I’ve sought chances to make a positive impact and\nshare the knowledge I’ve gained. By serving as a teaching assistant for the Process Control and Unit\nOperation Laboratory, I was able to assist fellow students both theoretically and experimentally.\nAdditionally, as the captain of the basketball team in our department, I’ve held and led a national sports\nevent that brought students from chemical engineering departments all around the country, which not\nonly strengthened my leadership ability but highlighted my passion for fostering camaraderie among\npeers. Looking to branch out further, I served as the secretary of the Taiwanese Grad Student\nAssociation, in which we organize events and provide support to all the students from Taiwan at\nColumbia University. This role enabled me to connect with diverse groups of people, which deepened\nmy commitment to helping others and contributing to the well-being of my fellow students.\nIn the near future, I eagerly look forward to embarking on innovative research projects,\nparticularly the semiconductor science. Leveraging the advanced equipment and resources at the\nColumbia Nano Initiative (CNI) to push the boundaries of this field makes it an ideal place for\ngroundbreaking accomplishments. I hope to work with Prof. Savannah Eisner to delve into advancing\nthe Gallium Nitride High-Electron-Mobility-Transistor (GaN HEMTs) as a robust candidate for\nmixed-signal electronics in extreme conditions, making them indispensable for various critical\napplications. Both in-situ transistor electrical characterization and advanced microscopy analysis\ntoward stress conditions on epitaxial and device structure can demonstrate an outstanding performance\nof Enhancement-mode GaN transistors. After graduation, my vision extends beyond personal success.\nI aspire to embark on a career path that transcends boundaries, where I can be instrumental in shaping\nunconventional chip manufacturing processes in the semiconductor industry. I hope to eventually be\ncommitted to not only giving back to my alma mater through the donation of facilities and scholarships\nbut inspiring future generations and establishing myself as an influential alumnus as well.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}