{
  "document_name": "O'Connell, Samantha (206710962).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "O'Connell, Samantha; DOB: 12/27/1999; ID: 206710962\nSamantha O’Connell\nMy interest in this program leads to my post-graduation and career goals. I want to further my education\nin computer science and learn more about STEM in order to become a successful software developer or\nrelated career. I want to develop my skills, learn from my peers and professors, and further my knowledge\nto become the CEO of my own company someday. I know the best way to start my journey is through\neducation. I was lucky to enter colleges and universities that offered me unique opportunities. Such as\nNew York University, which allowed me to develop soft and career-focused skills. In addition to learning\nabout information technology, cybersecurity, project management, and networking. Columbia University\ncould provide me with research, internship, and job opportunities that I may otherwise not be able to\nhave. But more importantly, a valuable education.\nI always wanted to be a scientist. The older I became, the more insight I slowly gained into a career I\nwanted. I started off with interactive earth science as a kid and made my way to game design in high\nschool. I changed my major in the Borough of Manhattan Community College due to an obstacle I could\nnot avoid. However, this only made my passion for STEM and art stronger. More recently, I am finishing\nmy degree at New York University School of Professional Studies. I took advantage of any and all\nresources I could find for myself–sending anything I could not use to other students who needed it. I\nbelieve my journey has led me to Columbia University. I am hopeful that I can get the Master’s/Ph.D.\ntrack and develop my skills to continue to help myself, as well as others. I did not see the option on the\napplication but spoke with a recruiter who said the track was possible for me. In addition to a fee waiver\nfor attending the session. Overall, I am excited about this opportunity--I can learn more STEM, help more\npeople, and continue my academic journey.\nI am open to other career paths and opportunities. I am someone who enjoys a multitude of genres and\nmaking friends or connections. I want to start my career journey within a technical industry, build my way\nto becoming a professor, and end my career as the CEO of a company that made a positive difference in\nsociety. I hope to and believe I will gain further knowledge in software development, back-end\ndevelopment, and STEM. I would say that despite my disabilities--I always try my best in all I do. I take\nrisks like this personal statement/ by applying to Columbia. I always try to improve the world around me.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "O'Connell, Samantha; DOB: 12/27/1999; ID: 206710962\nSamantha O’Connell\nThough, I worry about my ability to pay for my tuition as a low-income student. If given the opportunity, I\nwould love to work or participate in any internship, fellowship, or program that could cover my tuition.\nI look forward to hearing from you. Thank you for your time and consideration.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}