{
  "document_name": "Safari, Fatemeh (223323625).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Safari, Fatemeh; DOB: 09/10/1992; ID: 223323625\nFatemeh Safari\nEmail: fsafari92@gmail.com\nPhone: (906) 231-4279\nAs I embark on the path to doctoral studies, I am drawn to the dynamic research environments led by\nProfessors Juchem and Hillman at Columbia University. The innovative work at the intersection of\nengineering and healthcare in both Labs resonates deeply with my academic trajectory and aspirations.\nMy role as a Research Associate at NYU Grossman School of Medicine equipped me with valuable\ninsights into the convergence of engineering principles with medical applications. Notably, my\ninvolvement in the development of a Microwave Medical Imaging Prototype for Stroke Classification and\nLocalization heightened my appreciation for the transformative potential of engineering in healthcare.\nThis experience has fortified my resolve to contribute meaningfully to advancing medical technologies.\nUpon reviewing the MR Science Lab’s emphasis on magnetic resonance imaging (MRI) and spectroscopy,\nI am excited by the prospect of contributing to projects that push the boundaries of MRI technology. My\nproficiency in electromagnetic field simulations positions me well to enhance hardware solutions for\nhealthcare applications. Additionally, my experience in PCB design and 3D printing aligns seamlessly\nwith the lab's commitment to innovation in healthcare technology.\nThe groundbreaking work at the Laboratory for Functional Optical Imaging, focusing on in vivo imaging\nand microscopy techniques, is equally compelling. My strong foundation in electromagnetics,\nspectroscopy, and quantum mechanics from my undergraduate studies in physics will be invaluable in\ndelving into advanced optical imaging methodologies. This background lays a solid foundation for\ncontributing to projects exploring neural dynamics and functional imaging.\nUpon completion of my doctoral studies, I aspire to merge my expertise in electromagnetic field\nsimulations, MRI technology, and optical imaging methodologies. My goal is to pioneer advancements in\nimaging technologies that have a direct impact on clinical diagnostics and interventions. By bridging the\ngap between engineering innovation and healthcare outcomes, I aim to contribute to a new era of\nprecision medicine.\nI am drawn to Columbia Engineering not only for its academic excellence but also for the vibrant\nresearch community that fosters collaboration and innovation. The opportunity to engage with\ndistinguished faculty members, including Professors Juchem and Hillman, and work alongside fellow\nscholars who share a passion for engineering in healthcare is an unparalleled opportunity for my\nacademic and professional growth.\nThe Juchem Lab's and Hillman Lab's pioneering work in developing advanced imaging methodologies,\nincluding MRI and optical techniques, is a testament to their commitment to pushing the boundaries of\nmedical imaging. I am particularly excited about the potential to contribute to research projects that\nhave a direct impact on patient care and to be part of a community dedicated to advancing healthcare\ntechnologies.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Safari, Fatemeh; DOB: 09/10/1992; ID: 223323625\nIn conclusion, I am enthusiastic about the prospect of joining the Juchem Lab and the Hillman Lab, along\nwith the Department of Biomedical Engineering at Columbia University. With an unwavering\ncommitment to excellence and a passion for engineering solutions in healthcare, I am eager to embark\non this transformative academic journey.\nThank you for considering my application.\nSincerely,\nFatemeh Safari\nEmail: fsafari92@gmail.com\nPhone: (906) 231-4279\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}