{
  "document_name": "Tang, Zifeng (282670368).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Tang, Zifeng; DOB: 01/17/2000; ID: 282670368\nI’ve got a good taste of the discipline over the four years of chemistry study in\ncollege and two semesters of graduate chemical engineering courses. Applications of\nchemistry and chemical engineering in various fields have opened my eyes. In my\nundergrad, I joined a research program to coat polyacrylamide gel with polydopamine\n(PDA) catalyzed by H O / Fe3+ which would be used for wound infection treatment\n2 2\nwhen the COVID pandemic forced me to stay back in China. This specific gel would\noffer photothermal disinfection from the nature of PDA and chemodynamics\ndisinfection from hydroxyl radicals derived from H O and Fe3+. The gel could\n2 2\npotentially cover skin laceration and speed up curing. Moreover, it is porous so the\nskin wouldn't be in anoxic environment. Another lab I joined in my undergrad was\nDNA nanotechnology lab. We strove to customize DNA strands and assemble into\npolygonal shapes. One advantage of such making is its potential of drug delivery\ncarrier due to miniscule size and good chemical bonding with drugs.\nDuring my graduate school period, my degree concentration is energy and\nclimate. Some memorable courses include: green chemical engineering, CO2 capture\nand utilization, and electrochemistry. In Green Chem, we learned how to design\nchemical product with minimum sources and how to leverage profit margin and\nenvironmental impact. This idea would truly influence me when I conduct lab\nexperiment. Other classes also shape my understanding of the world. Since my\nundergrad was in chemistry, I only had minimal exposure to industrial trend and\nsociety. Having learned Carbon Capture & Utilization and Electrochemistry, I notice\nthe world is in drastic need of renewable and clean energy. These courses experience\nmake me more fascinated about the energy and climate field.\nFew semesters of lectures could suit me with an overview of chemical\nengineering industries. However, a deep understanding of specific field would be only\nrealized by dedicating years in PhD study. So far, I participated in Prof. McNeil’s lab\nto explore how to selectively deposit lead ions over other heavy metal ions under the\nsupervision of Dr. Narouei. The research makes me have deeper understanding in\nelectrochemistry. I realized one can modify the surface of electrode by depositing it\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Tang, Zifeng; DOB: 01/17/2000; ID: 282670368\nwith gold nanomaterial or with organic acid. The modification would enhance the\nchemical and physical bonding of lead ions to the electrode surface, and therefore\nbenefiting the electrodeposition of lead.\nColumbia University intrigues me for its world renowned academia and its\nlocation in New York City. NYC offers me numerous stress-relieving events provided\nthat I am in a anxious mood. Moreover, this metropolitan is the pivot of massive\nacademic network. Connection with people from both industry and academy would\nprovide me with insights for my future lab research. Moreover, I’m very looking\nforward to studying and working with distinguished professors specializing in\nmaterials, climate, and environment to explore real life applications. For example, the\nresearch topics on electrochemistry and battery from Prof. Alan West are really\nalluring. His projects emphasize on sustainability and alternative energy from which I\nam exciting to learn more. Other fascinating projects include Prof. Kumar’s\npioneering exploration of inorganic nanoparticles for the polymers to unleash\nnumerous potentials for biomimicry, energy storage and conversion. There are many\nother outstanding professors like Professor Esposito who has done brilliant work in\nfuel cell and solar ene. It would be such an honor if I were to work closely within\ntheir lab and manipulate state of the art facilities. Continuing either one of their\nstudies will go a long way towards addressing my concerns about sustainability and\nenable me to develop practical designs that benefit people’s lives.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}