{
  "document_name": "Naga Venkata Chandrasekhar, Koralla (285518974).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nKORALLA NAGA VENKATA CHANDRASEKHAR\nStructural analysis and its application to perform optimisation is fast expanding its\nhorizons with new methods used to precisely represent the geometry using splines and\nto perform analysis to determine the energy stored by the structure. Newer criteria\nhave been identified to check for the safety of the structure. I am interested to\ncontinue on my research work in the area of the structural analysis with optimisation.\nThe use of optimisation to determine the layout of the steel within the reinforced\nconcrete domain is one of the significant application of optimisation. The distribution\nof material at the ultimate elastic limit is the result of the topology optimisation. The\nforces carried by the structure at this optimal point of convergence is of practical\nsignificance. For example, to determine the prestressing force in a bridge pier will\nhelp the Engineer to know the magnitude of the tensile forces at the elastic limit. The\napplication of optimisation to determine the optimal water pipe line network for a city\nis also one of the best examples in Civil Engineering.\nI have worked for several years as a teaching faculty at my home place in Hyderabad,\nIndia teaching both Undergraduate and Graduate students in Civil Engineering. I\nhave taught several subjects as Strength of Materials I & II, Structural Analysis I & II,\nAdvance Structural Analysis, Numerical Methods in Structural Engineering, Finite\nElement analysis. Conducted laboratory for Undergraduate and Graduate students in\nStrength of Materials Laboratory, Finite Element Analysis Laboratory. I have worked\nin the area of Topology Optimisation of continuum structures. I have worked on\nfinite element analysis to analyse continuum structures. I have published a few papers\nin the topology optimisation of continuum structures.\nMy intent to pursue my further study and research work in the field of computational\nmechanics is never ending. I see there is no possibility of any funding. I have a\nstrong intent to continue my research work and explore further areas of study. I\ncannot live without research work simply taking classwork and grading is not what I\nwant to do. Life without exploring new avenues and challenges is a stand still. I\nwould like to put my thoughts to work on new ideas is all I want to do.\nI have started studying on advamced structural analysis and structural optimisation in\nmy first semester at IIT in the year 1998. Did not understand much at that time but it\nwas something interesting and challenging. The problems were too lengthy to solve\nby hand and there is lot of mathematical work required for each problem to determine\nthe area of steel required. There is lot of focus on mathematics in my education since\nmy high school. Mathematics is an integral part of many subjects in some form and\nrequired to analyse and solve the problems. The subject of Structural Optimisation is\nquite interesting in the sense it is used in several fields of study. In reinforced\nconcrete member, to determine the amount of steel satisfying the strength and\nserviceability conditions, to lower the cost of the steel required. In a two dimensional\nplate carrying in-plane loading, the plate is modelled using linear splines and the\noptimal distribution of material in the design domain is determined.\nI have worked with several people in India and outside India in the field of Structural\nEngineering and also from allied fields. I have seen people and students who are\nextremely talented and proven successful. I am not one of their kind but I am\ndefinitely hard working individual. I have been working on optimisation of different\ntypes of structures for several years now. Inverse buckling formulation to perform\ntopology optimisation of continuum structures and determine the deformed profile at\nKORALLA NAGA VENKATA CHANDRASEKHAR\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nKORALLA NAGA VENKATA CHANDRASEKHAR\noptimal state of convergence. The buckling criteria is used to check for statbility\ncriteria to determine the buckling load factor. The buckling load factor can give us an\ninformation on how much load the structure can carry before the buckling occurs.\nThe inverse of the buckling load is taken as the objective function and the deformed\nprofile is determined at convergence. Cubic basis splines have been used to model\nthe geometry of the structure and perform analysis to determine the nodal\ndisplacements at each node. The results of the nodal displacements were compared\nwith the results obtained from finite element analysis using six node linear strain\ntriangular elements.\nStructural mechanics, solid mechanics and materials division of Structural\nEngineering is the place I would like to work. I would like to do my work on\ncomputational analysis of structures, model the structures and determine the\ndeflections and stresses. I will work on new methods to perform optimisation of\ncontinuum structures. I can continue my present work into non-linear analysis to\ndetermine the optimal distribution of material within the design domain.\nComputational analysis of structures is one area where I can use finite element\nanalysis and I can do basic coding in ForTran, C, MatLab. I have worked on gradient\nmethods and meta-heurisitic based methods to perform the analysis. I have used the\nconventional method such as first order sensitivity analysis using optimality criteria to\nperform optimisation of structures. Non-gradient based heurisitic methods to perform\noptimisation of structures using genetic algorithms, firefly algorithm are few methods\nwhich I have used to conduct my research work. I would like to pursue my research\nwork in the area of reliablity based stochastic analysis of structures and perform non-\nlinear topology optimisation to determine the optimal layout of material.\nAbout my background, I am born in a middle class family. My father is a state\ngovernment employee and mother is a house wife. Monthly salary is the only source\nof income to live and I come from a modest background and education to prosper is\nthe only way for me to live. I did my undergraduate in Civil Engineering at\nHyderabad, India in the year 1994-98. I then continued to study my graduate study\nwith Masters in Structural Enginerng at IIT Bombay in the year 1998-00. I pursued\nmy graduate studies with Masters in Business Administration from Johns Hopkins\nUniversity, Baltimore, MD in the year 2004-06.\nThe applications of structural optimisation has to reach the day to day life of an\nindividual. Not many people have any know-how in this area of study. I came across\na few who say Topology optimisation is just theoretical study. The study of\noptimisation should be encouraged in the regular class work of Undergraduate and\nGraduate study. The application of optimisation to Civil Engineering should be the\npart of the course work. The modelling of different materials in a concrete mix to\ndetermine the material properties of the combined mix is one area where optimisation\ncan be used. The use of machine learning algorithms, deep learning algorithms is\nshowing a new way to the field of optimisation and structural optimisation as well.\nI would want to start a computational analysis laboratory along with the course work\nfor Undergraduate and Graduate students in Engineering. Conduct research related to\ncomputational analysis in Engineering. The area of Structural Optimisation which is\nlargely dependent on the using of computers to perform the analysis is one of the\nKORALLA NAGA VENKATA CHANDRASEKHAR\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Naga Venkata Chandrasekhar, Koralla; DOB: 07/25/1976; ID: 285518974\nKORALLA NAGA VENKATA CHANDRASEKHAR\nprime areas of Engineering where in the knowledge and insight into Civil\nEngineering, Mathematics and Computers are coming together. The idea to develop\nthe computational analysis as a specialisation in Engineering which is across the\ndisciplines of Engineering and which serves as an interdisciplinary.\nKORALLA NAGA VENKATA CHANDRASEKHAR\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}