{
  "document_name": "Kim, David (334601415).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Kim, David; DOB: 11/16/1992; ID: 334601415\nDavid Kim\nMy work experience has been driven by an interest in the intersection between computer\nscience and medicine. My first job was at a non-profit organization disseminating specialist\nmedical knowledge to doctors in rural areas, and I currently work at a drug discovery startup\nwhile volunteering at a medical imaging lab. While I believe there is vast room for innovation in\nmedicine, I would like to grow my skills in computer vision, natural language processing, and\ndata analysis in an academic setting. I have found technology typically plays second string in\nbiotech, and therefore would like to spend the next few years becoming an expert in application,\nwith the intent to build a future career to go back towards healthcare.\nMy interest in research started at Georgia Tech, when I delayed graduation to develop a\ncognitive presence classifier on student forum data. I extracted linguistic features using both\nlicensed and free software (Linguistic Inquiry and Word Count and Tool for the Automatic\nAnalysis of Text Cohesion) for a 90% micro recall and 82% macro recall. I found that I enjoyed\nworking on open-ended problems. Reading papers, reviving old code to get performance with a\nbasic random forest classifier that outperformed my classmate’s transformer model was exciting\nas it was an exercise of both independent problem solving and intellectual freedom.\nThis led to volunteering at the Center for Virtual Imaging Trials lab at Duke university.\nHere I was tasked with developing small intestine models for virtual patients. While the project\nwas initially proposed as an implementation of random walk algorithm, the scope naturally\nbroadened to include developing an outer frame of a computerized tomography scan\nreconstruction through alpha-wrapping and conversion of the walk path into a 3D model using\ncubic splines. This led to my first conference submission, resulting in an oral talk at SPIE\nmedical imaging.\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Kim, David; DOB: 11/16/1992; ID: 334601415\nDavid Kim\nFinally, at my current biotech company, I volunteered to assist in publication efforts. I\nhave trained and benchmarked internal drug discovery models against public methods. I have\nharmonized public and private data, run legacy libraries across old technology stacks, and\nreplicated internal work across an electronic notebook catalog. Through this process, I have been\nfamiliarizing myself with the underpinnings of research, while working closely with doctorates.\nListening to their thoughts on defining the critical path of an experiment and seeing them\ndevelop strong conclusions through meticulously designed charts has given me a desire to further\nimprove my ability to think, communicate, and problem solve.\nMy objective at Columbia is to develop a robust framework for inquiry and problem\nsolving while stepping into research. Learning-wise, I would like to build a foundation in applied\nmathematics through coursework in the stellar mathematics department. Business-wise, I am\ninterested in exploring opportunities in entrepreneurship through Columbia’s startup lab.\nAcademically, I would like understand how to direct and execute research from the highly\nregarded faculty and explore the field of artificial intelligence with curious peers.\nAfter graduation, I would like to use my academic training to continue research in either\nacademia or industry. I would also like to spend 1-2 years founding a startup. I believe the\nmedical field is ripe for technological disruption, and one promising area would the medical\nimaging industry. The American College of Radiology reports predict a deficit in diagnostic\nradiologists and an increase in cancer rates. Increasing market growth, promising clinical trials,\nand adoption of big players like Google and Nvidia suggest the space is primed for innovation.\nHowever, I am open to exploration, as it is clear the labor market will undergo change\ndue to integration of AI in everyday life. Large language models are now heading into abstract\nand higher skilled markets: law, creative writing, and software engineering. It is hard to predict\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Kim, David; DOB: 11/16/1992; ID: 334601415\nDavid Kim\nwhere the priorities of industry, government, and society will be after graduation, but I know that\nI will be well prepared to adapt and thrive in any environment with Columbia’s stellar\ninstruction.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}