{
  "document_name": "Pan, Jie (345339289).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Pan, Jie; DOB: 08/12/1992; ID: 345339289\nJie Pan\nPersonal Statement\nDear Admissions Committee,\nI am writing to express my sincere interest in pursuing a PhD in Electrical\nEngineering at Columbia University. I believe that my academic background, research\nexperience, and career aspirations make me a strong candidate for your program, and I\nam eager to contribute to the Columbia Engineering community.\nMy name is Jie Pan, and I am currently pursuing a second master's degree in\nelectrical engineering at the University of Virginia. Prior to coming to the United States,\nI had the privilege of working at the China Academy of Information and\nCommunications Technology, an institution akin to Bell Laboratories in China. During\nmy time there, I immersed myself in the field of Photonics, achieving a remarkable\nacademic record in courses such as laser and optics, Optical Communication Devices,\nSolid State Physics, Quantum mechanics, and more. I also gained extensive hands-on\nexperience with various experimental instruments, which proved instrumental in my\nresearch endeavors.\nThroughout my postgraduate studies, I actively participated in several significant\nresearch projects. Notably, I was a key member of the team responsible for the National\nNatural Science Foundation of China (NSFC)/RGC Joint Research project on Visible-\nlight Optomechanical integrated circuits based on III-nitride semiconductors. This\nproject encompassed various aspects of photonics, nanophotonics, and optoelectronics,\nincluding the growth and characterization of III-nitride materials, the design and\ncharacterization of photomechanical resonators, and information transmission\nmodulation.\nOne of my proudest achievements during this period was the design of a GaN-\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Pan, Jie; DOB: 08/12/1992; ID: 345339289\nJie Pan\nbased Quantum Dot (QDs) microdisk laser with optical pumping, featuring a novel\nstructure called GaN-on-insulator (GaNOI). This work led to my presentation at the\n11th International Nano-Optoelectronics Workshop, where I received the Best\nConference Paper Award. My master's thesis, titled \"Research on the fabrication of\nGaNOI structure and micro disk towards optomechanical system,\" encapsulated the\nculmination of my research efforts.\nFurthermore, my experience as a researcher at IBM Research - China and my\ncurrent position as a Senior Researcher at the China Academy of Information and\nCommunications Technology have allowed me to delve into advanced topics in\noptoelectronics, semiconductor materials, and quantum information sciences. These\nroles have enriched my knowledge and practical abilities, reinforcing my desire to\npursue further education and contribute to groundbreaking research.\nI am particularly drawn to the field of optical materials, optical modulators,\nwaveguide switches, photonic integrated circuits, and photodetectors. These\ncomponents play a pivotal role in the era of Big Data, cloud computing, and the Internet\nof Things, where efficient data communication is essential. My graduate studies at the\nUniversity of Virginia broadened my expertise, especially in the design and simulation\nof high quantum efficiency waveguide segmented photodetectors for quantum\nmeasurements. This work has significant implications for accurate photon number\nresolution in quantum measurements. The segmented waveguide photodetector has the\npotential to play a crucial role in quantum measurements, especially for photon number\nresolution. In this study, I focus on the design and simulation of a waveguide segmented\nphotodetector with high quantum efficiency, utilizing the eigenmode expansion (EME)\nin Fimmwave software. Through optimization of the device design and comprehensive\nanalysis of the quantum efficiency and loss mechanisms, my findings reveal that the\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Pan, Jie; DOB: 08/12/1992; ID: 345339289\nJie Pan\nproposed waveguide segmented photodetector exhibits superior performance compared\nto other photodetectors. The enhanced quantum efficiency makes it an ideal candidate\nfor accurate photon number resolution in quantum measurements. By utilizing the finite\nelement method, I was able to model and simulate the device with precision, allowing\nme to optimize its design for optimal performance.Paired with my endeavors in optical\nmodulators and optical waveguide design, these experiences established a robust\nfoundation, priming me for the myriad challenges and vast opportunities in avant-garde\nresearch areas.\nAs I look ahead, I see tremendous potential in the field of photonic integrated\ncircuits, driven by the increasing complexity of datacenter communications. My\nextensive background in micro and nano optoelectronics, integrated Quantum\nPhotonics, and optical computing positions me well to make meaningful contributions\nto cutting-edge research in these areas.\nColumbia University is renowned for its excellence in research and its exceptional\nfaculty. I am enthusiastic about the prospect of joining a vibrant academic community\nthat nurtures bright, creative, and self-motivated scholars. I am committed to obtaining\nthe best possible learning experience, equipping myself with the knowledge and skills\nnecessary to become a first-class researcher.\nIn conclusion, I believe that pursuing my PhD in Electrical Engineering at\nColumbia University is the perfect next step in my academic and research journey. I am\nconfident that I can make valuable contributions to the program, and I am excited about\nthe opportunity to study and conduct research at such a prestigious institution.\nThank you for considering my application. I look forward to the possibility of\ncontributing to the Columbia Engineering community and achieving my academic and\nresearch goals.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}