{
  "document_name": "Nekoie, Masood (369980282).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Nekoie, Masood; DOB: 03/28/1995; ID: 369980282\nMasood Nekoie\nPersonal Statement\nDear Admission Committee of the Columbia University CS Department,\nI am Masood Nekoie, a dedicated student in Canada with an unwavering passion for research and\na strong desire to embark on a transformative journey as a PhD student. I am writing to express\nmy profound interest in your esteemed institution and your field of research.\nMy aspiration to be a prolific researcher has driven me to seek the mentorship of outstanding\nprofessors, and Columbia University stands out as the ideal platform for this pursuit. I am\nparticularly captivated by Professor Henry Yuen, Professor Zemel and Professor Ghaderi\nresearch focus.\nMy current work involves the implementation of the GWO method to develop the GWP approach,\naimed at solving symbolic regression and prediction problems. This research endeavor has\nenriched my academic experience and resulted in a publication in a prestigious Machine Learning\njournal, where I introduced ABCEP as an innovative automatic programming method\n([1](https://doi.org/10.1016/j.ins.2020.09.020 : Information Science Journal)). This method,\ncombining ABCP and GEP, required extensive coding, including ABCP, qABCP, qsABCP,\nsABCP, GP, and GEP, to ensure a fair comparison.\nI am well-versed in MATLAB and Python, demonstrated by the extensive code within my\npublished papers, comprising thousands of lines. My master's degree at Amirkabir University of\nTechnology was dedicated to applying these methods to real-world problems, particularly in the\nfield of electrical circuits. My thesis, with a GPA of 3.8/4, delved into \"Characterization of\ncomplex materials in the THz band using CSRR metamaterial and investigating their behavior\nthrough AI automatic regression methods.\"\nFurthermore, my proficiency extends to optimization methods, including genetic algorithms, PSO,\nABC, Ant colony, and ICA. I possess the capability to hybridize these methods for practical real-\nworld problem-solving.\nIn addition to my research pursuits, I have a diverse background in electrical engineering,\nencompassing neural networks, RF design, THz characterization, numerical evaluation of\nelectromagnetic circuits, FPGA programming, quantum computing (currently exploring\nHamiltonian simulation), and automatic programming in AI.\nI am currently a PhD student at Carleton University with a perfect A+ (4/4 GPA) record in my\ncourses. While Carleton University is strong in various areas, I aspire to be part of Columbia\nUniversity's academic community to further my ideals.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Nekoie, Masood; DOB: 03/28/1995; ID: 369980282\nThe prospect of joining your program excites me immensely, and I am highly motivated to\ncontribute to your research community. If there is an opportunity within your group, it would be\nan honor to be considered.\nBest regards,\nMasood Nekoie\n+15142084328\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}