{
  "document_name": "Kuanyshbay, Maksat (412295099).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Kuanyshbay, Maksat; DOB: 06/26/1997; ID: 412295099\nMaksat Kuanyshbay\nSEAS, Columbia University\nPersonal Statement\nG.H. Hardy once said: “I have added something to knowledge, and helped others to add more; and\n… these somethings have a value.” This sentiment profoundly resonates with my academic journey, which\nbegan in a high school renowned for nurturing gifted minds in mathematics. It's here that I first discovered\nmy passion for mathematics, a journey that has led me to the pursuit of a PhD in Computer Science at\nColumbia University, driven by a desire to contribute to the field of computational innovation.\nMy passion for mathematics, particularly geometry, was evident from my early years. It was this\nfascination with spatial thinking and problem-solving that fueled my success in mathematical competitions\nand later crystallized my interest in computer science during my undergraduate years at Nazarbayev\nUniversity, the foremost higher educational institution in Kazakhstan. Here, I discovered the symbiotic\nrelationship between mathematics and computer science, which was further exemplified in my project\n“Imaging in Seismic Explorations” under Professor Yogi Erlangga. This project entailed applying the method\nof difference potentials in 2D space on a circular domain, challenging me to translate mathematical theory\ninto practical computational solutions. This early exposure to research was instrumental in shaping my\napproach to problem-solving and computational thinking.\nMy graduate studies at NYU's Courant Institute of Mathematical Sciences were pivotal in shaping\nmy research trajectory, beginning with a transformative experience in the Computer Graphics course. Under\nProfessor Daniele Panozzo, I discovered the fascinating interplay of geometry and computer science,\nreshaping my perspective on the practical applications of mathematical concepts I had engaged with since\nmy school days. A significant milestone was my capstone project with Professor Ben Peherstorfer, focused\non accelerating ray tracing algorithms using parallel computing. This work deepened my understanding of\nhigh-performance computing, which is crucial in complex computer science research.\nThese experiences at NYU Courant were complemented by my work in Professor Rob Fergus'\nComputer Vision class, where I delved into cutting-edge topics such as Diffusion Models, Transformers in\nVision, Semantic Segmentation, GANs, Optical Flow, Stereo Reconstruction, and Text-to-Image models.\nThe culmination of this class was the 'Emoji Diffusion' project, an exploration of denoising diffusion\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Kuanyshbay, Maksat; DOB: 06/26/1997; ID: 412295099\nMaksat Kuanyshbay\nSEAS, Columbia University\nprobabilistic models. It was a significant step in my journey towards understanding the transformative power\nof computer vision in interpreting and generating visual data.\nCurrently, I am engaged in a research project titled “Surgical Simulation for Manipulating the\nOmentum” with Professor Gizem Kayar. This research involves developing realistic physical\nrepresentations of deformable objects using numerical integration methods like Euler’s and Verlet’s\nmethods, an essential aspect of surgical simulations. This research has honed my technical skills and\nemphasized the real-world impact of computational research in healthcare.\nMy teaching assistantship roles, from being a recitation leader in Honors Linear Algebra to grading\nfor Graduate Computer Graphics, were instrumental in refining my ability to simplify complex concepts.\nThese experiences not only solidified my subject matter expertise but also enhanced my communication\nand leadership skills, crucial for a career in academia.\nAt Columbia, I am particularly enthused by the opportunity to work with faculty like Professor\nChangxi Zheng, whose work in physical simulation aligns with my interest in computational models.\nProfessor Carl Vondrick’s research in computer vision offers a perfect platform for further exploration in\nthis field, particularly in the areas of robust and versatile perception models. Additionally, the expertise of\nProfessor Shree Nayar in computational imaging and vision systems aligns with my aspirations in physics-\nbased models for vision and graphics.\nIn joining Columbia University’s PhD program, I aim to contribute to the field of computer science\nby developing innovative computational models and algorithms. I also look forward to sharing my\nexperiences in programming and mathematics competitions, nurturing a culture of intellectual curiosity and\nproblem-solving skills among students.\nIn conclusion, my journey has been a testament to my commitment to computational research and\nacademic excellence. At Columbia, I am eager to continue this trajectory, evolving as a researcher and\neducator, and making impactful contributions to the scientific community and beyond, in line with the ethos\nof G.H. Hardy.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}