{
  "document_name": "Lau, Wai Tak (413834948).pdf",
  "total_pages": 5,
  "pages": [
    {
      "page_number": 1,
      "content": "Lau, Wai Tak; DOB: 04/13/1999; ID: 413834948\nWai Tak Lau (Michael)\nPersonal Statement: Computer Science PhD at Columbia University\nChatGPT told me that the determinant of a diagonal matrix is the sum of the diagonal elements,\nbut it should be the product instead. 1Although trivial in this case, large language models\nhallucinating pose a serious problem when used in domains such as healthcare. One of the\ncentral problems in modern deep learning is that it fits to observational distribution and does not\nconsider the cause and effect between different variables. These problems have motivated my\nresearch interest: 1) Learn causal representations of high-dimensional and multi-modal data,\nthat allows models to perform well on unseen data and when few labels are available. These\nrepresentations can be reused to build new models iteratively ; 2) Using the learnt causal\nrepresentations for developing machine learning models in healthcare, applying to diseases\nclassification, biomarker discovery and clinical deployment.\nI discovered my passion for research much later than my peers. When applying for masters\nprogram during senior year undergrad, my goal was to go into industry as I had yet to gain in\ndepth knowledge and problems that I am passionate about. However, this changed as I dove\ndeeper into different areas in machine learning and discovered many interesting and important\nproblems. This led me to work in the AI4VS lab, led by Prof. Kaveri Thakoor, along with other\namazing collaborators. Over the process, I grew to enjoy research and gained valuable\nexperience. I have keen interest and am now looking to further develop my skills at Columbia\nUniversity.\n1 I asked ChatGPT to generate math questions and it failed to provide the correct answer.\n1\n10/07/2024 09:54 Personal Statement 1/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Lau, Wai Tak; DOB: 04/13/1999; ID: 413834948\nWai Tak Lau (Michael)\nResearch at AI4VS Lab Data scarcity is one of the main problems in machine learning in\nhealthcare, involving not only gathering a large amount of training data but also obtaining high-\nquality labeled data for training supervised algorithms.\nI am excited to address this problem by using data of different modalities, similar to how text and\nimages can be combined. At AI4VS lab, we used eye tracking data to address this problem. Eye\ntracking has long been used to understand the subject's cognitive process when examining\nstimuli, and the relationship was proposed in the Eye-Mind hypothesis [1] [2]. Eye tracking data\nreflects the regions and order of importance as clinicians examine the reports, and they can be\nused as surrogate information that acts as labels in a situation where ground truth is not available.\nMost of the current approaches when using eye tracking data with images ignore the temporal\naspect of the data, therefore the challenge is to create a reasonable encoding to capture both\nspatial and temporal relationships. To address this problem, I designed a new way to encode eye\ntracking information as words, inspired by natural language processing. A transformer encoder\nbased model is then used to train with a multitask objective to learn meaningful embeddings\nwhere eye tracking on similar images are close to each other. Our goal is to use these\nembeddings to generate pseudo labels to train a model that uses optical coherence tomography\n(OCT) reports of the retina to predict Glaucoma (a neurodegenerative disease that leads to\nblindness). Although we need more data to support this conclusion, the results have shown that\neye tracking data aids downstream tasks like Glaucoma classification. More surprisingly, eye\ntracking data alone achieves relatively high accuracy in classifying Glaucoma. During this\nprocess, I learnt how to maneuver in the complex search space of possible hypothesis and\nconvert a hypothesis into concrete problems that we can solve. I presented this work at Columbia\n2\n10/07/2024 09:54 Personal Statement 2/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Lau, Wai Tak; DOB: 04/13/1999; ID: 413834948\nWai Tak Lau (Michael)\nCenter of AI Technology Symposium: AI & Healthcare and I am working to submit this work to\nas the first author.\nIn the context of healthcare, I am interested in developing and applying techniques in causal\nrepresentation learning to learn interpretable representations that can aid understanding new\nbiomarkers, interpretability and be used for downstream applications such as segmentation or\neven hypothesis generation. As a first step, we can work towards a joint embedding space\nbetween images and eye tracking, and even text from clinicians inspired by CLIP [4].\nOther Projects and Experiences One interesting application that arises from GANs is\nperforming image translation by generating samples from the conditional distribution P(x|y),\nwhere y is the input image and x is the translated image. However, this translation might not be\naccurate due to lack of conditioning on set of covariates z. For example z could be which city we\nwould like to translate input into in Cityscape dataset [1], since different cities might have\ndifferent architecture style. To overcome this challenge, we can not only generate from P(x|y,z)\nbut also take into account the causal relationships, where each variable is modeled by a neural\nnetwork.\nFigure 1: Example inputs and outputs from CityScape Dataset [1]. The dataset is collected from\ndifferent cities. Left is the input, and right is output.\n3\n10/07/2024 09:54 Personal Statement 3/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Lau, Wai Tak; DOB: 04/13/1999; ID: 413834948\nWai Tak Lau (Michael)\nAs I embark on my research journey, I have realized in many ways research is similar to\nentrepreneurship as they both require extreme ownership. During my undergraduate studies, I\nventured into the entrepreneurial world through the Alchemy program at University of Illinois at\nUrbana-Champaign (UIUC), lead by Professor Sanjay Patel. Our goal was to build a minimum\nviable product for predicting realtime audio quality in the hopes that this information could be\nhelpful for improving audio delivery and ultimately video as well. There were two main\nchallenges: finding high quality training dataset that contains audio degradations and the real-\ntime constraint. To solve the first problem, we decided to build a synthetic dataset by collecting\nour own data using Amazon Mechanical Turk. I helped design and build the survey as well as the\ndifferent simulators to generate the synthetic audio dataset that consists 30 hours of audio. This\ngave me the chance to dive into audio quality metrics, compression codecs and audio quality\ndegradations. To address the second problem, I also suggested the two stage features extractor\nand regression model to accommodate the real time needs. Ultimately, the model performed\ncompetitively and I learnt how to pivot around a obstacles creatively.\nAt Columbia My long term goal is to become a researcher in using machine learning to enhance\nhealthcare. I am especially excited to work with Professor Kaveri Thakoor and Professor\nRichard Zemel. I specifically want to work in the AI4VS Lab, as the lab and my interests aligns\nin robust and interpretable machine learning in healthcare using data from different sources and\ndifferent modalities. Professor Richard Zemel’s interests in few-shot learning and continual\nlearning aligns with my interest learn useful representation that allows model to perform well\nwhen few labels are available and build models iteratively. I appreciate the close connection\nbetween the medical school and the computer science department, making it the ideal\nenvironment for me to transition from theory to application. With the excellent faculty, students\n4\n10/07/2024 09:54 Personal Statement 4/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Lau, Wai Tak; DOB: 04/13/1999; ID: 413834948\nWai Tak Lau (Michael)\nand collaborative environment, Columbia is the ideal place for me to continue my academic\njourney.\nReferences\n1. Just, M. A., and Carpenter, P. A. (1976b). Eye fixations and cognitive processes. Psychol.\nRev. 87, 329–354. doi: 10.1016/0010-0285(76)90015-3\n2. Rayner K. Eye movements in reading and information processing: 20 years of research.\nPsychol Bull. 1998 Nov;124(3):372-422. doi: 10.1037/0033-2909.124.3.372. PMID:\n9849112.\n3. M. Cordts, M. Omran, S. Ramos, et al., The cityscapes dataset for semantic urban scene\nunderstanding, 2016. DOI: 10.48550/ARXIV.1604.01685. [Online]. Available: https: //\narxiv.org/abs/1604.01685.\n4. Radford, A. et al. (2021) ‘Learning Transferable Visual Models From Natural Language\nSupervision’, arXiv [cs.CV]. Available at: http://arxiv.org/abs/2103.00020.\n5\n10/07/2024 09:54 Personal Statement 5/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}