{
  "document_name": "Wu, Cynthia (432789225).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Wu, Cynthia; DOB: 01/08/2000; ID: 432789225\nCynthia Wu\nIn a neuroscience elective in high school, I learned that doctors monitored epilepsy in patients\nusing the voltage across time in EEGs. Around the same time, CTRL-Labs was prototyping wristbands to\ndetect intent in impulses traveling through the wrist. I felt certain that in electrical engineering, I would find\nthe window to the brain. Today, Synchron’s stentrode and “brain.io” is in clinical trials, taking signals\ndirectly from blood vessels in the brain to allow paralyzed individuals to control computers. I learned of\nthis new technology in the first year of my master’s degree in electrical engineering and became\nconvinced that not only would this field provide a window to the brain, it would become integral to\nsupporting its functions.\nWith this in mind, I volunteered for Dr. Dion Khodagholy’s Translational NeuroElectronics Lab at\nColumbia University in the second semester of my master’s degree. During this time, I learned of the\neffects of sleep and epilepsy on memory in rats as well as the closed-loop methods used to treat it. As\nsuch, I’m deeply invested in uncovering the mysteries underlying the formation and consolidation of\nmemory and how they present themselves as electrical measurements. Not only is the puzzle of memory\nintriguing, understanding it would be crucial in aiding the health and quality of life for many patients, such\nas those with Alzheimer’s or epilepsy. In the context of human health, the study of the brain becomes\nextremely interdisciplinary, merging everything from electrical and mechanical engineering to biology and\nneuroscience to statistics and deep learning. Columbia’s electrical engineering program merges all these\ntopics in both its coursework and research labs, and this is why I am applying to this PhD program in\nelectrical engineering.\nIn terms of courses, during my master’s at Columbia, I have had the pleasure of taking many\ncourses on processing signals from a variety of fields, from Dr. Aurel Lazar’s class on circuits in the brain\n(BMEB W4020) to Dr. Nima Mesgarani’s class on speech processing (ELEN E6820). This year, Dr. John\nWright’s class on sparse and low-dimensional models for high-dimensional data (ELEN E6001) has been\nenlightening for my efforts working for the Translational NeuroElectronics Lab. I hope that during a\npotential doctorate at Columbia, I can better understand the research I am contributing to with classes\nsuch as Dr. Ching-Yung Lin’s class on big data analytics (EECS E6893) and Dr. Predrag Jelenkovic’s\nclass on statistical learning and biological and information systems (EECS E6690). I also hope to learn\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Wu, Cynthia; DOB: 01/08/2000; ID: 432789225\nCynthia Wu\nabout biocompatible devices which acquire bioelectronic signals from classes such as Dr. Dion\nKhodagholy’s device nanofabrication class (ELEN E6945).\nIn terms of research, I plan to continue studying memory consolidation and closed-loop\ntreatments for epilepsy at the Translational NeuroElectronics Lab. Through this lab, I aim to both further\ninvestigate analytical methods to quantify physiological and pathological signals, as well as build from the\ndevelopments of new biocompatible and conformable implantable probes. During my time as a\nresearcher, I’ve been captivated by the various ways to quantify the pathology of NREM signals in both\nthe time and frequency domain, all while contributing to the development of closed-loop treatments. I\nhope to dedicate my potential doctorate to both further investigating explainable ways to explore sleep\nsignals as well as to examine the application of machine learning techniques with the goal of further\nuncovering the information between the neocortex and the hippocampus. I’m especially curious about\ninvestigating how techniques from extreme value theory can be applied to the quantification of such\ncommunication, especially as compared to techniques using measures of center. I’m also curious about\nexploring whether machine learning techniques will correlate with either or both types of measures in\nNREM signals. But I don’t just want to investigate these topics because they are interesting—I also feel\nthat the exploration of memory as it relates to various parts of the brain is intimately tied to the human\nexperience. Memory is so much of what makes us, us.\nFor this same reason, I also find Dr. Jennifer Gelinas’ research on the connection between\nepilepsy and memory and the features of neurodevelopmental disorders compelling. Dr. Gelinas’ research\nmakes inquiries on how memory is disturbed by epilepsy. I’m curious about the insights into memory that\ntreatment of said disturbance could provide. By observing and treating what is pathological, perhaps it is\npossible to discover patterns in the electrophysiological data which hint at what governs memory\nphysiologically. These are all questions at the intersection of health and electrical engineering which I am\nexcited to explore. I hope that my experience with investigating pathological and physiological NREM\nsignals in time and frequency domains equips me to contribute to either Dr. Khodagholy’s Translational\nNeuroElectronics Lab or Dr. Gelinas’ Epilepsy and Cognition Lab.\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Wu, Cynthia; DOB: 01/08/2000; ID: 432789225\nCynthia Wu\nBoth the research and coursework at Columbia represent what I’ve been looking for in an\nelectrical engineering degree, touching on everything from the devices which interface with the brain to\nthe analysis of the acquired cues. It is the culmination of what I’ve been looking forward to exploring since\nthe moment I learned the brain fired electrical impulses. I look forward to discovering new windows of\ninsight into memory and learning in the brain so that in the future, I can pursue a post-doctorate at the\nZuckerman Institute or at the Friedman Brain Institute.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}