{
  "document_name": "Kumar, Piyush (445177306).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Kumar, Piyush; DOB: 09/22/2000; ID: 445177306\nFor a long while, I have been captivated by the wonders of that chemistry created in the domain in\nlife sciences. The way the chemical reactions and molecular interactions are almost like a hidden\nlanguage revealing the mysterious story of life. This fascination has fueled my academic journey\nand drives my curiosity to delve deeper into the intricate world of life sciences. Pursuing my\nundergraduate and master's degree in chemical engineering, only further deepened my passion for\nthe field.\nThrough a PhD, I aim to explore new research areas, make meaningful contributions and\ncollaborate with esteemed researchers to address complex challenges, particularly in protein\nengineering from a chemical engineering standpoint. Fundamentals of chemical engineering are\nvital in protein engineering for designing and optimizing bioprocesses by studying their kinetics\nthrough different chemical reactions, enabling the production of valuable proteins for various\napplications.\nAs a master's student, my practical engagement, including participation in courses like\nBiopharmaceutical Process Laboratory, and my involvement in Dr. Banta's Research Group has\nsignificantly enhanced my practical skills as well as theoretical understanding. Notably, my\nresearch endeavors, such as exploring protein-ligand interactions through various analytical\nmethods, provided me with a platform to excel in experimental design and data analysis. Our\nresearch on metal binding proteins deepened my appreciation for the intersection of molecular\nbiology and chemical engineering, motivating me to pursue a PhD in these areas.\nDuring the research I had to explore the behavior of various intrinsically disordered proteins by\nculturing them in the lab and then performing analytical experiments such as Fluorescence\nResonance Energy Transfer (FRET) and Circular Dichroism (CD) to analyze the binding affinity\nof those proteins to different rare earth elements. Subsequently, I used various softwares to perform\nprotein-ligand docking in order to view the coordination chemistry and examine the correlation\nbetween the structural motifs and the ligand binding sites. Doing so would bring us a step closer\ntowards screening out suitable proteins that can be used in biomining to mine out rare earth\nelements.\nI am genuinely intrigued by biotechnology, one of the applications of chemical engineering to\nrefine proteins, a process exemplified by directed evolution and rational design. This field\npossesses the potential to revolutionize industries and enhance human well-being. This technique\nallows scientists to selectively alter specific DNA sequences within genes, resulting in tailored\nchanges in protein structure and function. Such precision engineering can lead to the development\nof novel proteins with optimized properties, ranging from enhanced therapeutic efficacy in\nmedicines to more efficient enzymes for industrial processes.\nMy time at Columbia University, including a summer spent on research, not only advanced my\ntechnical capacity but also involved mentoring new students who significantly contributed to my\nresearch in the later stages. Teaching them the basics of laboratory techniques in a stepwise manner\nalong with the concepts revolving around them not only reinforced my understanding of the\nconcepts surrounding the experiments we conduct but also improved my ability to handle multiple\ntasks while conducting my own research.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Kumar, Piyush; DOB: 09/22/2000; ID: 445177306\nWorking simultaneously on multiple projects, including assisting fellow researchers, has honed\nmy teamwork, troubleshooting, and leadership skills, fostering an environment of shared scientific\npursuit.\nAfter just seven months, I have learned a lot of hands-on techniques and methods of data analysis.\nHowever, when I see the depth of knowledge my mentors at Columbia University have, it's clear\nI have much more to grasp. I believe there is still a wealth of learning for me here, and that is why\nI am eager to extend my stay and dive into a PhD program. Columbia offers a unique environment\nfor me to gain a deeper understanding of science and research, and I am excited to explore these\nopportunities further.\nMy ambition involves combining hands-on experimentation and computational simulations to\nunravel the intricate mechanisms governing protein functionality. Subsequently, I aspire to\nleverage this profound understanding to engineer innovative solutions for significant challenges\nwithin the realm of biotechnology. This educational journey will equip me with invaluable skills,\nknowledge, and a strong network, empowering me to make a meaningful difference in the realm\nof chemical engineering. I am excited about the potential for growth and exploration that a PhD\noffers, and I embrace the challenges and opportunities that lie ahead in my academic pursuit.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}