{
  "document_name": "Yang, Yucheng (467395093).pdf",
  "total_pages": 5,
  "pages": [
    {
      "page_number": 1,
      "content": "Yang, Yucheng; DOB: 05/27/2000; ID: 467395093\nPhDApplication inMechanical Engineering,Columbia University Yucheng Yang\nPersonal Statement\nMy fruitful academic journey commenced with a unique catalyst: Losartan, an ARB\nantihypertensive medication from Merck. My grandmother, a hypertension patient, relied on it.\nRegrettably, pharmaceutical companies in China were unable to independently develop this drug\nat that time, forcing patients to rely exclusively on imports. This situation imposed astronomical\nhealthcare costs on my family and became a source of sorrow for my grandmother. I still\nremember independently seeking alternative medical products due to these financial upheavals,\nand as I delved deeper into the intricate world of chemical drugs and medical products, I realized\nchemistry, as a foundational discipline, underlies all drug synthesis, and the mechanisms of\nchemical reactions are crucial for novel medical products development. Consequently, I found a\nprofound passion for the vast and divergent field, which guided me to Southeast University for a\nBachelor’s in Chemistry,laying a solidbasis for future innovationsin medicalproducts.\nRecognizing the integral role of synthesis in medical product development, I joined Prof.\nHao Wang’s group during my undergraduate studies to build a robust foundation in organic\nsynthesis, focusing on silylene-related compounds. Due to the product’s sensitivity to water and\noxygen, I proficiently operated a glovebox and Schlenk-line after mastering fundamental organic\nsynthesis methods, such training in anhydrous and anaerobic operations greatly honed my skills\nin chemical synthesis. Subsequently, I applied my synthetic foundation to drug development,\ncollaborating with enterprises on the process synthesis of omeprazole intermediates in Prof.\nHaibin Zhu’s group, bolstering skills in synthesis and characterization, and found my interest\npiqued by applying theoretical research to industrial production. However, the COVID-19\npandemic, presented disruptions to my wet-lab experiments. Undeterred, I pursued a project with\nProf. Erik Liujten at Northwestern University to perform computational simulations on graphene\n10/07/2024 09:54 Personal Statement 1/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Yang, Yucheng; DOB: 05/27/2000; ID: 467395093\nPhDApplication inMechanical Engineering,Columbia University Yucheng Yang\nusing software like LAMMPS, Moldy and Materials Studio to develop a model for graphene's\nthermal conductivity with various sizes and temperatures. This aided me in predicting material\nproperties,thus enablingbetterdesign ofwet-lab experiments for medicalmaterials development.\nTheresultswere published inThe 2ndEuropean SymposiumonComputer andCommunications.\nAs in-person teaching resumed, I joined Prof. Zhihai Ke’s group at the Chinese University\nof Hong Kong to further develop functional products with practical applications through organic\nsynthesis. We aimed to synthesize graphdiyne (GDY) and HKUST-1 metal-organic framework\n(MOF) on copper foam to create a novel GDY-MOF catalyst, amplifying the catalytic effect of\nHKUST-1 by promoting its electron transfer efficacy. Tasked first with synthesizing high-purity\nGDY, my expertise in anhydrous and anaerobic handling proved to be invaluable. Although\nfailing to grow ideal GDY initially, after literature research and improvisation, I got an optimal\nmorphology GDY by decelerating solution-dropping rate from 3h to 12h. Subsequently, Prof. Ke\nand I probed the catalytic distinctions among MOF, GDY-MOF and GDY through the phenol\noxidation reaction catalyzed by H O , and strategized to augment the yield of water-phase\n2 2\ncatalysis reactions by attaching a polymer layer. I devised a potent method to attach polymer to\nMOF without disrupting GDY by suspending GDY-MOF with cotton threads and demonstrated\nthe water-phase catalytic effect could be enhanced by attaching polymers, with the GDY-MOF-\nPolymer group showing the optimal catalytic yield. These findings were published on ACS Appl.\nMater. Interfaces,and anotherpaper for GDY synthesis was submittedto Chemistry of Materials.\nThis project enriched my comprehension of two-dimensional nanomaterials synthesis and\npotential applications,pivotal formy transition fromtheoretical to independentapplied research.\nMy pursuit of applying theoretical research to generate applied results guided me to\nColumbia, where I pivoted my major to Chemical Engineering for its application-oriented focus.\n10/07/2024 09:54 Personal Statement 2/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Yang, Yucheng; DOB: 05/27/2000; ID: 467395093\nPhDApplication inMechanical Engineering,Columbia University Yucheng Yang\nInitially, I grappled with my direction, as my research honed my expertise in materials science,\nyet my interest leaned towards biotechnology. Fortuitously, meeting Prof. Qiao Lin clarified my\npath, revealing a direction melded my interests and skills by applying MOFs and nanomaterials\nto medical devices, notably Biosensors and BioMEMS. Recognizing my zeal for pursuing a\nPh.D., he proposed two research topics: developing graphene-aptamer sensor for tacrolimus\ndetection in collaboration with Prof. Stojanovic, and enhancing TNF-a aptamer sensor’s shelf-\nlife—a challenging yet vital endeavor. After preliminary experiments, I identified sensor limited\nshelf-life issues from aptamer detachment, degradation and graphene surface damage. To\nmitigate this, I chose glass surface to firmly attach TNF-a aptamer via covalent GA-Coupling for\ndeveloping long-time fluorescent TNF-a sensors. Another approach, using Ni (HITP) MOF to\n3 2\ncovalently couple -NH on TNF-a aptamer to MOF’s organic framework, didn't work\n2\nsignificantly since aptamer still needs to be connected to Ni (HITP) via linkers. Nevertheless,\n3 2\nthis effort proved intriguing, it allowed growing highly conductive MOF films on sensors rapidly\nand effortlessly via dropping and heating MOF particles, outpacing graphene's CVD method.\nSubsequently, I transitioned to ZIF-90 MOF, eliminating the demand for linkers by directly\nconnecting -NH on aptamer to -CHO on ZIF-90 to enhance sensor shelf-life. However, ZIF-90's\n2\nconductivity required improvement to proficiently convert chemical signals to electrical ones.\nLeveraging my chemistry background, I increased ZIF-90’s conductivity to 2.26×10-2S·cm-1 by\nintroducing sulfonic acid groups through an aldehyde group's addition reaction with bisulfite,\nwhile -CHO transformed into -OH, ensuring compatibility with -NH on aptamer. Currently, I’m\n2\nardentlyengagedin this project,aiming to developstable andenduring biosensorsfor patients.\nMy ventures thus far have staunchly affirmed the role of material science as the cornerstone\nof mechanical manufacturing. To deepen expertise in device manufacturing and electrochemical\n10/07/2024 09:54 Personal Statement 3/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Yang, Yucheng; DOB: 05/27/2000; ID: 467395093\nPhDApplication inMechanical Engineering,Columbia University Yucheng Yang\nsensor development, I engaged as a RA in Prof. Yuan Yang's lab in the APAM department.\nCoincidentally, this was also a shelf-life extension project. Herein, I crafted Covalent-organic\nframework (COF)films to inhibitLi dendrite growthon Cu in Li+ batteries, thereby safeguarding\nagainst punctures and extending battery shelf-life. After a meticulous literature review, I chose\nCOF over MOF due to its lower conductivity, ensuring no diminution in cell efficiency due to\ncharge transferon COF film. I thencompared TAPB-PDA and Tp-TTA COF, both boasting high\nmechanical strength and suitable pore sizes, ultimately selecting TAPB-PDA for its simpler\nsynthesis. Through continuous adjustments in reaction time and concentration, I concluded that a\n0.7μm COF film significantly enhanced battery shelf-life. This project sharpened my skills in\nnanosynthesis, cell assembly, electrochemical workstations, and characterization techniques like\nAFM, SEM, FIB—all crucial for fabricating sensor electrodes and analyzing electrical signal\nchanges during sensor testing. It also inspired me on sensors shelf-life extension project with\nProf.Lin byintroducingadditional covalentbonding sites foraptamers throughCOF.\nThese experiences have ingrained in me a familiarity with mechanical engineering, a field\nseamlessly merges varied scientific and engineering ideas to troubleshoot practical challenges,\ndefining my sustained emphasis on the interdisciplinary domain of MOF/graphene and\nbiosensors, propelling me to devise BioMEMS for innovative clinical applications, and sparking\nmyenthusiasm to develop affordableyet efficientmedical productsforchallenging diseases.\nI’m intrigued by Columbia ME Doctoral program, especially the MEMS & Nanotech and\nthe Bioengineering & Biotech focus. The interdisciplinary approach combines nanomanufacture\nand biomedicaldevices enablesme to nanosynthesize MOFand graphene to innovate BioMEMS,\ntackling medical care problems. New York is the epicenter of the world, and Columbia stands as\nthe focal point within the vibrant metropolis, offering an inclusive and diverse culture, cutting-\n10/07/2024 09:54 Personal Statement 4/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Yang, Yucheng; DOB: 05/27/2000; ID: 467395093\nPhDApplication inMechanical Engineering,Columbia University Yucheng Yang\nedge research facilities, and unparalleled collaboration opportunities with industrial companies,\nthe advantages of which I have deeply appreciated in my master study. My goal within the\nprogram is to amplify my expertise, hone my skills, and engage in profound collaborations with\nhealthcare sectors, globally disseminating my research on highly efficient and enduring\nbiosensors for disease monitoring, advancing medical technology and positively impacting\npatients worldwide. Specifically, I am enthusiastic about developing unique fluorescence sensors\non glass and addressing the short shelf-life issue of TNF-a aptamer sensors with Prof. Lin during\nmy Ph.D. journey. Building upon improvements using ZIF-90 to covalently bind aptamers, my\ngoal is to modify TNF-a aptamer’s chemical structure to mitigate its auto-degradation.\nFurthermore, I plan to collaborate closely with Prof. Stojanovic to craft robust MOF and\ngraphene sensors for assorted drug assays. Additionally, I aspire to delve into electrochemical\nsensorswith Prof.Yang, investigatingalternative detectionmethods forbiomarkers.\nMy ultimate aspiration is to forge an academic career, autonomously pioneering on novel\nbiosensors for societal betterment. Although anticipated challenges loom, my robust foundation\nin chemistry, materials science, engineering, and data analytics thoroughly armors me to\nembrace them with open arms and overcome them with unwavering enthusiasm, diligence, and\nperseverance. Guided by our motto, 'In the light shall we see light,' my pursuit of knowledge's\nillumination will perpetually persist, aiming to shine light onpatient solutions through research. I\neagerlyanticipateabsorbing knowledge atCUandzealously applying it tofuture endeavors.\n10/07/2024 09:54 Personal Statement 5/5",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}