{
  "document_name": "Dai, Shengwei (493075143).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Dai, Shengwei; DOB: 09/08/1998; ID: 493075143\nPersonal Statement\nEver since I embarked on my academic journey, my passion for research and innovation within\nthe realm of construction materials has continued to flourish. As I start a new chapter in my\nacademic journey, I want to express my strong interest in the Ph.D. program in Civil Engineering\nat Columbia University and share the reasons that fuel my enthusiasm for this opportunity.\nMy journey in research of civil engineering began with an exploration of novel construction\nmaterials, a subject that has captivated my curiosity. During my previous academic experience, I\nfocused on understanding the complexities of low-carbon cement. This experience gave me a\nprofound appreciation for the significance of lowering carbon emissions in the construction\nindustry, a sector that is crucial to modern society. My involvement in this research allowed me\nto delve into the intricate world of construction materials and their environmental impact,\nthereby laying the foundation for my academic and research interests.\nAs a current Master's student in Chemical Engineering at Columbia University, I possess a\nstrong academic foundation in chemical engineering. This educational background equips me\nwith the interdisciplinary knowledge necessary to approach the study of innovative construction\nmaterials from a comprehensive standpoint. An illustrative example of this interdisciplinary\napproach lies in the quest to enhance the carbonation degree of cement for increased CO\n2\nabsorption. This challenge revolves around transport phenomena and reaction kinetics, domains\nrooted in chemical engineering principles. The seamless integration of these principles into\nconstruction materials research presents a unique opportunity to address pressing environmental\nissues and optimize material performance. This convergence of disciplines has ignited my\npassion for this field and reaffirmed my commitment to advancing it further.\nWhile pursuing my Master’s degree at Columbia University, I engaged in two significant\nresearch projects aimed at addressing environmental challenges. In my first project, which began\nin June 2023 and is ongoing, I delved into the area of carbon-neutral cement development. This\nresearch extended beyond traditional Portland cement, as I explored alternative cement systems,\nincluding magnesium oxide cement and fly ash-substituted ordinary Portland cement, with a\nprimary focus on carbonation curing. My investigations encompassed an intricate analysis of\nvarious parameters, such as mix design, and their influence on the physical properties and\ncarbonation degree of the cement. To gain a comprehensive understanding, I learned and\nemployed a range of mechanical testing machines to measure the physical properties of cement\nsamples. I also learned and employed thermogravimetric analysis to quantify their mineral\ncompositions. One of the most exciting outcomes of this project was the development of a mix\ndesign optimized for high CO uptake, which holds great potential for reducing the carbon\n2\nfootprint in construction materials.\nSimultaneously, I engaged in another research since May 2022, concentrating on the chemical\nstabilization of heavy metals within Waste-to-Energy (WTE) fly ash. The primary focus of this\nproject was to find sustainable disposal solutions for WTE fly ash, aiming to make it safe for\nlandfills or suitable for reuse in civil engineering applications. My work involved the exploration\nof the intricate reaction mechanisms associated with both inorganic stabilization and organic\nchelation to reduce the leaching of heavy metals. Through rigorous experiments, I uncovered the\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Dai, Shengwei; DOB: 09/08/1998; ID: 493075143\neffectiveness of various chemical agents in reducing heavy metal leachability, leading to the\nidentification of optimal agents. Moreover, I developed cost-effective combinations of agents\ndesigned to efficiently stabilize heavy metals within the fly ash. I am drafting a comprehensive\nmanuscript that encapsulates these findings, offering a transformative blueprint for sustainable\nwaste management practices. My knowledge on WTE fly ash has enabled me to make a valuable\ncontribution as the second author to a published review paper titled \"Environmental Standards\nand Beneficial Uses of Waste-to-Energy (WTE) Residues in Civil Engineering Applications.\"\nMy research experiences have broadened my comprehension of sustainable construction\nmaterials and deepened my commitment to the environment and the pursuit of sustainable\nengineering practices. These endeavors have illustrated the pressing demand for innovative\nsustainable solutions, thereby fortifying my determination to pursue a Ph.D. program that would\nempower me to make a meaningful impact.\nAs I contemplate my future academic journey, I am excited by the prospect of joining Columbia\nUniversity. The program's distinguished faculty, including Professor Kawashima, whom I have\nhad the privilege of interacting with, embodies the kind of mentorship and collaborative spirit\nthat I believe is essential for academic growth. Professor Kawashima's approachability and\nwillingness to support new ideas resonate with my own aspirations for academic exploration and\ninnovation.\nAdditionally, the extensive resources and facilities offered by Columbia University, coupled with\nits rich network of connections in both academia and industry, are particularly appealing. The\nCarleton Laboratory, with its state-of-the-art research space and testing equipment, represents an\nenvironment where I can realize my research ambitions. It is one of my dream places to work\nand contribute to cutting-edge research in construction materials.\nIn closing, my journey in research, my academic background in chemical engineering, and my\ncommitment to sustainable construction materials have prepared me to embark on a Ph.D.\nprogram that aligns with my aspirations. I am eager to further my education at Columbia\nUniversity and immerse myself in its vibrant academic community to explore novel frontiers in\nconstruction materials research, with a focus on carbon capture, utilization, and storage. I look\nforward to the challenges and opportunities for growth that this program offers and am excited to\ncontribute to the ongoing efforts to create a more sustainable future for the construction industry.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}