{
  "document_name": "Jiao, Yue (504448712).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Jiao, Yue; DOB: 05/26/1999; ID: 504448712\nPersonal Statement\nYue Jiao\nDuring my childhood, I experienced an assault that left me blind for several months.\nRemarkably, despite my pupils losing function, medical treatments gradually restored my vision\nto normal. During moments of fatigue over the years, I draw strength from the vivid memory of\nthat pivotal morning when I sensed faint light filtering through layers of gauze and dried blood.\nThese moments empower me to find hope after setbacks. This early trauma also ignited a profound\ncuriosity and fascination for the potential of medicine. As I matured, I recognized that this event\nwas not just a miracle but the result of the tireless efforts of countless scientists over many years.\nMy goal is to extend this \"miracle\" and offer hope to others, utilizing my skills and passions to\ncreate a positive impact. I firmly believe that my passion and determination will serve as enduring\nmotivators in this field. After years of studying biochemistry and engineering, I've come to\nunderstand the extensive research required to realize my aspirations. Hence, I am eager to advance\nmy education by pursuing a Ph.D. at Columbia University.\nMy academic journey at Columbia University and the University of California, Irvine, has\nprovided a robust foundation in chemical biology and computational chemistry. During my\nundergraduate years, as public concern regarding COVID-19 peaked, I felt compelled to delve\ndeeper into the subject. In the fall of 2021, I conducted intensive research on the 'Effects of the\nInhibitor Molnupiravir on Viral RNA Polymerase and the Regulation of RNA Synthesis Fidelity\nin SARS-COV-2'. To achieve this, I employed molecular dynamics simulations and modeling tools\nsuch as ATOM, Avogadro, Xquartz, and VMD to identify altered protein positions on the virus\nfollowing polymerase inhibitor attachment. I focused on Molnupiravir, a potential COVID-19 drug\nclassified as a polymerase inhibitor. This journey, particularly in the field of 3D molecular\ndynamic simulations and code functionalities, led me to uncover previously undiscovered\nstructural changes upon activation. Through partial charge calculations, I identified four mutated\nprotein positions. This discovery, combined with successful molecule simulations, significantly\nenhanced my programming skills for intricate data calculations and refined my analytical expertise\nin biochemical polymer simulations. This computational and modeling prowess is crucial for\nadvancing biomaterial and drug design simulations and tailoring materials to specific therapeutic\nrequirements.\nDuring my undergraduate studies, my research on covid polymerase inhibitors was primarily\ncomputer-oriented. I would like to gain a deeper understanding of the entire research process in\nthe wet lab. Therefore, at Columbia University, I became part of the COVID-19 Therapeutic\nDevelopment project under the guidance of Professor Jingyu Ju in his lab. I've been immersed in\nand focused on inhibiting SARS-CoV-2 exonuclease polymerase using ombitasvir which is\nanother strong potential antiviral drug for covid virus. Specifically, my role centered on doing\nchemistry synthesis of analogs of ombitasvir and testing their efficiency, with a keen emphasis on\nexploring exonuclease inhibitors. My responsibilities spanned from setting up enzymatic assays\nand purifying RNA to employing MALDI for analysis. A particularly enriching aspect of this\nexperience was my involvement in enzyme kinetic calculations, allowing me to discern the type\nof enzyme inhibition and pinpoint how to find the target insert position pivotal for drug stimulation.\nAdditionally, I broadened my expertise by venturing into organic chemical synthesis. This hands-\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Jiao, Yue; DOB: 05/26/1999; ID: 504448712\non experience underscored the intricate relationship between molecular biology, organic chemistry,\nand pharmacology. This period equipped me with expertise in chemical synthesis of drugs,\nbiological testing, and biomedical assay, positioning me well for tasks related to drug discovery\nand biomaterial design. Under Professor Jingyue Ju and the group’s guidance, I was engaged in\nthe pharmaceutical field, accelerating my pursuit of advanced biomaterials and medicine.\nUltimately, I believe that as a chemical engineer, it's essential to understand the entire journey\nof a product from its inception in the industry to its introduction to the market. I undertook an\ninvaluable internship at Mp. Biomedical is a prominent biomedical company in California. This\nexperience allowed me to work on a project dedicated to creating a next-generation sequencing\nkit. I deepened my understanding of PCR and qPCR techniques and analysis, adapting them to\nsuit the project's specific needs by crafting tailored experiments. Beyond the lab bench, I\nembraced the world of bioinformatics, utilizing the Bio-Star to decipher and analyze intricate\nsequence datasets. The fusion of hands-on experimentation and computational analysis enhanced\nmy understanding of biomedical research, offering deep insights into the journey of new\nmedicines from design to production for the market. To augment the analytical aspects of my\nresearch, I familiarized myself with computational tools like R and Python. These proficiencies\nenable me to do some data analytics, providing data-driven insights into material behavior,\nenhancing visualization, and facilitating efficient decision-making processes during the\nbiochemical polymer research process.\nGuided by the synergy of chemistry, biology, and engineering, my passion lies in therapeutic\ndevelopment and biomaterials. Biomaterials hold the potential to cure persistent illnesses and\nenhance biocompatibility, while drug development addresses both ongoing and immediate health\nchallenges. My ambition is to craft antiviral drugs targeting polymerase inhibitors and explore\nnanomedicine in biomaterials. I envision designing nano polymers infused with self-supplying\nantibiotics for targeted drug delivery and surface treatments, mitigating inflammation risks and\nadverse effects. By leveraging nanomedicine, we can revolutionize medical practices. With a\nbackground in chemical engineering, I appreciate the depth of innovation required, demanding\ninterdisciplinary expertise. My grasp of chemical synthesis facilitates polymer design, my\nunderstanding of biology ensures human relevance, and my engineering knowledge evaluates\nindustrial viability. As I look forward to deepening my collaboration with Professor Ju and remain\ninspired by Professor Oleg Gang's work, I'm positioned at this intersection of multiple disciplines,\nprepared to drive forward therapeutic breakthroughs and reshape healthcare innovations.\nTransitioning to my academic journey, Columbia University has been a major influence,\nguiding my studies and research interests. Through hands-on projects and invaluable mentorship\nfrom esteemed professors, I've experienced significant growth academically and gained clarity in\nmy research ambitions. Such deep-rooted experiences at Columbia have solidified my resolve to\nfurther my education with a Ph.D. here—a decision that transcends mere academic reasons, as this\ninstitution holds a unique significance to me. The advantage of working within a familiar research\ngroup minimizes the learning curve and negates the need for preliminary training. With\nunwavering dedication, I am eager to continue my research at Columbia, fostering collaborative\nrelationships with respected professors and research teams.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}