{
  "document_name": "Rawal, Bibhusa (534470689).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Rawal, Bibhusa; DOB: 08/08/1994; ID: 534470689\nBibhusa Rawal\nDepartment of Computer Science\nA desire to extend my knowledge and a curiosity to learn the significance of the inevitable arrival\nof quantum era is what motivated me to study Ph.D. in Computer Science with a focus in quantum\ncryptography.\nMore than 20years ago it was proven that quantum cryptography is unconditionally secure and\nquantum algorithms can solve classical problems for which we don’t have efficient classical\nalgorithms. In the present date, we are in the NISQ (Noisy intermediate scale quantum devices)\nera where quantum processors contain up to 1000 qubits which aren’t enough to make a quantum\nleap for being fault-tolerant or reached the stage of quantum supremacy. With the imminent arrival\nof quantum computing era, we must now begin to prepare our information security systems to be\nable to resist quantum computers. If quantum computers are built, they would pose a challenge to\nthe Church-Turing Thesis. The Church–Turing Thesis says that a computing problem can be\nsolved on any computer that we could hope to build, if and only if it is computable by Turing\nmachine. My research focus is post-quantum cryptography where I dream to develop\ncryptographic systems that are secure against both quantum and classical computers with the goal\nof keeping existing public key infrastructure intact in a near future quantum era.\nMathematics is so powerful with the perfect balance of patterns and structures in numbers. My\nenjoyment of the beauty of Mathematics is part of what motivates me toward innovation. It is also\na guide when I am working on a problem: if I think of a few strategies, I will choose the one that\nseems most elegant first.\nI was initially in Electrical and Computer Engineering Ph.D. program at University of Maryland,\nCollege Park. However, during COVID-19, I had to drop out of school because of personal\nreasons. During my time in UMD, I took different classes ranging from Random Process,\nInformation Theory, Estimation and Detection Theory, Systems Theory, Electromagnetic Theory,\nCompilers, Security, Machine Learning, Algorithms, Numerical Theory just in search of a course\nI find myself invested in and would like to spend the rest of my life working on. In my second\nyear, I took Quantum Information Processing class and that is when I became really interested in\ntheoretical areas of Quantum Information Science. Thereon, I’ve been interested in projects at the\nintersection of quantum computation, cryptography and Machine Learning.\nI earned my undergraduate degree in Electronics and Communication Engineering at Kathmandu\nEngineering College, Tribhuvan University. I was ranked first in B.E. in Electronics and\nCommunication program of Tribhuvan University. I was highest scorer as a female student among\nall engineering students across all universities in Nepal. I was a merit-based scholarship holder for\nall semesters in B.E. program of my college.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Rawal, Bibhusa; DOB: 08/08/1994; ID: 534470689\nBibhusa Rawal\nI was ranked first among all girl students in the Bachelor of Engineering Program – across all\nEngineering faculties - in Nepal and was conferred the “Nepal Chhatra Bidhya Padak (gold\nmedal)” by the President of Nepal, Mrs. Bidya Devi Bhandari on 37th National Education Day and\nInternational Literacy Day-2016.\nDuring my second year in the undergraduate program, I became member of Robotics club of the\ncollege with a focus to build a community of open-source users and developers. As a member of\nthis organization, I had the opportunity to assist my friends and mentor my juniors in their\nrespective academic projects. Throughout my undergraduate program, I organized and conducted\nvarious workshops, exhibitions, robotics competitions, quizzes, and seminars.\nIn the past, I’ve been an active member of Women in STEM Nepal which is a non-profit\norganization established to decrease the gender gap prevailing in STEM fields in Nepal. As its\nmember, I’ve volunteered my free time to run classes under the project named “Children go\ncoding” to expose and engage children of the age group 8-15 years to STEM education that\nincludes logic development, building programming concepts, building design thinking concepts,\nand building hardware concepts via Arduino. Currently, I hold tuition classes on Math, Physics\nand Chemistry to high school students on weekdays. I teach kids on weekends under the STEM\nprogram.\nColumbia University is my choice for continuing my graduate education because I feel that the\nUniversity can take a revolutionary step in the future of quantum computers, and I would be\nhonored if I could be a part of it. I am aware of the commitment and resilience necessary for\nresearch work, but I also believe that my motivation and aptitude is strongest in this field. I aspire\nto build a career in teaching and research. I am positive that Columbia University will help\nestablish a firm educational foundation needed to pursue this goal. My end target is to become a\nuniversity professor and a competent researcher. I am sure that the stimulating educational\nambiance and wisdom from distinguished teachers at Columbia University will help me grow\nimmensely as a person as well as a proficient researcher in my field.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}