{
  "document_name": "Anika, Adrita (544600210).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Anika, Adrita; DOB: 12/23/1997; ID: 544600210\nPersonal Statement\nProspective Ph.D. Student\nDepartment of Computer Science, Columbia University\nDr. Frederick Sanger famously stated, ”Scientific research is one of the most exciting and rewarding of\noccupations,” and those words have reverberated within me, igniting a powerful aspiration in my heart.\nStarting from modest origins in my home country, Bangladesh, I set out on a journey to the USA for my\nmaster’s degree, but that was only the beginning. As I delved deeper into my studies, my curiosity grew\nstronger, propelling me toward a loftier goal: a PhD. This evolution from an eager student to a resolute\nresearcher has been a deliberate journey, not a mere coincidence.\nFrom the outset, my commitment to academic pursuits has been unwavering. During my formative years,\nan affinity for mathematics and physics guided me towards the realm of engineering. This inclination led\nto my acceptance into both a reputable medical institution and a distinguished engineering university.\nThe importance of this accomplishment is amplified when seen through the perspective of my country’s\nlimited educational possibilities for young women, where pursuing a career in engineering remains an\nunusual decision. Undaunted by societal expectations, I embraced the challenge and became the first\nfemale engineer in my family.\nMy path commenced at Bangladesh University of Engineering and Technology (BUET), a place well-\nknown for its academic excellence, and laid the foundation for my research journey. I got involved in\nvarious projects and academic events during my time as an undergraduate, and that sparked my love for\nresearch. The recognition I got from publishing research papers on international platforms laid a solid\nfoundation for the research work I continue to do. This journey reflects my determination, supported by\na strong belief in the importance of education and research.\nTransitioning to the USA, the exposure to a diverse array of backgrounds significantly broadened my\nhorizons. My tenure at Texas A&M University introduced me to the Sketch Recognition Lab (SRL)\nunder the guidance of Dr. Tracy Hammond. This environment nurtured my academic growth and\nbecame the fertile ground for exploring my research interests. My focus gravitated toward projects\ninvolving eye tracking and educational technologies. Beyond their technical dimensions, I was captivated\nby the inherent humanitarian implications of these initiatives. This realization solidified my aspiration\nto apply my knowledge to effect tangible change in people’s lives. This sentiment was further reinforced\nby witnessing a lab mate, who is visually impaired, actively pursuing a Ph.D. to contribute to disability-\nfocused research.\nAsIsoughttodivedeeperintodifferentfieldsofcomputerscience,IexploredNaturalLanguageProcessing\n(NLP) under the direction of Dr. Ruihong Huang. This quest led me to work on a project on multi-\nevidence natural language inference for clinical trials. Moreover, I participated in Dr. James Caverlee’s\nInformationStorageandRetrieval(IR)coursetoextendmyknowledgeandworkedonaprojectthataims\ntoboostclinicaltrialeffectivenessbyimprovingpatient-trialmatching. Thesuccessfulcompletionofthese\ntwo projects encouraged me to explore the application of NLP and IR techniques in the clinical domain\nas my master’s thesis. My thesis has two primary objectives: firstly, to determine textual entailment or\ncontradictionofsomeclinicalhypothesiswithrespecttocorrespondingclinicaltrialreports, andsecondly,\ntoretrieveasetoffactualinformationfromthetrialreportsconducivetoeffectivereasoningoftherelation.\nAdrita Anika\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Anika, Adrita; DOB: 12/23/1997; ID: 544600210\nThepotentialimpactofthisresearchissignificant, asitaimstogreatlyenhancethecapabilitiesofhealth-\ncare professionals in aligning the latest evidence with personalized treatment approaches. To realize the\nambitious goal of effective evidence retrieval, I have undertaken an extensive analysis focused on the effec-\ntive integration of context considering the limitations of the maximum input number of tokens of SOTA\nlanguage models. I have submitted my findings from this study to one of the most prestigious AI confer-\nences, the AAAI Conference on Artificial Intelligence 2024. Furthermore, my efforts have encompassed\ntheinfusionofdiseaseknowledgeintolanguagemodels. Ihavealsoexploredtheapplicationofcontrastive\nlearningtechniquestodeviseanefficientmethodfornaturallanguageinference, particularlywhendealing\nwith lengthy and intricate clinical trial data. These combined endeavors represent a concerted effort to\nadvance the state-of-the-art in healthcare information processing and reasoning, with the ultimate aim of\nbenefiting both practitioners and patients in the medical domain.\nContinuing my commitment to skill improvement, I decided to dive into a comprehensive course on Data\nAnalytics and Visualization. Under the guidance of experienced mentors, Dr. John Keyser and Dr. Ann\nMcNamara, I undertook a project focused on the analysis of traffic collisions in the bustling city of New\nYork. The encouragement and support I received from the mentors motivated me to participate in the\nDisney Data and Analytics Conference 2022. It is with great pride that I share the accomplishment of\nwinning the Disney Data and Analytics Women Award for 2022. This milestone not only granted me\nfirsthand exposure to the transformative power of data analysis but also enhanced my practical expertise\nin the field of data science. To complement my academic pursuits, I set foot in the industry through\ninternships as a Machine Learning Engineer at Tenstorrent Inc. and as a Data Scientist at Amazon\nRobotics. These roles gave me the chance to apply the theoretical knowledge I had gained to real-world\nscenarios, thereby refining my technical skills and nurturing effective teamwork and communication abil-\nities. Concurrently, my role as a teaching assistant allowed me to further polish my project management,\nleadership, and teamwork skills.\nThroughout my transformative journey in the USA, which has encompassed diverse experiences ranging\nfrom intensive research projects, and demanding coursework to valuable internships, I can confidently\nassertthatthispathhasbeenanythingbutsmooth. Balancingteaching, research, andcourseworkamidst\nCOVID-19 disruptions and a change in major from bachelor’s to master’s degrees has taught patience,\nresilience, and adaptability. Notably, I had the privilege of undergoing the CliftonStrengths psychometric\nassessment from Texas A&M University, which illuminated my core strengths—maximizer, relator, and\nempathy. Fueled by these attributes, I am steadfastly dedicated to achieving both personal and collective\nexcellence, as I diligently prepare for the forthcoming Ph.D. journey that lies ahead.\nAs I contemplate the next stage of my academic journey, my attention is firmly fixed on Columbia Uni-\nversity, an institution of great renown distinguished by its size, reputation, and commitment to academic\nexcellence. With a profound research interest in harnessing the powers of machine learning, natural lan-\nguage processing, and information retrieval to drive transformative change, I see Columbia University as\nthe ideal stage for nurturing my aspirations. I am particularly captivated by the opportunity to engage\nin collaborative research within Dr. Noémie Elhadad’s lab. Their research resides at the intersection\nof machine learning, natural language processing, and medicine, aligning seamlessly with my prior MSc.\nresearch experience. My passion lies in developing techniques that empower clinicians, patients, and\nhealth researchers to streamline their information workflows and derive invaluable insights from clinical\ndata. Dr. Elhadad’s research, focused on supporting clinical decision-making, truly intrigues me. In\naddition, I am keenly interested in the research of Dr. Elias Bareinboim, whose expertise centers on\ncausal inference and its applications in the biomedical domain. His recent work on fairness analysis in\nthe context of causal inference greatly motivates me and closely aligns with my own research interests.\nFurthermore, I find Dr. Zhou Yu’s research particularly compelling. Her work delves into the intersection\nof natural language processing with real-world applications, which greatly piques my interest. Several\nAdrita Anika\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Anika, Adrita; DOB: 12/23/1997; ID: 544600210\nof her research endeavors resonate with my research interests, experience, and expertise. This potential\ncollaboration promises a robust platform for exploring and unraveling intricate patterns within extensive\ndatasets, shedding light on complex interconnections.\nIn summary, my journey—from Bangladesh to the USA—has shaped an individual characterized by\nunwavering dedication, a passion for research, and adeptness in navigating challenges. I have become\nmore resilient as a result of experiencing hardship and learning. The epitome of academic greatness is\nColumbia University, where I want to continue my journey, expand my knowledge, and genuinely leave\nmy imprint via my contributions to research.\nAdrita Anika\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}