{
  "document_name": "Palaskar, Rutwik (600922991).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Palaskar, Rutwik; DOB: 10/12/1999; ID: 600922991\nSTATEMENT OF PURPOSE\nWhile pursuing my master’s degree in Biomedical Engineering (BME) at Duke University, I had\nthe privilege of exploring a range of research domains in Machine Learning (ML) such as Digital\nImage Processing, Generative Modeling, Robustness and Bias in Artificial Intelligence (AI) and\nSignal Processing. Based on this experience, an intersection of biomedical signal processing and\nmultimodal machine learning has emerged as a focal point for my PhD aspirations.\nML research in BME has predominantly focused on unimodal learning tasks, usually using one\ntype of modality (biomedical images, medical records, wearable sensor data, etc.) but real-world\nbiomedical data is often a combination of multiple modalities in conjunction with abstract con-\ncepts (disease progression, treatment response, patient outcomes, etc.). Human learning is usually\nmultimodal involving interpretation of complex entity relationships and interdependencies between\nvariables and concepts from different modalities. To make machine learning models capable of such\ninference, we need to capture these complex interdependencies with multimodal learning into one\nmodel. With that in mind, I am interested in focusing my Ph.D. research on developing machine\nlearning models for such multimodal learning with special emphasis on biomedical applications.\nDuring my first semester, I got captivated by the role of generative models in drug discovery, leading\nto my research project on “Reinforcement Learning for Generation of Novel Non-toxic Molecules”\nunder the guidance of Prof. Daniel Reker. I used a generative model trained with the Chembl\ndataset and compared classifiers (Random Forest, SVM, MLP) on the Tox21 dataset, optimizing\nthe network for non-toxic structure generation. SVM, with the highest recall, was integrated into\na reinforcement learning pipeline, resulting in a bias towards non-toxic molecules in the generated\ncompounds. This research project kindled my interest in generative modeling.\nRobustness in AI, is a new paradigm in machine learning that aims to develop AI systems that\nare resilient to noise, uncertainty, and unexpected changes in their environment. I was introduced\nto this concept while working on a research project to build ML models using microscopic image\ndata that had spherical aberrations, which often hampers the precision of segmentation tasks under\nProf. Roarke Horstmeyer. As a team, we developed a solution that involved integrating a\ntrainable physical layer into the UNET network architecture. We evaluated three different versions\nof this solution and found that employing Zernike polynomials for correction demonstrated superior\nsegmentation accuracy. It would be highly advantageous for healthcare AI models to possess the\ncapability to autonomously correct themselves and maintain consistent, reliable performance, even\nwhen confronted with inherently aberrant or inconsistent datasets.\nFairness and Bias in AI, especially in healthcare, is of paramount importance. I explored bias in\nclinical prediction models to study the effect of race on model performance under Prof. Jessilyn\nDunn. I evaluated the predictive capabilities of machine learning algorithms for 30-day hospital\nreadmission after hip fracture repair surgery, specifically examining potential performance dispari-\nties by race. I employed random forest with lasso regression for this work. However, underrepresen-\ntation of minority classes in the existing datasets underscores the need for more diverse healthcare\ndatasets for future research, a fact that I would like to be mindful of in my future research activities.\nI have been fortunate to be involved as a Research Assistant (RA) in two of Duke’s Biomedical\nEngineering laboratories. My experience as an RA in the Computational Optics Lab under Prof.\n1\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Palaskar, Rutwik; DOB: 10/12/1999; ID: 600922991\nRoarke Horstmeyer has reinforced my interest to pursue further research in the vision and image\nprocessing domain for my PhD. I gained hands-on experience in cell image data acquisition, pro-\ncessing, and annotation. I acquired and processed this data using a microscopic system at various\nmagnifications, and developed code to annotate cells in low-magnification images and transfer an-\nnotations to higher-magnification counterparts. My work to transfer annotations between images of\ndifferent resolutions could be used to develop new methods for multimodal learning that can handle\ndata from different modalities with different resolutions.\nSince last summer, I have been actively working as an RA on building ML models using temporal\nbiomedical signals for assessing Traumatic Brain Injuries (TBI) in mice models. This work is being\ndone at Duke’s Applied Machine Learning Lab under the guidance of Prof. Leslie Collins, Prof.\nBoyla Mainsah, and Dr. Bradley Kolls. Our research introduced an automated approach for\nfeature extraction from EEG data. We developed a convolutional autoencoder to condense EEG\nsignals, preserving vital information while reducing dimensionality. These encoded features were\nthen used in clustering and topic modeling techniques, including Latent Dirichlet Allocation (LDA),\ntorevealhiddenpatternsinTBIdata. Thismethodologystreamlinesanalysisanduncoverscomplex\nrelationships, offering valuable insights for TBI research and assessment. We are further exploring\nmodern clustering methods like BertTopic to investigate TBI severity and recovery patterns in mice\nmodels. This work aims to develop machine learning tools that can be used to improve the diagnosis\nand prognosis of TBI, and to identify new therapeutic targets.\nDuring my undergraduate years, I have been fortunate to get an opportunity to do research under\nthe guidance of many eminent researchers from University of Pennsylvania, Stony Brook University\nand MIT-ADT University Pune. One project that stands out is a project on transfer learning for\noral cancer detection, a collaboration with Stony Brook University and a dental hospital1. With real\npatient data, I worked to use pre-trained image classification models (InceptionNet, MobileNet and\nResNet) and applied transfer learning strategies to oral cancer data, achieving a 10-15% accuracy\nimprovement. We summarized this work as a research paper uploaded on arXiv, and I was very\ndelighted to learn that my first paper has been cited by various research groups several times.\nIhavealsobeenaTeaching AssistantfortwocourseswhileatDukeandIhavethoroughlyenjoyed\nmy teaching experience. Each experience thus far has proven to be a great source of motivation\nleading me to decide to pursue a career in academic research. I strongly believe academia is one of\nthe most impactful careers that provides an avenue to drive research and push the boundaries of\nknowledge. I would like to continue in academic research after my PhD.\nTo embark upon an academic research career path, Ph.D. at Columbia University is undoubtedly\nthe appropriate next step for me. Columbia is one of the esteemed research institutions in the world\nwhere Biomedical AI research is already underway. I want to be part of such research efforts that\nwill certainly define the course of tomorrow’s AI research in healthcare going forward. I would be\nhonored to have an opportunity to do research work under the guidance of Prof. Elham Azizi,\nProf. Andrew Laine, Prof. Nima Mesgarani, Prof. Kaveri Thakoor, and Prof. Sanja\nVickovic, as their work is highly synergistic to my PhD research interests as outlined above. I am\nconfident that with my relevant research experience, intellectual curiosity and team spirit, I will be\nable to contribute effectively to Biomedical AI research and my research group.\n1https://arxiv.org/abs/2011.11610\n2\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}