{
  "document_name": "Adediran, Adedeji (670921615).pdf",
  "total_pages": 6,
  "pages": [
    {
      "page_number": 1,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPERSONAL STATEMENT | ADEDEJI S ADEDIRAN\nPERSONAL STATEMENT\nAdedeji Adediran's aspiration to embark on a journey towards a combined M.S./Ph.D.\nprogram in Computer Science at Columbia University is deeply rooted in his unwavering\nardor for technology and his unshakable belief in the transformative potential of education\nand research. His upbringing in a remote region of Nigeria, where opportunities for\nadvancement were limited, instilled in him vital qualities such as resilience, adaptability, and\nresourcefulness, all of which are pivotal for success in this demanding program. These\nattributes have empowered him to surmount obstacles and devise innovative solutions, a\ntestament to his innate ingenuity.\nAdedeji's personal odyssey has cultivated his unwavering determination to harness\ncomputer science as a catalyst for global progress. His formative years exposed him to the\npotential of technology as a driver of positive change. Motivated by futuristic portrayals of\nadvanced technology in cinema, Adedeji recognizes the immense possibilities that computer\nscience holds for driving societal transformation. This inspiration fueled his unwavering\ncommitment to pursuing a career in the field.\nA pivotal turning point in Adedeji's educational journey occurred when he enrolled in\nthe computer science program with an economics focus at Obafemi Awolowo University\n(OAU). At OAU, he was granted the opportunity to delve into the practical applications of\nartificial intelligence, particularly evident in courses like \"Introduction to Artificial\nIntelligence.\" One particularly notable class project involved the modeling of ant movement\nusing Python, offering invaluable insights into replicating natural mechanisms through\nprogramming. This experience further ignited Adedeji's inspiration as he realized the\npotential for similar principles to be employed in developing innovative solutions, such as\nsensor-driven robotic vacuums. Adedeji's ability to bridge the gap between theoretical\nPERSONAL STATEMENT ADEDEJI S ADEDIRAN\n10/07/2024 09:54 Personal Statement 1/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPERSONAL STATEMENT | ADEDEJI S ADEDIRAN\nknowledge and practical application underscores his aptitude for connecting research with\nproblem-solving.\nThroughout this program, Adedeji's central focus will be on the captivating realm of\nartificial intelligence as it intersects with advanced statistical methodologies, holding\nimmense promise for addressing multifaceted challenges, reshaping industries, and fostering\ninnovation. Post-program, Adedeji's primary mission will be to advance the field through\nacademic instruction and cutting-edge research. With fervent enthusiasm, he anticipates\nactively contributing to ongoing research initiatives, engaging in advanced coursework, and\nharnessing Columbia's state-of-the-art research infrastructure and collaborative milieu to\ndeepen his mastery of these transformative disciplines. His aspirations encompass unraveling\nthe intricacies of deep learning, perception, and manipulation, while innovating novel\nstatistical algorithms within the sphere of artificial intelligence.\nAdedeji envisions spearheading foundational research in artificial intelligence with a\nspecific emphasis on the core facets of social interaction within AI systems, including\nperception and manipulation. Recent studies by Li et al. (2022) and Ma and Xiao (2023)\nunderscore the evolving landscape of social interactions, extending from human-human\ninteractions to human-robot interactions. While the latter falls under the domain of artificial\nintelligence, the central challenge extends beyond imparting speech to robots – it lies in\nfostering a profound understanding of meanings and the intricate nuances of our real-world\nmilieu (Bamdale et al., 2019). Andronie et al. (2022) affirm that robots leverage perception\ntechnologies, deep learning frameworks, and integrated sensory data to engage in social\ninteractions. Additionally, Huang et al. (2022) emphasize the significance of training robots\nusing extensive datasets to formulate adaptable algorithms for effective human-robot\ninteractions.\nPERSONAL STATEMENT ADEDEJI S ADEDIRAN\n10/07/2024 09:54 Personal Statement 2/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPERSONAL STATEMENT | ADEDEJI S ADEDIRAN\nIn addressing the variance in perception and manipulation that influences social\ninteractions among robots, the recommendations set forth by Li et al. (2022) and Shah et al.\n(2022) illuminate the path for future exploration in human-robot interaction. Adedeji\nenvisions collaborating with diverse cohorts at Columbia to scrutinize these variations.\nDrawing upon the insights of Łukasik et al. (2021), he aspires to forge or collaborate with\ninterdisciplinary research collectives to undertake comprehensive studies on human-robot\ninteractions. Backed by a profound comprehension of big data technologies, fundamental\nprinciples of computer science, and advanced statistical methodologies, Adedeji is resolute in\nhis capacity to lead teams and catalyze transformative initiatives within the realm of social\ninteractions within artificial intelligence.\nFurthermore, Adedeji acknowledges the power of diverse perspectives in driving\ninnovation and fostering a just community. He is acutely aware of the underrepresentation of\nmarginalized groups within the tech sphere and often assumes the role of the sole African-\nAmerican contributor, infusing teams with a much-needed diverse viewpoint. Adedeji\npassionately asserts that Columbia's comprehensive approach and concerted efforts to\nenhance diversity within its academic ranks are instrumental in shaping a technologically\nadvanced world that is socially conscientious. In addition, he champions the development of\nAI solutions that prioritize inclusivity.\nCurrently, Adedeji occupies a prominent role at Visa, where he voluntarily serves as a\nDiversity, Equity, and Inclusion pillar lead. Since joining the company, he has actively\ncollaborated with senior leadership to establish processes and procedures that promote a more\ninclusive work environment. One notable initiative involved working with multiple\nstakeholders to create a bi-annual training module aimed at raising awareness among Visa\nemployees about the importance of inclusion in the hiring process. The implementation of\nthis module has resulted in substantial changes in Visa's hiring practices, with employee\nPERSONAL STATEMENT ADEDEJI S ADEDIRAN\n10/07/2024 09:54 Personal Statement 3/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPERSONAL STATEMENT | ADEDEJI S ADEDIRAN\nengagement surveys indicating increased awareness among Visa employees regarding\npotential biases during the hiring process.\nAdedeji's alignment with Columbia University's values and objectives, emphasizing\nacademic excellence and intellectual inquiry, positions him to contribute significantly to\ncomputer science research. His belief in the transformative potential of artificial intelligence\naligns with Columbia's mission to bridge societal divides. Adedeji is eager to leverage the\nuniversity's innovative environment, dedication to public service, and extensive resources to\ndevelop AI solutions with a global impact, fostering positive changes in local and global\ncommunities.\nIn essence, Adedeji Adediran's pursuit of a combined M.S./Ph.D. in Computer\nScience at Columbia University signifies the convergence of personal passion, educational\ngrowth, and professional experience, all driven by a vision to leverage technology for societal\nimprovement. His dedication to AI research aims to enrich Columbia's intellectual\ncommunity and develop globally impactful solutions. Adedeji's choice is propelled by his\nprofound passion for technology, commitment to global betterment, and unwavering\ndedication to diversity, inclusion, and social responsibility, aligning seamlessly with\nColumbia's values.\nPERSONAL STATEMENT ADEDEJI S ADEDIRAN\n10/07/2024 09:54 Personal Statement 4/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPERSONAL STATEMENT | ADEDEJI S ADEDIRAN\nREFERENCES\nAndronie, M., Lăzăroiu, G., Karabolevski, O., Ștefănescu, R., Hurloiu, I., Dijmărescu, A., &\nDijmărescu, I. (2022). Remote Big Data Management Tools, Sensing and Computing\nTechnologies, and Visual Perception and Environment Mapping Algorithms in the\nInternet of Robotic Things. Electronics, 12(22), 22. https://doi-org.lopes.idm.oclc.org/\n10.3390/electronics12010022\nBamdale, R., Sahay, S., & Khandekar, V. (2019). Natural Human Robot Interaction Using\nArtificial Intelligence: A Survey. In 2019 9th Annual Information Technology,\nElectromechanical Engineering and Microelectronics Conference (IEMECON), 297-\n302. Jaipur, India. doi:10.1109/IEMECONX.2019.8877044.\nHuang, J., Shen, S., Zhou, Z., Zhang, P., & Fan, K. (2022). Discriminative distribution\nalignment for domain adaptive object detection. Neurocomputing, 474, 48–59. https://\ndoi-org.lopes.idm.oclc.org/10.1016/j.neucom.2021.12.009\nKrishna, S., & Sidharth, S. (2022). Analyzing Employee Attrition Using Machine Learning:\nThe New AI Approach. In Proceedings of the 2022 IEEE 7th International\nConference for Convergence in Technology (I2CT), 1-14.\ndoi:10.1109/I2CT54291.2022.9825342.\nLi, Z., Terfurth, L., Woller, J. P., & Wiese, E. (2022). Mind the Machines: Applying Implicit\nMeasures of Mind Perception to Social Robotics. 2022 17th ACM/IEEE International\nConference on Human-Robot Interaction (HRI), Human-Robot Interaction (HRI),\n2022 17th ACM/IEEE International Conference On, 236–245. https://doi-\norg.lopes.idm.oclc.org/10.1109/HRI53351.2022.9889356\nŁukasik, S., Tobis, S., Suwalska, J., Łojko, D., Napierała, M., Proch, M., Neumann-\nPodczaska, A., & Suwalska, A. (2021). The Role of Socially Assistive Robots in the\nCare of Older People: To Assist in Cognitive Training, to Remind or to Accompany?\nPERSONAL STATEMENT ADEDEJI S ADEDIRAN\n10/07/2024 09:54 Personal Statement 5/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 6,
      "content": "Adediran, Adedeji; DOB: 11/08/1990; ID: 670921615\nPERSONAL STATEMENT | ADEDEJI S ADEDIRAN\nSustainability, 13(10394), 10394.\nhttps://doi-org.lopes.idm.oclc.org/10.3390/su131810394\nMa, Z., & Xiao, J. (2023). Robotic Perception-Motion Synergy for Novel Rope Wrapping\nTasks. IEEE Robotics and Automation Letters, Robotics and Automation Letters,\nIEEE, IEEE Robot. Autom. Lett, 8(7), 4131–4138.\nhttps://doi-org.lopes.idm.oclc.org/10.1109/LRA.2023.3280808\nShah, D., Sridhar, A.K., Bhorkar, A., Hirose, N., & Levine, S. (2022). GNM: A General\nNavigation Model to Drive Any Robot. 2023 IEEE International Conference on\nRobotics and Automation (ICRA), 7226-7233.\nPERSONAL STATEMENT ADEDEJI S ADEDIRAN\n10/07/2024 09:54 Personal Statement 6/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}