{
  "document_name": "Francoeur, Jacynthe (695983193).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Francoeur, Jacynthe; DOB: 06/16/1998; ID: 695983193\nJacynthe Francoeur Biomedical Engineering Department\n971 rue Galilée Columbia University\nBeloeil, Qc, Canada, J3G 6M1 Graduate School of Arts and Sciences\njfcoeur@hotmail.com 500 W. 120th St\n+1 450-341-4112 New York, NY, USA, 10027\nOctober 15th, 2023\nDear Admissions Committee,\nI am keenly interested in joining the Biomedical Engineering Ph.D. program at your respected\ninstitution. My combined interests in mechanical and biomedical engineering align well with the\nresearch conducted by some of your faculties, such as Professor Sunil K. Agrawal, who trains\nrobots to aid humans in regaining or improving functional movements. Given my academic and\nresearch background, I am eager to pursue a Ph.D. that prioritizes in-depth study and creative\nproblem-solving. I am particularly excited about the chance to contribute to the field of robotics\nfor biomedical purposes at your distinguished institution. The blend of cutting-edge research,\nrespected faculty, and vibrant academic community there provides an ideal environment for\nachieving academic and research excellence.\nEver since I was young, I've been fascinated by biology, mathematics, and physics. This led me to\nthe field of biomedical engineering, which beautifully combines these subjects, ensuring ongoing\nlearning and innovative work. Biomedical engineering is ever-changing, keeping things fresh and\noffering the rewarding potential of enhancing people's health. I've grown to love both prototyping\nand software development because of the field's interdisciplinary nature.\nMy academic journey has been driven by a strong enthusiasm for interdisciplinary research. The\nfocus of my current master’s degree has been on fiber optic sensors used in minimally invasive\nprocedures, especially for diagnosing and treating occlusive arterial disease and prostate cancer.\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Francoeur, Jacynthe; DOB: 06/16/1998; ID: 695983193\nJacynthe Francoeur\nUnder the supervision of Professors Samuel Kadoury and Raman Kashyap, I designed a fiber optic\nsensor with the aim of integrating it into medical tools and robotic systems for multimodal sensing,\nlike flexible needles and catheters. This work highlights my expertise in fiber optics and various\ndetection methods, while also drawing connections between my research interests and the work of\nProf. Sunil K. Agrawal, for instance.\nI'm driven by a profound passion for research, motivating me to pursue a Ph.D. in your program\nwith an emphasis on medical robotics. This degree is not just another qualification for me; it\nrepresents a foundational step in my career. Undertaking it will not only deepen my expertise in\nthe field but also expand my career prospects in both academia and the industry, perfectly aligning\nwith my long-term aspirations. While I cherish my Canadian roots, the unparalleled academic and\nresearch opportunities in the U.S. make relocating a compelling choice. The U.S. is particularly\nappealing because of its robust support for biomedical research, fostering a vibrant atmosphere for\ninnovation. I am particularly attracted to industry roles in biomedical engineering due to their\nstructured environments, allowing me to concentrate on research and innovation without the\nadministrative burdens often found in academia. Ultimately, earning a Ph.D. from a prestigious\ninstitution like yours would set the stage for a rewarding career that balances professional\nachievements with personal well-being.\nDuring my academic journey, I've been lucky to win many scholarships. Some notable ones came\nfrom the Natural Sciences and Engineering Research Council of Canada (NSERC) and Fonds de\nrecherche du Québec Nature et technologies (FRQNT). Among these, the Fayolle Canada United\nStates’ Prestige scholarship really stands out. Only two students from Polytechnique Montreal get\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Francoeur, Jacynthe; DOB: 06/16/1998; ID: 695983193\nJacynthe Francoeur\nthis each year. With this scholarship, I got to do a five-month internship at Johns Hopkins\nUniversity. There, I worked closely with Prof. Iulian Iordachita at the Laboratory for\nComputational Sensing and Robotics (LCSR). We created a special needle with fiber Bragg\ngrating strain sensors for certain prostate procedures. We then shared our findings in a paper for\nthe International Conference on Robotics and Automation (ICRA) in 2024.\nFurthermore, one of the standout moments in my academic journey was my participation on a\nproject closely tied to my master's research with Boston Scientific. This collaboration led to several\nachievements: a presentation at the Optical Sensors and Sensing Congress 2022, a poster at COPL\n2022 Annual Day, and a special edition publication in Optics Express in 2023. This project and\nthe related articles show both my success and my strong commitment to making advances in\nbiomedical engineering. Together, my work with Boston Scientific and Johns Hopkins University\nhas made me excited to pursue further studies as a Ph.D. student in medical robotics in the United\nStates.\nDuring my undergraduate years, I was deeply involved in numerous research projects, supported\nby scholarships that enabled me to intern at various labs at Polytechnique Montreal. Here, I delved\ninto diverse topics such as data science, ultrasonic imaging, nanoparticles, and lasers. A highlight\nof my experiences was designing a robot for scoliosis correction, which not only solidified my\ninterest in robotics but also equipped me with invaluable hands-on knowledge. Moreover, as part\nof my academic endeavors, I developed tools integral to robotics and other fields. These included\na pulse oximeter, motion sensor, heartbeat monitoring system, and a visual testing station for\nmouse vision. Another standout project was one I contributed to for a 3rd year engineering physics\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Francoeur, Jacynthe; DOB: 06/16/1998; ID: 695983193\nJacynthe Francoeur\ncourse. These multifaceted experiences underscore my adaptability, versatility, and potent\nproblem-solving capabilities, laying a robust groundwork for advanced research in the future.\nTo sum up, my broad academic background and dedication to varied research, combined with my\nlove for hands-on tasks like prototyping and software development, make me a good fit for your\nPh.D. program. I am particularly inspired by the potential applications of robotics in improving\nthe diagnosis and treatment of diseases. I'm truly grateful for the chance to apply and am excited\nabout possibly joining your academic community. I feel that your program's supportive\nenvironment will help grow my research interests. My goal is to use my skills and passion to\nimprove healthcare technology and create better health results.\nThank you for considering my application.\nSincerely,\nJacynthe Francoeur\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}