{
  "document_name": "Pradhan, Piyush (703824610).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Pradhan, Piyush; DOB: 09/02/2000; ID: 703824610\nStatementofPurpose\nMy introduction to Fluid Mechanics and Computational Fluid Dynamics (CFD) happened during my\nsophomore year when I enrolled in the Fluid Mechanics course. I vividly recall a defining moment\nwhen the professor showcased a brief video highlighting his recent research. The video featured a\nmesmerizing visualization of flow patterns around a circular cylinder. Witnessing the intricate flow\ndynamics surrounding what appeared to be a simplegeometricshapeleftaprofoundimpressionon\nme. It was this moment that ignited my interest to delve deeper into the world of CFD. I consider\nmyself fortunatetohavestudiedatoneofIndia'spremierinstitutions,withanacceptancerateofless\nthan 2%. This esteemed academic environment provided me with unparalleled opportunities to\ncollaborate with highly knowledgeable and experienced professors. I wholeheartedly embraced\nthese opportunities to expand my horizons and deepen my understanding of fluid dynamics and\ncomputationalsimulations.\nIn the subsequent summer vacation, I worked as an intern at DHIO Research and Engineering,\nIndia, where I was introduced to the different aspects of the CFD simulation: geometry creation,\nmeshing, setting up the solver, applying boundary conditions, and interpreting the results. I learned\nabout meshing and the importance of using a good mesh. Furthermore, I learned how to perform\nmesh independence study and validation study, an essential precursor to any research work. Most\nnotably, I learned how tounderstandandinterprettheflowdatageneratedfromthesimulations.The\nfinal project of the internship was to simulate a cyclonic separator and predict its separation\nefficiency using ANSYS Fluent. TheprojectwasundoubtedlyagatewayformeintothefieldofCFD,\nanddespitehavingsuchasteeplearningcurve,Ilearnedmanythingsduringtheproject.\nAs I found my sophomore year internship on numerical simulations interesting, I took a Numerical\nTechniques course in my junior year, instructed by Dr. Pritanshu Ranjan. Here I learned about the\ninner workings of CFD solvers. The course taught me how numerical simulations aredone,starting\nfrom the governing equations, converting them to linear systems of equations, applying boundary\nconditions, and solving them using iterative methods such as Gauss-Seidel, TDMA, and the use of\nunder-relaxing and over-relaxing factors along with other concepts. The first half of the course\nfocused more on Finite Difference Method (FDM) and its limitations while the next half focused on\nthe numerical solution of the Navier-Stokes equation using Finite Volume Method (FVM) and its\nimplementation using staggered gridsanditerativealgorithmssuchasSIMPLE,PISO,andPIMPLE.\nAs a part of the curriculum, I implemented some of these techniques in MATLAB codes to model\nwell-knownproblems,suchasLidDrivenCavityandPoiseuilleFlow.\nHaving developed abetterunderstandingoffluidmechanics,Iwishedtoexploreitsuseinreal-world\nproblems. Prof. Kiran Ramesh at the University of Glasgow guided me in my junior year summer\ninternship project to study the flow physicsofanairfoil-basedturbinetoextractenergyfromtides.In\nthis project, I used a Discrete Vortex Method (DVM) based in-house solver written in Julia to\nsimulate the performance of the turbine. The project was very insightful as I learned about the\nstate-of-the-art research in tidal energy extraction. I also learned about DVM, a method where\nindividual vortex elements are used for simulation in contrast to a full-fledged simulationcarriedout\nin CFD. The project also introduced me to aeroelastic modeling and fluid-structure interaction (FSI)\nandsubsequently,manyofmyresearchprojectsexploredthisarea.\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Pradhan, Piyush; DOB: 09/02/2000; ID: 703824610\nIn my junior year, I took a design-oriented project course offered by our university, under the\nguidance of Dr. Vaibhav Joshi. Dr. Joshi hadexperienceinFSImodeling,andIworkedunderhimto\nunderstand FSI modeling using Finite Element Method (FEM). I used FEM to solve the\nNavier-Stokes equation, the structural equation, and the mesh movement equation. The governing\nequations were solved in the moving mesh Arbitrary Lagrangian Eulerian (ALE) framework. I\ndeveloped the MATLAB code for 2D two-way coupled problems and used it to study anaeroelastic\nairfoil. I also worked under the guidance of Prof. Pritanshu Ranjan, to study passive flow control\ntechniques for drag reduction using OpenFOAM. I was inspired to study this topic after learning\nabout the use of dimples in golfballs.Throughthisproject,Idiscoveredthatthroughoptimalplacing\nof dimples on the exterior of geometry, flow separations can be prevented, which significantly\nreduces the drag. In the subsequent semester, I also had the opportunity to work under the\nsupervision of Prof. Sridhar Ravi, at the UniversityofNewSouthWales,Australiatoexploretheuse\nof Dynamic Mode Decomposition (DMD), whichisadimensionalityreductiontechnique.Ideveloped\ncodeinJuliatoperformDMDontheflowdataextractedfromthein-houseCFDsolver.\nMy collaboration with Dr. Joshi also served as my introduction to the realm of biomimetics. One\naspect that particularly piqued my interest and kindled my desire for further exploration was the\nstudy of fluid mechanics in collective motion among variousspecies,includingthecoordinatedflight\nof bird flocks and the synchronized swimming of fish schools. What intrigued me about these\nphenomena was their evolutionary development over millions of years, resulting in highly efficient\nand specialized modes of movement. Hence in my undergraduate thesis at Chalmers University of\nTechnology, Sweden, I explored the fluid dynamics of triple synchronous flapping foils under the\nguidance of Dr. Yao. This was a challenging topic for me because I soon realized that the mesh\nmovements I had used earlier were notfeasibleduetoexcessivemeshdeformation.Toremedythis\nproblem, I used the Overset (Chimera) mesh technique, where the mesh attached to the structure\nmoves independently of the background mesh, and the flow variables are interpolated between\ndifferent meshes. UsingOversetmeshesandOpenFOAMIstudiedtheproblem,varyingthespacing\nbetween the airfoils. I identified the primary thrust generation mechanism, which was due to the\nformation of a Leading Edge Vortex (LEV) which generated favorable pressure gradients. For\nmulti-foil systems, I also studied the vortexinteractionsbetweentheupstreamanddownstreamfoils\nandclassifiedthemaccordingtotheefficiencyandthrusttheygenerated.\nAt Columbia University, I always wanted to combine myknowledgeoffluidmechanicswithrobotics,\nparticularly with its applications in underwater robotics. Therefore, as a first step, I developed a\nbipedal walking robot, completely from scratch, starting with a concept sketch, initial and detailed\nCAD design, electronics, and even programming. I uploaded the journey video to YouTube as well\n(link). Due to the highly interdisciplinary nature of robotics, I also had the opportunity to learn more\nabout MachineLearning,ReinforcementLearning,andGPUcomputing,whichIcontinuedtoexplore\ninthefuture.\nMy interest in GPU computing and itsapplicationstoCFDledmetopursuesummerresearchunder\nthe guidance of Dr. Shaina Kelly at Columbia University where I developed JLBM.jl, a\nhigh-performance, GPU-accelerated software to model flows written in the Julia programming\nlanguage. The software utilizes the Lattice Boltzmann Method (LBM), which is a method of\nComputational Fluid Dynamics where the Boltzmann equation is solved instead of Navier Stokes\nequation. The software harnessed the massive parallelization capabilities of the GPU through the\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Pradhan, Piyush; DOB: 09/02/2000; ID: 703824610\nCUDA library and achieved 90% memory utilization. I am also currently working on publishing my\nwork with Dr. Kelly. In the final semester of my Master’s program, I will continue toworkonJLBM.jl\nandapplyittomodelporousmediaflows.\nMy passion for teaching and research has driven me to actively pursuerolesasaCourseAssistant\n(CA). DuringmysecondsemesteratColumbiaUniversity,IhadtheprivilegeofservingastheCAfor\nthe Robotic Studio course, under the instruction of ProfessorHodLipson.Thiscourse,knownforits\ninclusivity in accommodating students with diverse backgrounds, presented me with the valuable\nopportunity to assist students across various aspects of their robots, ranging from CAD design to\nelectronics and programming. An important skill I cultivated during this experiencewastheabilityto\ndistillcomplexconceptsintoconciseexplanations.\nIn thecurrentsemester,IamhonoredtoholdthepositionofCourseAssistant(CA)fortheAdvanced\nFluid Mechanics course instructed by Prof. Gerard Ateshian. As a CA, I take an active role in\ncreating challenging and engaging homework assignments to help students in their pursuit of\nadvanced knowledge in fluid mechanics. Serving as a CA continues to provide me with a profound\nappreciation for the rich diversity of individuals I interact with daily, each bringing their unique\nacademicbackgroundsandlifeexperiencestotheeducationallandscape.\nAs a prospective doctoral candidate at Columbia University,Iaspiretonurturemyprofoundpassion\nfor research and continue to build up on my graduate research work using the Lattice Boltzmann\nMethod to study the complex problem of Carbon Storage in porous rocks. Columbia University's\nunwavering commitment to research and its strong ties to industry provide me with an unparalleled\nopportunity to channel my research efforts toward makingameaningfulimpactontheworld.Having\nsaid that, I am also interested intheworkofDr.PierreGentineintheareaofclimatemodelingusing\ndifferent computational techniques. Particularly, I am interested in using the Lattice Boltzmann\nMethodtothelargescaledynamicsoftheatmosphereandtheeffectofclimatechange.\nMy ultimate career ambition is to become a professor, where I can apply my acquired knowledge\nand honed skills to tackle real-world problems. Consequently, Iapproachtheprospectofembarking\non a rigorous Ph.D. program at Columbia University with unwavering optimism and confidence. I\nfirmly believe that through this academic journey, I will not only fulfill my personal and professional\naspirationsbutalsocontributesignificantlytotheadvancementofthefield.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}