{
  "document_name": "Myadam, Nishkal Gupta (737840932).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Myadam, Nishkal Gupta; DOB: 11/11/1997; ID: 737840932\nStatement of Purpose\nNishkal Gupta Myadam\n+918712749952, mnishkalgupta@gmail.com\nTo Columbia University,\nDear Professor,\nI have always had a fetish for Computer Science from the time I was introduced to coding in my\nhigh school. Ever since then I have kept myself up to date on new trends in this field. My\nbachelor’s education in Electrical and Computer Engineering provided me resources to build\nstrong foundation in diverse subjects which include but not limited to mathematics, computer\narchitecture & theory, algorithms & data structures, machine learning, cryptography & network\nsecurity, analog/digital electronics, control theory and mechatronics. Later I went to pursue my\ndual master’s in electrical engineering and computer science in collaboration between Indian and\nSwedish universities and it was in Sweden where I was introduced to research and the three\nimportant questions \"what is”, \"why\" and \"the importance\" of research, whose answers changed\nmy perspective towards my career goals.\nAs part of my master’s course work, I performed multiple research projects starting from a\nSystematic Literature Review in \"Fraud detection in online payments using machine learning\ntechniques\", this research provided in depth knowledge about various supervised and\nunsupervised ML techniques and their pros and cons, it also helped me on how to analyze and\nvalidate the obtained results. In short, it gave me a complete picture of how research is done on a\nprofessional level. The positive experience from this research opened doors for me to take up\nresearch assistant role for the summer of 2019 in Blekinge Institute of Technology, Karlskrona,\nSweden where I was involved in two research projects, one where I had performed statistical and\nmachine learning analysis for studying the characteristics of the communication network of a bus\nand also for analyzing the possibility of any system error and the second one being my favorite\nwhich is custom path planning for turtle bot robot in a specific lab environment using A* and\nDijkstra’s algorithm, the take away from this role was collaboration with professional\nresearchers, exploring diverse domains and also understanding the importance of resources for\nperforming research work. Apart from this I have also performed research work in \"Trusted\ncomputing in Containers\" which involves understanding of various steps and key components\nthat are involved in building trust within different hardware and software components of a\nsystem and the possibility of implementing the same in container technology. Next comes my\nmaster thesis where 6 to 8 months of sheer dedication was put by me in researching on the topic\nof \"Design and Implementation of Key Exchange Mechanisms for Software Artifacts using\nBlockchain Technology\" in collaboration with both the industry as well as academia. In short,\nmy thesis included finding out the possibility of decentralizing the authentication functionality of\nPublic Key Infrastructure and designing a framework which is compatible in an Artificial\nIntelligence marketplace. A different view about research was perceived by me from the\nexperiences gained during the master thesis, be it learning completely new technologies namely\nblockchain, distributed systems, cryptography, cloud technologies etc. or the experience of\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Myadam, Nishkal Gupta; DOB: 11/11/1997; ID: 737840932\ncollaborating with industry and following the industry standards and trends, managing the\nunforeseen situations due to Covid lockdowns mainly the unavailability of visiting the university\ncampus and accessing the resources. Proper planning and interaction with the supervisor helped\nme manage it. The most important lesson learned by me during my thesis was to have patience,\npersistence, adaptability and most importantly inspiration to complete any research work and I\nam not only proud of completing my thesis on time, but I am also happy that my thesis till date\nhas received 1400 plus hits and 600 plus downloads which is the highest in my class. After my\nmasters, I briefly worked for 7 months as a software developer in Ericsson, Gothenburg, Sweden.\nIt was during this time I didn’t find any excitement in my work as nothing new was done in the\nindustry, rather the same old development of functionalities based on the customer input. Even\nthough it was hard, I took the decision to quit my job and travel across Europe to rethink what I\nwanted to do in my career. Travelling helped me a lot by not only allowing me to explore\ndifferent cultures and traditions but also helped me get introduced to new people. I made sure I\ninteracted with different researchers across Europe who gave insights on how things work in\ngraduate research and tons of other questions I had on pursuing a PhD. After a lot of thought I\nunderstood my role and purpose, which is research and build technology that enhances human\nlife and I see PhD as the only way to fulfill this. I intend to apply for graduate studies in\nComputer Science with a focus on Artificial Intelligence and its applications. I choose this field\nas it aligns to my previous education, research as well as my future goals of implementing an\nintelligent system that replicates humans which can solve complex problems in a cost-effective\nmanner with the help of software and PhD would be the first step in achieving it. Though I am\nflexible enough and open to ideas for the topic of my graduate studies I would like to conduct my\nresearch in communication/coordination, perception or design of system architecture for AI\nsystems. Few of the topics I am currently educating myself or self-researching are \"distributed\ncoordination of multi modal robots in complex environment\", for this topic I am mainly focusing\non the architecture of communication among the robots and prioritization of tasks using machine\nlearning by considering various parameters such as robots’ current position, environmental\nconditions as well as the goal needed to be achieved. Next, I am also interested in \"Prediction of\nhuman emotions using brain computer interface\", in this topic I look forward to research on\nprocessing signals from the electrodes strapped on human head in predicting the emotions such\nas anger, happiness, etc. by statistically mapping raw signal data to different color codes and\nlater try to replicate the model on to the system and predict it under various conditions as I feel\nthis may be the early stage for transferring human consciousness on to a chip. I am also\ninterested in researching on building a software architecture for satellite systems to process and\npredict the imagery in the satellite compute systems itself rather than sending the raw data back\nto earth which would cost a lot of time and money. I am also open to topics that align with my\ngoal.\nMeanwhile I also founded an Artificial intelligence consulting firm in India once I returned from\nEurope. The firm successfully deployed a computer vision application for a medical diagnosis\nstart-up where we had to use OCR/ICR along with natural language processing to understand and\npredict the issues, treatments and medications handwritten by doctors. Later I had a great offer\nfrom another company where it assured me of mass hiring my employees and giving them a\ngreat salary package which I couldn’t offer them, which I happily agreed to, and I had to\neventually close my firm.\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Myadam, Nishkal Gupta; DOB: 11/11/1997; ID: 737840932\nIn a significant professional development, I now work as a MLOps engineer at a company called\nOne Convergence, I am currently involved in building \"Pluto,\" an AI system that enhances user\nworkflows, like agents for Large Language Models (LLMs). However, Pluto's scope extends\nbeyond a limited number of agents, providing integration for complex tasks and harnessing the\npower of Gen AI at its core.\nI also embrace cultural diversity and bring unique talents to the table. I am an avid guitarist and\ntabla player, and I possess a profound knowledge of ancient Indian scientific scriptures, such as\nSutra, Sulbas, and Vedas, which encompass age-old scientific wisdom. This cultural richness not\nonly enhances inclusiveness but also offers a different perspective that can contribute to a\ncomprehensive research environment.\nI take this opportunity to apply for graduate education at Columbia University, keeping in mind\nmy long-term goals. Working in a graduate position would provide me with an excellent\nopportunity to collaborate with world class researchers, it would also help me get associated with\nleading industrial organizations. After speaking to current and graduated PhD students from\nColumbia, I was fully impressed by the diversity, support and inspiration it provides for an\nindividual to grow in his/her career. I understand the dedication, patience and inspiration\nrequired to have a great research career and I believe I have groomed myself technically as well\nas for having the right attitude and mindset for such a career. If you feel I am the right person\nwhom you’re looking for please do connect to me as I will be more than happy to introduce\nmyself and explain in detail my skill set, talents, and vision.\nThanks in advance!\nYours Sincerely\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}