{
  "document_name": "Golder, Aditi (739328629).pdf",
  "total_pages": 2,
  "pages": [
    {
      "page_number": 1,
      "content": "Golder, Aditi; DOB: 11/20/1995; ID: 739328629\nAditi Golder\n(Applicant for Ph.D. Program at the Columbia University\nSpring 2024, incoming class)\nStatement of Purpose\nMy fervor for research deepened during a seminar on \"How to become a Researcher,\" where I\nvolunteered, unaware of the profound impact it would have on my academic journey. Listening\nto erudite scholars during this seminar served as a catalyst, rekindling a dormant spark of\ninspiration within me. My path continued to unfold as I enrolled in the \"Artificial Intelligence\"\ncourse, a pivotal juncture that drew me closer to the enthralling realm of cutting-edge\ntechnology and its multifaceted applications. During this coursework, I did a project blending\nmachine learning algorithms to solve a real-life problem, and I recognized the profound\nsignificance of research and its transformative potential in shaping the future. The dream of\nbecoming a researcher has been a constant beacon, with my academic achievements, research\ncollaborations, and hands-on experience driving me toward a Ph.D. in Computer Science,\nspecifically in the challenging area of machine learning applications.\nDuring my baccalaureate years, I acquired diverse concepts about system design and analysis,\ndata structure, computer algorithms, software security, network security, data mining, and\ndistinct programming languages. My fascination with healthcare research ignited at this phase.\nIn my final semester, I devised ensemble machine-learning approaches to analyze complex\nmedical data, predicting heart disease and mortality from heart failure, and the results\ndemonstrated the accuracy of predictions, with Artificial Neural Networks achieving a\nremarkable 91.52% accuracy in predicting cardiac illnesses and a bagging ensemble delivering\n90% accuracy in heart failure prediction. As a neophyte, many challenges came in doing this\nresearch, such as medical domain knowledge, methodology of performing ensemble machine\nlearning models, and data scarcity. To overcome these, I sought knowledge from cardiologists,\nread different articles on cardiac diseases, and performed several tuning fits for the\nhyperparameter of the models, which helped me to carry out my work. Subsequently, I\nembarked on a thesis exploring the career intentions of female students in programming, where\nI unveiled the Exception Confirmation Model and Entrepreneurship Event Theory,\ndemonstrating the influence of seven factors on the continuity intentions of female students\npursuing programming careers. My undergraduate years instilled in me the discipline of long\nhours in the laboratory, a habit I have carried forward.\nI continued to expand my knowledge and expertise and joined Jahangirnagar University, one\nof Bangladesh's premier institutions for graduate studies, renowned for its rigorous selection\nprocess. I proudly achieved the 3rd rank out of approximately 1,200 students on the admission\ntest. Throughout my graduate studies, I maintained a delicate equilibrium between\ncomprehensive study and profound understanding of the subject matter, an approach that\nyielded rich dividends, evidenced by my GPA of 3.63 and my 3rd rank among nearly 128\nstudents in my batch. Expanding my research horizons, I collaborated to conduct a\ncomprehensive survey on Hate Speech Detection, addressing the scarcity of quality data in the\nBengali language. Additionally, I worked on Emotion Detection from Bengali texts. In this\nresearch, I proposed two novel models, the CRNN (Convolutional Recurrent Neural Network)\nhybrid model, and the AdaBoost-Bidirectional Encoder Representations from Transformers\n(BERT) ensemble model, both outperforming existing models in terms of accuracy, precision,\nand recall. An empirical study involving six baseline models and five feature engineering\ntechniques further underscored the significance of my research. Currently, I am working on\ninterpretable machine-learning models, trying to use them in the healthcare sector.\nIn my view, a student's merit extends beyond academic excellence and encompasses the\nAditi Golder\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Golder, Aditi; DOB: 11/20/1995; ID: 739328629\npractical application of knowledge. As an undergraduate, I was recognized as a top-up IT\nTrainee by the ICT division of the Government of Bangladesh. I actively contributed to the\nBangla Translate-a-thon organized by GDG Bangla, volunteered for the Google Translate\nCommunity, and served as a Google Local Guide. Furthermore, I managed diverse social\nawareness programs, participated in the university's robotic and cultural clubs, and competed\nin different programming contests. These activities immensely assist me in growing my\nleadership ability and confidence in survival in any competitive situation and enrich my rational\nthinking.\nTo choose my area of specialization at the Columbia University, I am drawn to programs that\nfoster multidisciplinary thinking. In this regard, the research areas offered by the department,\nlike Computational Biology, Security, NLP, Artificial Intelligence, and especially Machine\nLearning, seamlessly align with my academic aspirations. My research experience and\npublications position me as a candidate with the requisite technical foundation and genuine\nresearch enthusiasm to contribute to interdisciplinary projects in these areas, blending\nanalytical and experimental skills. Whenever I examine the contributions of the world's finest\nscholars, I yearn to join this illustrious academic community that disseminates automated\nmachine-learning models and global security concerns. I feel that the intellectual mentoring\nfaculty of the Computer Science department at the Columbia University will help me transition\nbetween my current aims and my future academic aspirations. I admire the contribution of\nresearchers, which deeply inspired me to join this university\nColumbia University offers students a life-changing education through its dynamic curriculum,\ncultural diversity, extensive research opportunities, and excellent faculty. Consequently, a\nPh.D. in Computer Science will assist me in becoming a creative and independent researcher.\nAccording to Global and US rankings, Columbia is one of the nation's leading research\ninstitutions and one of the top universities in the world for entrepreneurs. Furthermore, the\nuniversity's track record of stellar graduation outcomes, particularly regarding employment\nrates and graduate or professional school attendance, has further solidified my resolve to\nchoose the university for my Ph.D. education. These statistics reflect the institution's\nremarkable success and underscore the exceptional competence and preparedness instilled in\nits students. Such an educational environment is precisely what I seek, as I believe it will enable\nme to merge academic knowledge with practical problem-solving skills, thereby making a\ntangible impact on real-world challenges. I hope you will find me a worthy and commendable\ncandidate for the Ph.D. program at your esteemed university. In closing, I sincerely thank the\nesteemed committee and faculty members for their invaluable time and kind consideration.\nAditi Golder\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}