{
  "document_name": "Olatunji, Isaac (765161652).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\nIsaac Olatunji\nPERSONAL STATEMENT\nI was the first on call in the Maxillofacial department during my National Youth Service year\nwhen I was invited to attend to a 19-year-old male patient who presented with a rapidly growing,\nseverely painful, ulcerated facial swelling that had extended from left to right side of his lower\nface and neck. As I had to refer him to a more equipped hospital for a comprehensive\nmanagement, the boy’s father asked me in their native language “Doctor, are you sure everything\nwill return to normal once we get there?”. Of course, I couldn’t give a definitive answer even\nthough I knew the most likely outcome, from putting one and two together. How cool would it\nhave been if I could write a prescription on the spot and reassure them? After completing my\nfirst degree in Dental Surgery in Nigeria, I already knew I would have a research career. From\nmy experiences, and observations during my clinical years as a student, I had become more\ncurious about the presentations, and course of some conditions beyond the scope of clinical\npractice, particularly cancer. Rather atypical of a pure clinician’s training, I began to dig more\ninto the molecular basis for cancer, and I did find interesting revelations in the literature.\nHowever, with more knowledge came more questions. In summary, this led to the publication of\nmy article titled “Potential Application of Tumor Suppressor MicroRNAs for Targeted Therapy\nin Head and Neck Cancer”. Along the way, I found it cool the idea of creating something from\nthe scratch, and building it based on one’s specifications. In short, I taught myself how to\nprogram! The combination of these knowledge, and other skills from various sources have all\nculminated in my research interests, and current work.\nIn our recently published work, which was part of my masters thesis, we explored the use of\nmultimodal data- genomic, clinical, and histopathology images for the prediction of Distant\nMetastasis (DM) in carcinoma patients. In this work, we applied an optimization technique with\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\nIsaac Olatunji\nthe random forest algorithm for identification of gene expression biomarkers in distant metastasis\nsamples, and also investigated whether similarities exist between metastatic genes in the three\ndifferent types of cancer studied. The genes selected by our method performed better than\ndifferentially expressed genes that were selected using the DESeq2 software. Also, our results\nconfirmed that no single specific gene can certify the presence or absence of DM, rather DM is\ninfluenced by various combination of genes which are different in each cancer type.\nTo predict DM directly from histopathology images, we tested the DenseNet121 Convolutional\nNeural Network (CNN) architecture as well as KimiaNet, a DenseNet121 architecture model\npretrained on ImageNet data and finetuned on about 250000 domain histopathology images.\nKimiaNet did not provide a tangible advantage over DenseNet121 in the task of prediction of\nDM from histopathology images. Overall, combining genomic, image, and clinical data for\nprediction of DM gave better results, however genomic data provided the highest contribution.\nBeside my thesis work I have also been actively involved in multiple group and individual\nprojects, some of which are listed on my resume. I am passionate about application of AI in\nprecision medicine, and drug discovery. Going through the list of faculty members, I am\nfascinated by the research of Dr. Mohammed AlQuraishi, Dr. Elham Azizi, and Dr. David\nKnowles.\nI believe my past experiences have prepared me well for this position. I possess a combination of\ncomputational and statistical skills, strong knowledge of molecular biology, as well as clinical\npatient management experience. This means I can identify research gaps, design research with\nconsideration of its final clinical applications, and with my technical skills carry out the research.\nI am certain that the PhD Computer Science program at Columbia University will be just perfect\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Olatunji, Isaac; DOB: 08/22/1993; ID: 765161652\nIsaac Olatunji\nto merge my skills, and experiences as I look forward to creating better healthcare solutions.\nPerhaps in future, a 19-year-old’s life will be saved by writing a prescription.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}