{
  "document_name": "Sapru, Kaustubh (779314189).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Sapru, Kaustubh; DOB: 02/09/1992; ID: 779314189\nStatement of Purpose Kaustubh Sapru\nStatement of Purpose – PhD Admissions, Spring 2024\nThroughout my formative years I’ve harbored a singular focus - impacting the lives of millions. I\nhave nurtured a deep curiosity about how thing’s work, taking an interest in a range of\ndisciplines from the restaurant business to healthcare. An underlying thread across these\ninterests is the shared applicability of problem definition, articulation, and problem solving.\nFocusing on the metrics surrounding seemingly disparate areas such as customer feedback to\nutilizing patient data to discern trends for blood cancer treatment led me into the realm of\nmachine learning. Having applied machine learning techniques in different environments I\nbegan developing solutions to complex problems on a larger scale. My interests lie at the\nintersection of statistical decision making, generative AI, computer vision, and predictive\nmodeling. I believe a multi-faceted approach involving advances in algorithms, probabilistic\ninference, and human-robot interactions has enormous potential to create large scale change\nand impact. I am motivated to address medical negligence, an issue that has been an\nunderlying cause of personal loss and grief. Working toward the development of an equitable,\naccessible, and automated early disease diagnosis system is my best shot at achieving the goal\nof impacting millions of lives.\nMy journey into AI began rather unconventionally in 2016 while running a takeout business of\nauthentic Kashmiri cuisine. Initially meant to support mine and my brother’s education, it swiftly\nturned into a means of representing our lost cultural heritage. In 2019, I expanded operations by\nutilizing data analytics coupled with machine learning to target specific demographics and\nidentify return customers. Simultaneously, I reached out to AI engineers from universities across\nIndia and the UK, pitching ideas for an AI powered early cancer detection system, which\neventually led to a partnership with a local cancer treatment startup for the underprivileged. The\nstartup maintained a database that housed HLA data used to match patients with potential\ndonors for bone marrow transplants. To expand the database, I worked with a team of doctors\nand engineers to organize stem cell donation camps across the city where I educated people on\nthe concepts and importance of transplants. I applied my newly acquired AI skills to identify\nprobabilities of optimal patient-donor matches.\nTo further my understanding of AI’s broader implications, I joined the Neural Engineering Lab as\na graduate data scientist in June 2021 at the City College Center for Discovery and Innovation\n(CDI). At the Neural Engineering Lab, I found the AI community's strength lay in its openness to\ndiverse ideas and collaborations. A pivotal relationship was fostered through mentorship from\nProf. Lucas Parra, marked by daily brainstorming sessions exploring innovative concepts and\nstrengthening my problem solving ability. I was able to enhance our team's analytical\ncapabilities by developing a computer vision software analyzing human neural responses to\nfacial stimuli. This addressed the larger goal of quantifying attention and engagement in\nhumans. Widely adopted within the Parra Lab, this software supported independent research,\novercoming challenges like class imbalance, improving network architecture, heightened\naccuracy despite scarce and uneven sampled training data, and identifying features that most\naccurately predict neural response.\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Sapru, Kaustubh; DOB: 02/09/1992; ID: 779314189\nStatement of Purpose Kaustubh Sapru\nSince my foray into AI at City College, I have worked with leaders of financial trading companies\nand developers of AI powered applications. Here I had the opportunity to build upon my\nfoundational work at CDI and I scaled my solutions. I have been inspired by the work done by\nProf. Regina Barzilay at MIT, who is transforming automated early cancer detection. Her work,\npublished in 2022 (EquiDock), raised important questions about protein flexibility for drug\ndiscovery. My most recent endeavor with Prof. Bruce Johnson, at the Advanced Science\nResearch Center, New York, aimed at developing models that predict protein flexibility profiles\nusing generative AI. I was able to integrate these models to NMRFx Analyst (NMR data\nprocessing software) after overcoming challenges such as saturating model accuracies, slow\ntraining times, and adding new variables to the training data.\nMy academic training and intensive research experience has equipped me with skills such as\ndata analysis, statistical inference, hypothesis testing, development of generative AI models,\nimproving prediction accuracies, and data visualization. I am interested in building upon the\nimportant work of leaders in the field, including Prof. Vondrick, Prof. Zemel, Prof. Smith, Prof.\nAzizi, Prof. Elhadad, and Prof. Alquraishi at the Computer Science department, by devising AI\nmodels that utilize images, text, and structured data to identify trends that affect early diagnosis,\ntreatment, and disease prevention. Computer Science at Columbia offers a unique setting\nwhere teaming up with individuals from diverse backgrounds pushes the boundaries of what is\nachievable. Capitalizing on industry partnerships and the interdisciplinary atmosphere, coupled\nwith my entrepreneurial spirit, I am eager to harness my strong work ethic in pursuit of my\nmission: addressing the deficiencies in our current societal landscape. I bring to the table a\nstrong sense of organization, self-motivation, and resourcefulness, along with a creative\nmindset that thrives in team settings.\nColumbia’s commitment to nurturing historically underrepresented communities fosters an\nenvironment conducive to open expression and innovation. Having witnessed firsthand the\nprofound impact of small initiatives, whether with the kitchen or the lab, I am committed to not\nonly pioneering groundbreaking solutions but ensuring their ethical deployment for the greater\ngood. Yet, amidst these achievements, I've learned that true impact lies not just in the solutions\nwe create, but in the communities we empower and the compassion we impart. As I stand at\nthis career juncture, poised to apply past knowledge together with knowledge gained at\nColumbia, I'm reminded of the responsibility that accompanies expertise. It's not just about the\ntechnical advancements, but the ethical and societal implications ingrained within them. In\nconclusion, my journey is not solely about conquering technical challenges, but about\nleveraging AI as a tool for profound societal change. I am driven by a fervent desire to create\nsolutions that innovate, empathize, and empower. This convergence of expertise and empathy, I\nbelieve, is the catalyst for true, enduring transformation.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Sapru, Kaustubh; DOB: 02/09/1992; ID: 779314189\nPersonal Statement Kaustubh Sapru\nPersonal Statement – PhD Admissions, Spring 2024\nEntrepreneurship is the best source of community development. After running a takeaway of authentic\nKashmiri cuisine for five years, connecting with various people from different backgrounds and\ncultures has been impactful beyond measure. Initially this venture was meant to support my and my\nbrother’s education, however it quickly turned into a means of representing our lost language, culture,\nand identity. My homeland, Kashmir, had a long standing tradition of scholarship older than two\nmillennia. A bloody genocide in the 1990s, due to terrorism in the region, not only uprooted that\ntradition but also displaced what was once a close knitted community and culture. With a family that\nwas attacked and held captive by terrorists, the aftereffects of such a mass upheaval were not just\neconomic but also emotional. Quintessentially, as resilient people, we rekindled a long lost camaraderie\nthrough connections made from our takeaway. In pursuit of providing our patrons with an authentic\nexperience, I underwent an evolution in my personality wherein I learned my own language and the\nhistory of my homeland which originally spawned its scholarly tradition. This quest for knowledge\nprompted me to expand business operations by harnessing analytics over accumulated customer data\nto derive valuable consumer insights. Given my engineering background, I naturally gravitated towards\nmachine learning backed data analytics. Subsequently, this fascination led me to pursue a diploma to\nfocus on machine learning and data analytical approaches. Therein began my tryst with AI.\nAs I began to delve into the foundations of AI, in an unfortunate turn of events, the passing of my\ngrandfather due to medical negligence had me pondering on ‘Is there a way to predict indications of\norgan failure, expediting medical attention for its prevention?’. This question became the catalyst for\nmy journey into AI driven healthcare, as I translated physiological medical records into machine\nreadable features and applied the newly acquired fundamentals of machine learning to develop a\nuniversally applicable prediction system. To expand on the idea, I reached out to engineers and\nmanagers pitching ideas and receiving feedback that eventually led to my venture merging with a local\nstartup also led by a fellow Kashmiri. This startup actively treated patients with blood disorders. I\npartnered with them to work on a remotely operated AI powered disease detection and prediction\nsystem. Owing to India’s large rural population, the patient to doctor ratio is highly skewed. It was\nimperative that reliable diagnosis from urban and suburban centers could reach people who did not\nhave access to sufficient healthcare. As I progressed into the deployment stage, it became apparent that\nI had a long way to go before I could bridge the gap between theoretical concepts and practical\napplication, especially if it entailed utilizing the rapid innovations in AI. Therefore, I registered for a\nmaster’s degree in biomedical engineering with a focus on data science at City College New York.\nSince my journey into AI at City College, I have worked with leaders of financial trading companies\nand developers of AI powered applications, allowing exposure to the intricacies of articulating\nproblems followed by testing and automating solutions, and then scaling them. My most recent\ndevelopment with Prof. Bruce Johnson at the Advanced Science Research Center was a\nmodel predicting protein movement profiles using GANs based on experimental NMR data.\nAdditionally, I designed a multi-cascaded architecture of FNet Auto-Encoders, Time to Vector\nTransformers, and Residual ConvNets trained on multi-channel time series NMR data to predict\nproperties of sparsely populated protein conformations crucial to drug discovery. Having integrated\nboth models with the NMRFx Analyst, a software that primarily processes experimental data, I honed\n10/07/2024 09:54 Personal Statement 1/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Sapru, Kaustubh; DOB: 02/09/1992; ID: 779314189\nPersonal Statement Kaustubh Sapru\nmy skills to include data analysis, statistical inference, hypothesis testing, development of machine\nlearning/deep learning models, data manipulation and visualization. With these skills, I believe I can\nmake constructive contributions to machine learning, artificial intelligence, computer vision, NLP or\nthe computational biology groups at the Computer Science department at Columbia.\nOne of the defining strengths of the AI community is its openness to diverse ideas and collaboration\nopportunities. One of the pivotal relationships that quickly propelled me towards becoming a proficient\nproblem solver was the mentorship I received from my supervisor, Prof. Lucas Parra. Our interactions\nwere marked by day to day brainstorming sessions, during which we consistently explored innovative\nconcepts. Through these collaborative efforts, I enhanced the analytical capabilities of my research\nteam by creating a computer vision software program designed to analyze the neural response of human\nsubjects exposed to facial stimuli. This addressed the larger goal of quantifying attention and\nengagement in humans. My contribution ultimately culminated in the publication of our findings in\nNature Communications and my thesis has had increasing viewership around the globe ever since. This\naccomplishment was further acknowledged and celebrated by both the Biomedical Engineering\ndepartment and my advisor, who honored me with multiple prestigious awards for my dedicated work.\nWith a comprehensive background in biomedical engineering, which encompasses intensive research\nexperience and a solid three-year tenure as a professional data scientist, I find myself well-positioned\nto explore the intricacies of computer science at a deeper level. This endeavor promises to provide\nmy ideas with a more substantial foundation, enhancing their potential for impactful outcomes.\nNestled in the vibrant city of New York, Columbia University offers a unique setting where\ncollaboration with individuals from diverse backgrounds pushes the boundaries of what is achievable.\nCapitalizing on industry partnerships and the interdisciplinary atmosphere, coupled with my\nentrepreneurial spirit, I aspire to make a meaningful difference in the lives of millions, which\nconstitutes my ultimate goal. I bring to the table a strong sense of organization, self-motivation, and\nresourcefulness, along with a creative mindset that thrives in team settings. My ability to identify\nproblems and collaborate with teams to propose efficient solutions is a testament to my skill set. In\naddition to my formal education and professional experience, I have also demonstrated my\ncommitment to becoming a proficient code developer through multiple online courses and successful\ncompletion of various coding tests. Since my initial encounter with artificial intelligence, I have\ndiligently pursued every opportunity to expand my knowledge, and my enthusiasm for continued\ngrowth in this cutting-edge domain intensifies with each passing day. My interactions with\nresearchers, including instructors and fellow students at Columbia University, have deepened my\nappreciation for Columbia’s commitment to diversity and inclusion. I firmly believe that this\ndedication to historically underrepresented communities will afford me the freedom to express my\nideas openly, brainstorm innovative solutions, and bring them to fruition. Having witnessed firsthand\nthe profound impact even small initiatives can make, I am eager to harness my strong work ethic in\npursuit of my mission: addressing the deficiencies in our current societal landscape to benefit the\nbroader population. Consequently, I am at a juncture in my career where I am prepared to take the\nnext significant stride and effectively apply the knowledge I acquire at Columbia University to\npositively shape our ever-evolving society.\n10/07/2024 09:54 Personal Statement 2/2",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}