{
  "document_name": "Zhou, Junru (802277818).pdf",
  "total_pages": 8,
  "pages": [
    {
      "page_number": 1,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nHaving studied Computer Engineering, I have received some of the most rigorous\ntraining at the University of California, Santa Cruz, and the University of California,\nIrvine. The strong curriculum with courses focusing on algorithms, programming\nlanguages, software engineering, and computer systems, has laid for me a solid\nfoundation in adopting system-level perspective and problem-solving skills for both\nreal-life and simulated scenarios. But the real education occurred when I took this\nknowledge and applied it to a variety of projects. In these hands-on contexts, I honed\nmy mastery of programming languages such as Java, Python, C, and C++, and tools\nsuch as Git, TensorFlow, and Firebase, among others. For example, I developed a proxy\nserver that would manage HTTP requests from clients through seamless conversion into\nHTTPS requests and implemented an access control list-based request filtering system\nto optimize network performance. With my hard work and continuing education, I have\nreceived the Dean’s Honor and have accomplished a GPA of 3.31 out of 4, and I finished\nmy undergraduate degree in four years. During my graduate study, I extended my\nknowledge based on what I learned during my undergrad to areas such as Computer\nVision, Machine Learning, and Network Science. I have accomplished a GPA of 3.40\nout of 4. This academic experience, I believe, is strong proof of my qualifications to\nbecome a worthy candidate for your program.\nDuring my undergraduate studies at the University of California, Santa Cruz, I\nencountered a significant academic obstacle related to the C programming language.\nThe sudden global pandemic necessitated a shift to online learning, which presented\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nunique challenges for mastering the intricacies of C, a critical subject in my Computer\nEngineering program. Unlike traditional in-person classes, C programming demanded\na deep understanding of syntax, data structures, and low-level memory management.\nUnfortunately, the online environment made it difficult for me to grasp these\nfundamental concepts effectively. I recognized that adapting to online learning required\na different set of skills and strategies. So, I decided to take a proactive approach to\naddress this challenge. In July 2021, I took the initiative to apply for a teaching assistant\n(TA) position for C Programming and Data Structures, both of which I had excelled in\npreviously. As a TA, I was responsible for conducting weekly discussion sessions,\nanswering students' questions, and reviewing key course materials related to C\nprogramming. To fulfill my role effectively, I adopted a rigorous approach to my\nlearning. I revisited the course materials, collected various examples, and sought\nclarification from professors on topics I had previously found challenging. This\nthorough preparation enabled me to explain complex concepts to students clearly and\nconcisely. This hands-on experience improved my own C programming skills and made\nme more aware of potential pitfalls in my coding practices. Beyond technical skills, my\nrole as a TA also honed my communication, leadership, and presentation abilities.\nIn my role as a research assistant in Professor Qian Chen's lab at UCSC, I collaborated\non a Computer Vision project, \"Identity Tracking with Little Training,\" focusing on\nperson tracking using Convolutional Neural Networks and Vision-RF Fusion. Initially\nchallenged by my limited knowledge in Machine Learning, I proactively enhanced my\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nskills through an Applied Machine Learning class, mastering tools like TensorFlow,\npandas frame, and NumPy. My responsibilities ranged from data collection and\npreprocessing to troubleshooting hardware issues, notably with an Xbox camera. I\ncontributed to model refinement by identifying and correcting data inaccuracies,\nleading to improved model accuracy and noise reduction. This experience not only\ndeepened my understanding of Computer Vision and its practical applications but also\nsharpened my programming skills and problem-solving abilities, fueling my passion\nfor further exploration in this field as I pursue doctoral studies.\nEngaged in the development of the Long Marine Lab Stranding Map project, I played\na significant role in bringing this geospatial data visualization initiative to life. Leading\na team of four developers, I adopted Scrum methodologies, ensuring efficient\ncollaboration and on-time project delivery. Our objective was to create a comprehensive\ndatabase visualization map to track cases of stranded marine life. On the front end, I\nworked extensively with JavaScript and React to design user-friendly layouts.\nLeveraging the power of Mapbox GL, we incorporated robust mapping functionalities\ninto our project, ensuring that users could interact with the data effectively. Meanwhile,\non the backend, we harnessed the capabilities of Node.js to manage data efficiently. Our\ndatabase management was a critical aspect of the project's success. To this end, we\nmade use of Firebase and Algolia for indexing and retrieval, ensuring that users could\naccess information swiftly and accurately. Throughout the development process, I\ncollaborated with my teammates, conducting peer code reviews to identify and address\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nbugs while also optimizing our database management strategies. Efficient task\nmanagement was vital to project's progress, and we achieved this using Jira. Moreover,\nfor seamless code collaboration and version control, we relied on GitHub, enabling our\nteam to keep track of code changes effectively. Our collaborative efforts and dedication\nto the project paid off, resulting in a powerful tool for tracking stranded marine life\ncases. As we move forward, we remain focused on enhancing the project by adding new\nfeatures to meet the evolving needs of our users. This experience enhanced my ability\nto work in a team and manage tasks effectively.\nAfter careful consideration, I find the Ph.D. program in Computer Science at Columbia\nUniversity aligns seamlessly with my academic background, research interests, and\nprofessional aspirations. Columbia’s collaborative ethos and its integration within a\nbroader academic and professional network present an ideal setting for interdisciplinary\nresearch and innovation. It presents the ideal environment for me to grow as a\nresearcher and innovator, contributing to the field of computer science while also\ngaining invaluable knowledge and experience. I am eager to embark on this next phase\nof my academic journey and contribute to the dynamic research community at\nColumbia. In the long term, I want to develop myself to become a good engineer,\ndelivering interesting and useful ideas or products for society.\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nHaving studied Computer Engineering, I have received some of the most rigorous\ntraining at the University of California, Santa Cruz, and the University of California,\nIrvine. The strong curriculum with courses focusing on algorithms, programming\nlanguages, software engineering, and computer systems, has laid for me a solid\nfoundation in adopting system-level perspective and problem-solving skills for both\nreal-life and simulated scenarios. But the real education occurred when I took this\nknowledge and applied it to a variety of projects. In these hands-on contexts, I honed\nmy mastery of programming languages such as Java, Python, C, and C++, and tools\nsuch as Git, TensorFlow, and Firebase, among others. For example, I developed a proxy\nserver that would manage HTTP requests from clients through seamless conversion into\nHTTPS requests and implemented an access control list-based request filtering system\nto optimize network performance. With my hard work and continuing education, I have\nreceived the Dean’s Honor and have accomplished a GPA of 3.31 out of 4, and I finished\nmy undergraduate degree in four years. During my graduate study, I extended my\nknowledge based on what I learned during my undergrad to areas such as Computer\nVision, Machine Learning, and Network Science. I have accomplished a GPA of 3.40\nout of 4, and I finished my undergraduate degree in four years. This academic\nexperience, I believe, is strong proof of my qualifications to become a worthy candidate\nfor your program.\nDuring my undergraduate studies at the University of California, Santa Cruz, I\nencountered a significant academic obstacle related to the C programming language.\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 6,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nThe sudden global pandemic necessitated a shift to online learning, which presented\nunique challenges for mastering the intricacies of C, a critical subject in my Computer\nEngineering program. Unlike traditional in-person classes, C programming demanded\na deep understanding of syntax, data structures, and low-level memory management.\nUnfortunately, the online environment made it difficult for me to grasp these\nfundamental concepts effectively. Instead of succumbing to the difficulties, I decided\nto take a proactive approach to address this challenge. I recognized that adapting to\nonline learning required a different set of skills and strategies. In July 2021, I took the\ninitiative to apply for a teaching assistant (TA) position for C Programming and Data\nStructures, both of which I had excelled in previously. This decision marked a turning\npoint in my academic journey. As a TA, I was responsible for conducting weekly\ndiscussion sessions, answering students' questions, and reviewing key course materials\nrelated to C programming. To fulfill my role effectively, I adopted a rigorous approach\nto my learning. I revisited the course materials, collected various examples, and sought\nclarification from professors on topics I had previously found challenging. This\nthorough preparation enabled me to explain complex concepts related to C\nprogramming to students clearly and concisely. Furthermore, assisting students with\ndebugging and troubleshooting their C code allowed me to gain a deeper understanding\nof common programming errors and their solutions. This hands-on experience\nimproved my own C programming skills and made me more aware of potential pitfalls\nin my coding practices. Beyond technical skills, my role as a TA also honed my\ncommunication, leadership, and presentation abilities.\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 7,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nEngaged in the development of the Long Marine Lab Stranding Map project, I played\na significant role in bringing this geospatial data visualization initiative to life. Leading\na team of four developers, I adopted Scrum methodologies, ensuring efficient\ncollaboration and on-time project delivery. Our objective was to create a comprehensive\ndatabase visualization map to track cases of stranded marine life. To achieve this, our\nteam seamlessly integrated various technologies and skill sets. On the front end, I\nworked extensively with JavaScript and React to design user-friendly layouts.\nLeveraging the power of Mapbox GL, we incorporated robust mapping functionalities\ninto our project, ensuring that users could interact with the data effectively. Meanwhile,\non the backend, we harnessed the capabilities of Node.js to manage data efficiently. Our\ndatabase management was a critical aspect of the project's success. To this end, we\nmade use of Firebase and Algolia for indexing and retrieval, ensuring that users could\naccess information swiftly and accurately. Throughout the development process, I\ncollaborated closely with my teammates, conducting peer code reviews to identify and\naddress bugs while also optimizing our database management strategies. Efficient task\nmanagement was vital to our project's progress, and we achieved this using Jira.\nMoreover, for seamless code collaboration and version control, we relied on GitHub,\nenabling our team to work cohesively and keep track of code changes effectively. Our\ncollaborative efforts and dedication to the project paid off, resulting in a powerful tool\nfor tracking stranded marine life cases. This project not only showcased our technical\nabilities but also highlighted our commitment to addressing real-world challenges in\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 8,
      "content": "Zhou, Junru; DOB: 01/17/2000; ID: 802277818\nJunru Zhou\nmarine conservation. As we move forward, we remain focused on enhancing the project\nby adding new features to meet the evolving needs of our users, especially as online\ncoursework for the upcoming quarter presents new opportunities and demands. This\nexperience enhanced my ability to work in a team and manage tasks effectively.\nAfter careful consideration, I find the Ph.D. program in Computer Science at Columbia\nUniversity aligns seamlessly with my academic background, research interests, and\nprofessional aspirations. Columbia’s collaborative ethos and its integration within a\nbroader academic and professional network present an ideal setting for interdisciplinary\nresearch and innovation. It presents the ideal environment for me to grow as a\nresearcher and innovator, contributing to the field of computer science while also\ngaining invaluable knowledge and experience. I am eager to embark on this next phase\nof my academic journey and contribute to the dynamic research community at\nColumbia. In the long term, I want to develop myself to become a good engineer,\ndelivering interesting and useful ideas or products for society.\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}