{
  "document_name": "Sourab, Mohammed Sazzad Yousuf (819282904).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Sourab, Mohammed Sazzad Yousuf; DOB: 02/06/1997; ID: 819282904\nMohammedSazzadYousufSourab\nPersonal Statement\nI have been wowed by the compactness of electronic equipment and gadgets like handheld mobile\nphones or media players since I was a child. I used to wonder how a small device the size of a human\npalm can perform so many tasks. I think sincethen,somewhereinthebackofmymind,Ialwayswanted\nto study a subject that would make me one of those brilliant minds who are involved in the design and\ndevelopment of electronic equipment and programming them. Later in high school, I showed aptitude in\nmath and science, especiallyphysics.Soitisnoaccidentthatin2017whenIgotmyselfadmittedintothe\ncountry's top technological institution,ChittagongUniversityofEngineeringandTechnology(CUET),after\nclearing arguably the toughest entrance exam in the country with flying colors, I chose to study\nElectronicsandTelecommunicationEngineering.\nI was born and raised in an urban environment where I sawtechnologicaladvancementsandtheimpact\nof technology and devices. I was thrilled while using the devices and thought of developingthoseonmy\nown. I was making a dream while I understood that choosing Engineering as an academic career could\nlead me to pursue my goal of becoming a developer of technologies that change the world.Whiledoing\nmyundergraduateIcametoknowthatdoingPh.D.researchcangivemetheopportunitytodowhatIwas\ndreamingaboutfrommychildhood.\nDuring my four years of undergraduate studies, I have had the privilege to be introduced to someofthe\nmost captivating topics of electronics and telecommunication engineering to my heart's content, that too\nby the best academicians and research figures of the country. I discovered my interest in Computer\nProgramming later it turned into a fascination with Artificial Intelligence and Computer vision. First I\nstarted with the course named “Project Design and Development” whereIusedMATLABtodoanImage\nProcessing project named “Vehicle Licence Plate Detection and Recognition using MSER Algorithm”.\nThis created my firm interest in Computer Vision and later I discovered that Artificial Intelligence playsa\nvital role in Computer Vision and ended up doing my undergraduate research thesis in combination of\nDeep Learning and Machine Learning. I find fascinationinworkingwithBiomedicalImagedataforimage\ndiagnosis purposes. My grades in related courses like Neural and Fuzzy in Communication and Project\nMohammedSazzadYousufSourab\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Sourab, Mohammed Sazzad Yousuf; DOB: 02/06/1997; ID: 819282904\nMohammedSazzadYousufSourab\nand Thesis all are A+ which goes to demonstrate my strong grip in Computer vision and Artificial\nIntelligence.\nUndoubtedly the most memorable part ofmyUGstudieswasthe4.75credit-hourthesisdonethroughout\nmy senior year. This is when Ifirstgotintoresearchandseriouslystartedtoconsideraresearchcareer.I\nused my course knowledge and also I invested a lot of time in learning the basic topics in Machine\nlearning and Deep Learning are cost function, backpropagation, multilevel perceptrons, convolutional\nneural network layers, activation functions, classification functions, loss function, regularization, feature\nextraction, overfitting and underfitting problems andtheirsolutions,differentmachinelearningalgorithms,\nand their learning procedures. I liked to work with Tensorflow and Keras whichledmetogetexpertisein\nPython and R language. Under the guidance of my undergraduate thesis supervisor, I started reading\nhigh-quality research papers understanding their methodologies, and learned to implement them in my\nthesis work. I aimed to develop a highly accurate classification and diagnosis method for Pneumonia\nusing the Chest Radiogram dataset. The main challenge in this type of work in biomedicaliswehaveto\nmaintain higher accuracy than any other research because the research is directly related to human\nhealth.plasmonics.UndertheguidanceofmyUGthesissupervisor,Istartedmyresearchinamethodical\nway. We decided on a topic at our firstmeetingwhichwasrelatedtobiomedicalimages,especiallychest\nradiograms. The performance of my research output was comparable with otherexistingrelatedworks.I\nwas awarded an A+ formythesiswork.Iinitiallystruggledalotwiththecomplexityofthesimulationwork\nbut overcame it by diligently studying. I also published a Journal Article before my thesis was defended\nandtheJournalwasatop-rankedone.Thoughthepublishedarticlerepresentsonlyaportionofmythesis\nwork. The article is named, \"A comparison of hybrid deeplearningmodelsforpneumoniadiagnosisfrom\nchest radiograms.\", published in Sensors International journal in Volume 3. I believe it is just the\nbeginning and I look forward to producing more high-quality publications in my career. My thesis was a\njourney full of ups and downs, lots of adrenalinerushes,momentsofeuphoriaandfrustration.Ilovedthe\nrollercoasterrideandsomewhereinthemiddleofitIdecidedIwantedtobearesearchpersoninmylife.\nMohammedSazzadYousufSourab\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Sourab, Mohammed Sazzad Yousuf; DOB: 02/06/1997; ID: 819282904\nMohammedSazzadYousufSourab\nIn addition to academics, I was also involved with several volunteerorganizations.Ihadbeenservingas\na President of “CUET Photographic Society” and with several other organizations. I have gained\nresponsibilityandworkedwithateamwhileservingtheorganization.\nAfter graduating from CUET, IstartedworkinginaGlobalTechgiantcompany“HuaweiTechnologiesLtd”\nwhere I worked as Cloud Solution Architect for a few days and learned a lot about how enterprisesare\nusing Cloud for their Enterprise Resource Planning (ERP) and learned to migrate cloud data from one\ncloud infrastructure to other. Later I joined a renowned Private university in Bangladesh named“Daffodil\nInternational University” as a Lecturer in the Department of Electronics and Telecommunication\nEngineering. I was thrilled to start this job because this hascreatedscopeformetoinvestmytimemore\nin research and academy work. Working with my students on my research topic issuchapleasantjob.I\nam also supervising three undergraduate students. I intend to worktillthisFall2023semesterandlaterI\nwant to start my dream which is doing a Ph.D. at a higher-ranked university like Columbia University\n(Graduate Engineering). The Engineering Graduate Program of this university has a large number of\nfaculties doing research in almost all aspects of Engineering and there areampleopportunitiesfordoing\nresearchwithindustries.That’swhatamazedmethemostaboutthisUniversity.\nColumbia University (Graduate Engineering) has active research groups working on the areas that\nenthrall me most. I’ve applied for a Ph.D. program in Computer Science at this university under the\nsupervision of Professors who have a wide range of wisdom. After obtaining the Ph.D., my plan is to\ncomplete a post-doctorate to be more specialized in the specific research area, and then join academia\nasaprofessorbecauseitistherightplaceformetocontinueresearch.\nFinally, I know there will be hurdles while pursuing a PhD. Still, I am confident enough to managethose\nthrough my endurance, resilience, critical thinking fast learning skills, andexperiencesifIgetthechance\nto start my graduate study at Columbia University in Spring/Fall 2024 with the financial support of\nGraduateAssistantshiporFunding.\nMohammedSazzadYousufSourab\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}