{
  "document_name": "Pham, Tieu Hoang Huan (882259412).pdf",
  "total_pages": 6,
  "pages": [
    {
      "page_number": 1,
      "content": "Pham, Tieu Hoang Huan; DOB: 06/14/2001; ID: 882259412\nTieu Hoang Huan Pham 1\nTieu Hoang Huan Pham\nPersonal Statement\nComputer Science at Columbia University\nIntended program: PhD in Computer Science (M.S. leading into Ph.D.)\nFrom the vibrant streets of Saigon to the historic corridors of York, my academic and cultural\njourney has been a tapestry of diverse experiences. During my early days in York, the stark\ncontrast between my Vietnamese upbringing and the British education system was not merely\nacademic but also deeply cultural. I remember instances when classmates would share anecdotes\nfrom their childhood, rooted in British traditions, while I nostalgically recall the vibrant streets of\nSaigon during the Tet festival. Often, the cultural gap was as subtle as when jokes from\nBlackadder and Monty Python resonated deeply with the British students, leaving me puzzled.\nThese moments, although seemingly trivial, painted a broader picture of the deep-seated\ndifferences that lay between our worlds. Yet, it was these very differences that shaped my\nresilience, adaptability, and unique perspective—qualities I believe are essential in the ever-\nevolving field of computer science.\nMy time in the UK made me realize the immense difficulty of being a minority in a\npredominantly monocultural community, with structural rigidity that limited my ability to grow,\nparticularly in computer science, as there was no access to this subject in my boarding school.\nColumbia, with its commitment to diversity and its esteemed computer science program, presents\nthe ideal environment for someone like me, who values both cultural richness and academic\nrigor.\n10/07/2024 09:54 Personal Statement 1/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Pham, Tieu Hoang Huan; DOB: 06/14/2001; ID: 882259412\nTieu Hoang Huan Pham 2\nIn the U.S., while I was finally navigating the intricate waters of computer science, I\nsimultaneously grappled with understanding the American way of life. The concept of\nThanksgiving, the emphasis on individualism, and even the spirited college sports culture were\nall novel to me. However, with each passing event, I took it upon myself to learn, adapt, and\nshare my own stories, weaving a tapestry of shared experiences with my peers.\nInitially, I found computer science daunting because of its intricate logic and the precision it\ndemanded. The abstract nature of algorithms and the initial hurdles of syntax felt foreign,\ncontrasting starkly with the subjects I had previously studied. To bridge this gap, I adopted a\nproactive approach. I frequently visited professors during their office hours, spending extra time\nafter class to clarify doubts and deepen my understanding. I also sought mentorship from senior\nstudents and dedicated countless hours to self-study. Collaborating with peers became a regular\npractice, allowing me to grasp complex concepts from multiple perspectives. This hands-on,\ncollaborative approach not only helped me navigate the intricacies of the subject but also\ninstilled in me resilience and a never-give-up attitude. From grappling with a basic “hello world”\nprogram in C++ to authoring a paper for the International Conference on Machine Learning and\nApplications (ICMLA 2023), my journey has been one of consistent growth. My experiences\nhave equipped me with the resilience, curiosity, and collaborative mindset that I believe will\nallow me to thrive within Columbia’s outstanding computer science program.\nDuring the summer of 2023 at Hofstra, I joined Professor Wu and Professor John in applying\nmachine learning in the neuro-imaging field. By using GAN and its various derivatives, we were\nhoping to see whether we could feed raw 4D functional MR data straight into GAN without\npreprocessing to determine whether they outperform traditional algorithms in classifying patients\nwith schizophrenia. I was tasked with handling the raw 4D MR data and testing the various GAN\n10/07/2024 09:54 Personal Statement 2/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Pham, Tieu Hoang Huan; DOB: 06/14/2001; ID: 882259412\nTieu Hoang Huan Pham 3\nmodels. However, since we were working with 4D tensors, I was working on how to make a 2D\nslice. In weekly lab meetings, I was exposed to many exciting terminologies in the neuro-\nimaging field.\nI also assisted Professor Shan with a particular computer system project, evaluating Gemini\nperformance under memory pressure. In the virtualized cloud, a huge page misalignment caused\nthe application to perform poorly. To mitigate this problem, Professor Shan, in a previous paper,\ncreated Gemini, a subsystem that turns misaligned huge pages into well-aligned huge pages. I\nwas tasked with expanding Gemini's use cases. I designed test cases to see how Gemini would\nperform under complex scenarios such as memory deduplication, memory ballooning, and\nswapping.\nIn spring 2023, I chose to explore the application of machine learning in the mortgage sector\nfor my honors thesis, guided by Professor Puerzer and Professor Lane. My interest in this area\nstems from the critical role mortgages play in determining homeownership and, by extension, the\nsocio-economic mobility of individuals. As fintech companies increasingly harness AI and\nmachine learning, I was alarmed by papers from the Journal of Financial Economics that\nhighlighted the presence of algorithmic bias. Using statistical techniques, particularly the chi-\nsquare test, I was able to confirm disparities in mortgage approval rates across different\ndemographics in New York. These findings have profound societal implications. If unchecked,\nthese biases in machine learning models perpetuate systemic discrimination, further\nmarginalizing already vulnerable groups. As computer scientists, we bear the responsibility to\nensure that technology serves as an enabler of equity, not a perpetuator of bias.\nI enjoyed the learning process because it was more than just coding or data analysis; it was\nabout understanding the real-world implications of our algorithms. Every line of code, every\n10/07/2024 09:54 Personal Statement 3/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Pham, Tieu Hoang Huan; DOB: 06/14/2001; ID: 882259412\nTieu Hoang Huan Pham 4\ndataset, and every model choice had the potential to impact lives. The interdisciplinary nature of\nmy research, which involved finance and urban studies, further enriched my understanding. It\nmade me realize that the challenges in machine learning are not just technical but deeply societal.\nI am eager to collaborate with Professor Bareinboim, the director of the Causal Artificial\nIntelligence Lab and a renowned expert in fairness analysis. His recent work, which delves into\nthe intricate relationship between data, AI, and fairness, resonates deeply with my research\ninterests. His innovative approach, melding causality language with legal doctrines involving\ndiscrimination, offers a promising avenue for addressing the biases inherent in modern AI\nsystems. As I discuss in my thesis, Professor Bareinboim's emphasis on translating societal\nnorms into measurable statistical terms could be invaluable.\nAt Hofstra, my passion for computer science and mathematics was not confined to just my\npersonal academic endeavors. Recognizing the challenging nature of these disciplines, I took on\nweekly tutoring roles in both the computer science and mathematics departments. This\nresponsibility was about more than just knowledge dissemination; it required immense\nadaptability and patience. Every student, with their unique characteristics, meant that a one-size-\nfits-all approach would not suffice. I constantly innovated and tailored my teaching methods to\ncater to individual needs. Assisting international students added another layer of complexity.\nLanguage barriers, cultural nuances, and diverse educational backgrounds necessitated effective\ncommunication. Tutoring students from various countries, including Uganda, El Salvador, and\nthe Philippines, I often found myself breaking down concepts differently, using relatable\nexamples from their cultures, or rephrasing explanations until clarity was achieved. Through\nthese sessions, I not only imparted knowledge but also learned immensely about diverse cultures,\nbroadening my own perspective and understanding. It was a journey of not just guiding them\n10/07/2024 09:54 Personal Statement 4/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 5,
      "content": "Pham, Tieu Hoang Huan; DOB: 06/14/2001; ID: 882259412\nTieu Hoang Huan Pham 5\nacademically but also assisting them in navigating a new educational system, drawing parallels\nfrom my own experiences as an international student.\nBuilding on the cultural mosaic that my life has become, my journey has been underscored by\nthe challenge of fostering inclusivity and understanding across diverse settings. The transition\nfrom a conservative household in Saigon to a British boarding school was my first taste of the\nchallenge. In environments unfamiliar to one's upbringing, the potential to grow and innovate\ncan sometimes feel stifled. Yet, these experiences, albeit difficult, underscored the importance of\nfostering a community that celebrates differences. In essence, to truly thrive, it is not just about\nintegrating into a new society but enriching it with a diverse tapestry of perspectives that inspire\ntransformative change. As I look ahead, I am drawn to New York City and Columbia, a global\ninstitution embodying this ethos of diversity and inclusivity.\nSeeking a PhD in computer science at Columbia, particularly through the MS leading to PhD\ntrack, will allow me to deepen my knowledge in the expansive realm of AI and machine learning\nand to contribute meaningfully to the community at the pinnacle of research. Even as an\nundergraduate, I have been driven by a desire to understand the state-of-the-art advancements in\nmachine learning and AI, especially the role of fairness as these models transition from theory to\nreal-world application. My primary objective is to conduct research that ensures that, as we\nadvance in the domain of AI and machine learning, these technologies are applied ethically,\nprioritizing and protecting humanity's interests. I am particularly drawn to exploring the\nimplications of AI in criminal justice, aiming to develop models that counteract racial biases in\npredictive policing; in healthcare, where I intend to design diagnostic algorithms that are\ninclusive of all demographic groups; and in financial services, where I plan to investigate and\nmitigate the effects of underlying prejudices in lending decisions.\n10/07/2024 09:54 Personal Statement 5/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 6,
      "content": "Pham, Tieu Hoang Huan; DOB: 06/14/2001; ID: 882259412\nTieu Hoang Huan Pham 6\nBeyond research, I am deeply passionate about teaching and mentoring the next generation of\ncomputer scientists, emphasizing both technical expertise and ethical considerations. My long-\nterm goal, post-PhD, is to secure a tenure-track position at a leading university where I can\nseamlessly blend groundbreaking research with transformative teaching. I am confident that my\ndiverse experiences and the challenges I have overcome will enrich Columbia's community.\n10/07/2024 09:54 Personal Statement 6/6",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}