{
  "document_name": "Shrivastava, Abhudaya (937487022).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Shrivastava, Abhudaya; DOB: 11/06/2002; ID: 937487022\nAbhudaya Shrivastava\nFrom an early age, a profound passion for Computers and Technology began to take root within\nme. At the tender age of four, I was first introduced to Microsoft Paint through school, and my innate curiosity\ndrove me to explore my initial encounter with a video game, \"Conflict: Desert Storm.\" As I progressed in my\nacademic journey, I acquired valuable knowledge about various computer applications. During my\npenultimate and final years of schooling, I encountered a significant coding assignment that entailed utilizing\nNetBeans IDE, the C Programming language, and MYSQL. Drawing upon my creativity and understanding\nof management and organizational structures, I proposed the topic of an airline booking management\nsystem application for my group. This application encompassed numerous features, ranging from facilitating\nflight bookings on any given day to calculating miles and displaying paths on a globe. Engaging in this\nproject provided me with a fresh perspective on the realm of computer science, enabling me to transcend\nmere enthusiasm and aspire toward true innovation. Prior to this experience, while my zeal for innovation\nand research was evident, I lacked the practical knowledge of how to pursue it effectively. However, the two\nyears of my high school education served as a transformative period, opening doors for me to explore and\ndelve into ideas that yield innovative solutions applicable to real-life scenarios. This newfound curiosity\nurged me to venture beyond the realm of Computers and delve into the scientific principles that underpin\nthem, thereby empowering me to test novel ideas for practical applications. Consequently, at the age of\nfifteen, I took the decisive step of enrolling at Rutgers University Camden to pursue a ‘degree in Computer\nScience and Finance. This educational pursuit not only fueled my passion for technology but also paved\nthe way for my future endeavors in the realms of innovation and research. My aspiration is to develop\npragmatic solutions to real-world complex systems, thereby making a meaningful contribution to society.\nDuring my time at Rutgers University, I was awarded a merit-based scholarship due to an impressive CGPA\nin high school and SAT score. Throughout my studies, I encountered various challenging yet significant\nconcepts across diverse courses. Additionally, I developed optimized solutions for stack and queue\noperations. Building on my skills and prior knowledge in Computer Science, I secured internships in\nResearch and Development roles as a Data Scientist and Analyst, which is my career goal. These\nexperiences allowed me to acquire technical and soft skills including but not limited to Advanced Python\nProgramming, Tensor Flow, Geocoding, UI/UX Design, Tableau, ETL pipeline deployment, Apache Airflow,\nMYSQL Workbench, Microsoft SQL Server, Leadership, Teamwork, Optimization. While facing novel\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Shrivastava, Abhudaya; DOB: 11/06/2002; ID: 937487022\nAbhudaya Shrivastava\nchallenges. Daily, I worked with extensive datasets and prepared them for analysis and deploying AI\nengines. I am particularly proud of two internship projects. Firstly, I enhanced a navigation system by\ncreating a data mining algorithm to transform data into a readable format, incorporating geocoding for\nprecise location information. Secondly, I collaborated with the Road Transport Authority of Dubai to\nautomate the Transit Line Monitoring System. I deployed a neural network-based machine learning model\nfor a complex system to detect transit disruptions, and overcoming data formatting challenges through\nresearch and perseverance.\nWhile I worked my way up with professional experience, I remained steadfast in my goal to innovate using\nComputer Science concepts for the betterment of society and the future. This led me to delve into research,\nwith a particular fascination for Artificial Intelligence (AI). Determined to contribute, I wrote my first paper,\n\"Using Deep Learning and Machine Learning in Space Network,\" published by IEEE at a conference in Abu\nDhabi, U.A.E. The paper explores Transfer and Data Relay Systems (TDRS), which transmit space data\nfrom rovers and telescopic satellites. I employed neural network models: Data Belief Network for\nprobabilistic reasoning in decision-making for rovers and satellites, and Restricted Boltzmann Machine for\nfeature learning and generative modeling based on data from satellites and rovers. The RBM also supports\nthe DBN in decision-making with feature learning and planetary object analysis. My interest in research\ndeepened, leading to my recent IEEE paper, \"Security Analysis for Threats to Patient Data in the Medical\nInternet of Things\". It addresses the security of Medical IoT, used for multiple applications to record and\ntransmit data all over the hospital network. To counter security threats, I proposed implementing Transport\nLayer Security, Virtual Private Networks, and Cryptography for data transmission. Additionally, I suggested\nusing neural networks for daily encryption updates and traffic analysis. Through contributions in the field of\nresearch and innovation, I aim to advance in AI and its applications by contributing as Data Scientist and/or\nMachine Learning technology evangelist.\nBased on my prior experiences, I am aware of the path I wish to pursue. Seeking mentorship and guidance,\nI am determined to embark on a Ph.D. journey in Computer Science, focusing on Artificial Intelligence and\nits Applications. During my junior year of Undergrad, I explored some of very prestigious universities which\noffers unique research opportunities. I found the Columbia University courses and research opportunities\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Shrivastava, Abhudaya; DOB: 11/06/2002; ID: 937487022\nAbhudaya Shrivastava\nin Artificial Intelligence, Machine learning, and Security & Privacy to capture my interest, especially the\nongoing projects in different labs and multiple publications across labs via faculties. Their brief description\nof projects and admiration towards many publications in the above three fields resonated with my desired\nknowledge and skill development. Confident in my decision, I believe Columbia University offers the best\nacademic environment for my aspirations. With mentorship and the comprehensive course offerings, I am\noptimistic about making significant contributions to the fields of Artificial Intelligence, Machine Learning and\nSecurity & Privacy pursuing my Ph.D. in Computer Science.\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}