{
  "document_name": "Santhanam, Hari (976927815).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Santhanam, Hari; DOB: 01/04/1998; ID: 976927815\nHariSanthanam\nMy first exposure to a major research environment was in my junior year at Princeton\nUniversity,whenI conducted researchinProfessor NirajJha’slab. Iwas taskedwithdetermining\nif a sparse ResNet-50 architecture could achieve similar levels of accuracy as a dense\narchitecture when trained on a small retinal dataset of OCT scans. Through many binary\nclassification experiments, between the healthy class and each retinal disease class, and\nmulticlass classification experiments, I discovered that therewasan averagediscrepancyof only\n0.5% in performance between the dense and sparse architectures. It was a great learning\nexperience, as I discovered the intricacies of transferlearning andPyTorchmodel training. Most\nof all, I found within mea desiretoengage inresearch anddiscovernewknowledge. Ihave since\nbecome further fascinated by topics in computer vision, machine learning, and image analysis,\nthrough rewarding research opportunities as a B.S.E. student at Princeton and as an M.S.E.\nstudentatUPenn.\nDuring my senior year at Princeton University, I completed my Undergraduate Senior\nThesis under the guidance of Professor Niraj Jha. In my first foray into computer vision, I\nfocused on applying an image synthesis technique called DeepInversion to an instance\nsegmentation network, reducingthe needfor labeledvideo data infutureapplications.Todothis,\nI inverted a fixed Mask R-CNN architecture, from random noise, with additional image and\nfeature distribution regularization terms to generate input frames fromthe DAVISdataset. Since\nthis was the first application of DeepInversion to an instance segmentation network, I faced\nseveral development challenges in model design and TensorFlow implementation that required\nme to pose novel questions and form creative solutions. After months ofexperimentation, I was\nhappy to finally synthesize DAVIS video frames and have my work featured by the Princeton\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Santhanam, Hari; DOB: 01/04/1998; ID: 976927815\nHariSanthanam\nStatistics and Machine Learning Center. Through this research project, I understood the\nimportance of persevering through challengesand appreciatingtherewarding, yetdifficult nature\nof research.\nIn my first year as a Robotics Master’s student at UPenn, I pursued a newfound interest\nin Explainable Artificial Intelligence (XAI). Under the mentorship of Professor Lyle Ungar, I\nworked with doctors from the University of Utah on a Pediatric Sepsis study, presented in the\nform of Electronic Health Record (EHR) data. While XAI methods do exist to understand and\nanalyze models trainedon EHRdata, ourcasestudy presentedmany casesof featurecollinearity,\nwhich XAI models work poorly on. As a result, I used Shapley values to illustrate the need for\nfeature set creation and feature adjustments to remove collinearity and enhance model\nexplainability. During this interdisciplinary endeavor, I was fortunate to be able to work with\ndoctors, so I could gain agreaterunderstanding of themedical andbiologicaldrivers behind ML\npredictions. I am excited that these findings could contribute to the current XAIliterature inthe\nmedical domain. This project provided me with a meaningful lens to explore the remarkable\ninterplay between machine learning and healthcare, and showed me that scientific research can\nbe usedinservice of others.\nIn my second year atUPenn, Icompleted aMaster’sThesis inProfessorJianbo Shi’s lab,\nfocused on computer vision research. Motivated by applications that need adaptable 3D shape\nmodels, usually with little training data, I automatically generated a contour labeled dataset that\ncontains crucial information for basic 3D object understanding. With this novel dataset, I\nexplored the performance of instance segmentation architectures on detecting and labeling the\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Santhanam, Hari; DOB: 01/04/1998; ID: 976927815\nHariSanthanam\ncontours, and additionally demonstrated a surprising improvement in 3D reconstruction from a\n2D image. Not only did my work culminate in a co-first author publication in the Winter\nConference on Applications of Computer Vision (WACV 2023), but it also gave me the\nopportunity to engage in discussions with researchers in industry and academia, and share my\nwork with faculty in the field through thesisandconference presentations.From theseformative\nexperiences, I have learned how to confidently communicate my research, think creatively and\nindependently,andform strong relationshipsin aresearchcommunity.\nI have expanded my interests in machine learning and computer vision through industry\nresearch as well. As anAdvancedR&D Internat AmazonRobotics, Igenerated syntheticdata to\nimprove the segmentation performance onanewwarehousesensorsetting. Tothisend, Ilearned\ntransformations, using GANs, that realistically placed labeled foreground objects from a\npre-existing sensor setting into the new setting. After a gratifying internship at Amazon, I am\nnow working at Agility Robotics, where I develop perception models for human-centric robots.\nWith these experiences, I have developed the ability to solve challenging, open-ended research\nproblemsthat haverealworld applications.\nMy past research and academic experiences motivate me to continue work in machine\nlearning and computer vision, specifically for biomedical imaging analysis. For this reason, I\nhave a strong interest to work with Professor Despina Kontos and contribute to her\ngroundbreaking work in this field. I am especially excited by her research in the use of AI and\nmachine learning for understanding and diagnosing cancer. I have read with great interest her\nwork onDeep-LIBRA,whichuses CNNs,superpixel generation, andradiomic machinelearning,\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Santhanam, Hari; DOB: 01/04/1998; ID: 976927815\nHariSanthanam\nto achieve an impressive AUC for breast density estimation on a multi-racial, multi-hospital\ndataset. Also, I am very interested in her work on identifying intrinsic phenotypes for breast\ncancer risk, using traditional machine learning techniques. More generally, I am drawn to work\nwith Professor Kontos because of her use of imaging for enhanced disease diagnosis and\nnon-invasive medical care. I believe my research experiences inmachine learningandcomputer\nvision, and my strong interest in biomedical imaging analysis, allow me to be a great fit for\nProfessorKontos’ lab.\nI hope to join Columbia’s Ph.D. program and engage in collaborative work with\nresearchers in the Vagelos College of Physiciansand Surgeons,anddevelop biomedical imaging\nmodels that benefit society. I am especially excited by the possibility of working with leading\nbiomedical researchersinthe worldand contributingto theinterdisciplinary researchinthe BME\ndepartment, by drawing from my background in electrical engineering, robotics, and computer\nscience. I am also delighted to learnthat theprogram emphasizesteachingexperiencesfor Ph.D.\nstudents. One of my more memorable experiences as a Master’s student at UPenn was working\nas a teaching assistant for a graduate level computer vision course.Asa Ph.DstudentinBME, I\nlook forward to forging more experiences as a teaching assistant and tutoring students from\ndiverse backgrounds. In the future, I would like to lead an academic research lab, founded on\ninnovation, collaboration, and service, and pioneer groundbreaking work in vision and ML for\nbiomedical imaging applications. I look forwardtoembarking onthis journey,through the Ph.D.\nprogram atColumbiaUniversity.\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}