{
  "document_name": "Kearns, Maxwell (978025776).pdf",
  "total_pages": 4,
  "pages": [
    {
      "page_number": 1,
      "content": "Kearns, Maxwell; DOB: 01/05/1998; ID: 978025776\nMax Kearns Columbia University PhD Application\nTo the Graduate Program Admissions Committee,\nI graduated in the Spring of 2020 from the University of Rochester with my\nundergraduate degree in Chemical Engineering, when Covid-19 had just begun and no one knew\nhow long the pandemic era of learning would last. I decided to postpone my goal of earning a\ngraduate degree and gain professional experience working in industry. In the two years I worked\nas a process engineer, I gained a deep appreciation for the role of chemical engineering in\nimproving food quality and reducing the environmental impact of large manufacturing plants.\nDuring this time, I also witnessed many incredible innovations in the biotechnology industry –\nmultiple vaccines, antibody therapies, and antiviral treatments emerged over a short time span of\ntwo years. It was a miraculous feat and inspired me to return to an innovative academic\nenvironment for my master’s degree in chemical engineering with a focus in biotechnology.\nThrough technical coursework in tissue engineering, biological machine learning, and core\nchemical engineering subjects, I was able to develop new skills to implement in my research. I\nbegan working in the lab of Dr. Allie Obermeyer, where I had the opportunity to apply machine\nlearning algorithms to synthetic biology problems. Working at this exciting intersection of fields\nexpanded my research interests in synthetic biology, cellular engineering, and applied machine\nlearning and motivated me to apply into the PhD program at Columbia University.\nMy motivation to earn a doctorate degree is driven by both short-term and long-term\ngoals – as a graduate student, I want to continue learning, be intellectually challenged, and\ncontribute original work in the field of chemical engineering. My research experience in the lab\nof Dr. Allie Obermeyer solidified these goals. To enhance the quantitative analysis of E. coli cell\n1\n10/07/2024 09:54 Personal Statement 1/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Kearns, Maxwell; DOB: 01/05/1998; ID: 978025776\nMax Kearns Columbia University PhD Application\nmorphology using microscopy images, I developed a support vector machine (SVM) to classify\nwhether individual cells were correctly segmented from their background. During this process, I\nexperienced numerous programming challenges, struggled to take high quality images of fixed\nbacteria cells, and spent a large portion of the project figuring out how to manage the large data\nsets I was constructing. Ultimately, I wrote a MATLAB script to extract image data from more\nthan 10,000 individual E. coli cells expressing green fluorescent protein (GFP) with various\ncharged peptide tags. To incorporate this training data into the SVM, I needed to produce high\nquality labels for my data. To accomplish this, I spent several weeks using my “human eye”\ncombined with open-source software to manually label all 10,000 cells. Using this high-quality\ncurated data set, I trained, validated, and tested the SVM. The overall classification accuracy was\n85%, with a low false positive rate of 7%, which significantly improved the quantitative image\nanalysis of bacteria cell morphology. It was immensely gratifying to achieve improved results\nafter encountering numerous project obstacles. This experience has been a driving force for me\nto pursue challenging research as a doctoral student. In addition to gaining skills in molecular\ncloning, cell culture techniques, plasmid design, and microscopy, this project also introduced me\nto the exciting intersection of synthetic biology and machine learning.\nAs a PhD student at Columbia University, I want to continue working on complex\nchemical and biological engineering problems. I believe my research interests in synthetic\nbiology, cellular engineering, and applied machine learning would make me a strong candidate\nto do research in the labs of Professor Allie Obermeyer, Professor Scott Banta, and Professor\nMijo Simunovic.\n2\n10/07/2024 09:54 Personal Statement 2/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Kearns, Maxwell; DOB: 01/05/1998; ID: 978025776\nMax Kearns Columbia University PhD Application\nEarning a doctorate degree will fulfill a long-term goal of becoming a credible scientist\nwith the ability to engage with other technical leaders. My goal is to use the skills from my PhD\ndegree and consulting experience to start a business venture in the biotechnology industry. My\nprevious industry experience exposed me to the high-intensity atmosphere of engineering\nproposals, client relationships, and technical presentations. Our clients, including several\nmultibillion-dollar food and beverage companies in the U.S, tasked us with designing new\nmanufacturing facilities and process lines. It was incredibly satisfying designing technical\nsolutions for major clients, but I desired to work on problems of greater complexity and open-\nendedness. A doctoral degree will allow me to develop an expertise in a niche area of chemical\nengineering and approach emerging challenges in a methodical and technically rigorous way.\nThese are the skills I want to develop to be a scientific leader in my future career. Furthermore,\nColumbia University has one of the strongest entrepreneurship environments in the world – the\nColumbia Startup Lab in Morningside offers resources to enhance my entrepreneurship skills\nwhile pursuing fulltime research. Other opportunities, such as the technology track Venture\nCompetition, would be perfect for gaining startup capital with a more mature innovation. I\nbelieve Columbia University will provide me with unparalleled support and opportunities to\nengage in intense research while simultaneously progressing towards my long-term\nentrepreneurial goals.\nAlongside academics, I hope to enrich the engineering community at Columbia\nUniversity. As an undergraduate, I was deeply involved in student government and the American\nInstitute of Chemical Engineers (AIChE). I spent 3 years as a student accountant where I\ncollaborated weekly with a committee to review the budgets of 200+ student organizations. This\n3\n10/07/2024 09:54 Personal Statement 3/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 4,
      "content": "Kearns, Maxwell; DOB: 01/05/1998; ID: 978025776\nMax Kearns Columbia University PhD Application\nculminated in being selected as Deputy Treasurer, where I helped steer student account meetings\nand met weekly with the Associate Dean of students to allocate over $1 million to 200+ diverse\nstudent organizations. As a member of AIChE, I was elected to Business Manager my junior\nyear, and then President my senior year. In these roles, I led our team to create professional\ndevelopment opportunities for underclassman and collaborated with other engineering\norganizations to increase underclassman involvement. As a result of our successful student\nengagement, the career center presented us with the annual “Gwennie” award for exemplifying\nthe values of professional development and career education. These roles allowed me to support\nmy fellow classmates, grow as a student leader, and contribute to a vibrant engineering\ncommunity. I am excited about the opportunity to become just as involved with organizations\nlike ChEGO or the Engineering Graduate Student Council (EGSC).\nI have had an exceptional research and academic experience while earning my MS degree\nat Columbia University. My research in the lab of Dr. Allie Obermeyer inspired me to continue\nstudying in the field of chemical and biological engineering, and I hope to have the opportunity\nto join this world-class department for my doctorate degree. Columbia University has supportive\nfaculty, cutting-edge research projects, and an entrepreneurial culture that would enable me to\nachieve my long-term professional goals. I sincerely hope to contribute as a full-time PhD\nstudent in the Chemical Engineering department, and I thank you for reviewing my application.\n4\n10/07/2024 09:54 Personal Statement 4/4",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}