{
  "document_name": "Huang, Xi (993618511).pdf",
  "total_pages": 3,
  "pages": [
    {
      "page_number": 1,
      "content": "Huang, Xi; DOB: 12/28/1998; ID: 993618511\nPersonalStatement\nI have always been the biggest fan of sci-fi. It often gave me an optimistic outlook on the\nrelationship betweentechnologyandsociety.Ever sinceIstarted mycomputer sciencejourneyat\nthe University of Toronto, it seemed to me that the line between fantasy and reality had been\ngetting blurrier day by day enabled by constant breakthroughs of artificial intelligence near me.\nInspired by endless opportunities, I took the initiative and grasped ontomyfascination withthis\never-growing fieldfor myprofessional development.\nDuring my undergraduate studies, I wasfirst introducedtothe worldof AIina visualcomputing\ncourse notorious among students for its challenging mathematical concepts not suited for the\nfaint-hearted. Throughout the course, I studied and implemented numerous algorithms for\nreal-world computer vision applications that I never thought to be possible before, and this led\nme to explore advanced concepts such as machine learning. I utilized the opportunity to take\nevery AI-related course the CS department had to offer and excel in them. Most of these\nupper-level courses were cross-listed with thegraduate departmentandgaveme aglimpseof the\nlife of a graduate student long before graduate school. In my senior year,I workedas aresearch\nstudent under the supervision of Dr. Anna Goldenberg at Toronto’s Hospital for Sick Children.\nInitially funded by a grant from the Canadian government, I then continued my position as a\nresearch employee after graduation. During my two years at the hospital, I was involved in\nintegrating a machine learning model in the ICU to monitor patient status and predict\ndeterioration, such as cardiac arrest events, in order to alert staff to apply preemptive measures,\nwhich canbecritical inmoments oflife anddeath. Ibuilt data streamingpipelinesthat dealtwith\nboth live data and historical data, contributed to the usability design in the ICU, and eventually\nHuang, Xi\n10/07/2024 09:54 Personal Statement 1/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 2,
      "content": "Huang, Xi; DOB: 12/28/1998; ID: 993618511\ndelivered the tool to its clinical trial. Furthermore, I employed NLP techniques using\nTransformer models to de-identify patient information in medical records to provide data for\nfuture research. I was fortunate enough to have gained much project experience, witnessing the\nincredible synergy of combining AI with healthcare. This rather new effort not only minimized\nthe stress on paramedics but also enabled the automatic detection and analysis of patient\nconditions. While the work demanded the repetition of various experiments and occasionally\nposed challenges, the sense of fulfillment and pride was truly gratifying, as I saw impactful\nchange inthemedicalindustry.\nWhile I worked on my master’s degree in software engineering atCarnegieMellonUniversity,I\ncontinued to take ML courses and got involved with more ML research throughout my entire\ndegree. I waspartof an object recognition projectat CMUincollaboration withWalmartwhere I\nprocessed image data and trained Visual Transformer models.I amcurrentlyinvolved inanother\ncomputer vision research project under Dr. Asim Smailagic exploringaninnovative approachin\nmedical image analysis combining neural network with wavelet transformation that removes\nunnecessary detailsin theimagepreservingprivacy andreducingcomputation withoutimpacting\nperformance, and we are in progress to publishing our work. Aside from ML work in this\nproject, I was able to revisit the mathematical side of computer vision, which took me back to\nwhen I first discovered the wonders of AI algorithms. I utterlyenjoyed myresearchexperiences\nworking with differentaspects ofAI,as theyhave shownmehow much goodAIcanbring toour\ncurrent societyin aworld of dataand Iam dedicatedtocontinuingmy journeyfurtheringmyself.\nIn addition to research, I have had two years of industry experience working at State Streetas a\ncloud software engineer. I eagerly seized the opportunity to master a range of software\ndevelopment tools and refine my software-building skills. This experience has prepared me for\nHuang, Xi\n10/07/2024 09:54 Personal Statement 2/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    },
    {
      "page_number": 3,
      "content": "Huang, Xi; DOB: 12/28/1998; ID: 993618511\nmy master's studies in software engineering and helped me gain avaluableunderstanding ofthe\ntech industry. This experience has also equipped me withthebeneficial insightsofcollaborating\nwithin a team, both in person and remotely. My industry experience, coupled with pragmatic\nsoftware engineering training that I have done during my master’s degree, has shown me\npractical aspectsthatareasbeneficialas theoreticalknowledge inresearchwork.\nPerhaps with a different concept of self-worth, I am more captivated with chiseling into the\nunknown, a diversion from the common goal of my peers in my industry-oriented program of\n“making big money” straight out of graduationas asoftware engineer.Withmygrowing interest\nin using ML to improve life, I deem that the elevation of myself in research is imperative. Iam\nanxious to work with professors with overlapped interests in ML at Columbia. I have a deep\nyearning to boost my individual research ability as well as thecapacity toresolvetech problems\ninnovatively. The academic prowess here has been world-renowned and the ML research has\nbeen diverse in various areas among whichIwouldlike tolearn morein.Ilook forwardtobeing\nan active member in the CS program, and to studying and working in a vigorous community.\nAfter my PhD studies, I look forward to working as a scientist, extending mystudies intheML\nfield, and contributing to the development of AI in the realworld. Iwant todivedeeply into my\nown expertise,especiallyinhealthcareand theapplication ofnewAI technologies,and Iam very\noptimistic about my career paths after completing a PhD as a scientist. I’m confident that Iwill\nbe content ina fieldof prosperousinnovationbridging reality andsci-fi.I know thatit willbe far\nfrom a smooth ride, but I await to broaden my skill set and knowledge with pleasure, knowing\nwhat I will be trying to do is unique, inspiring more intelligent development in the areas that\nbenefitmankind’s future.\nHuang, Xi\n10/07/2024 09:54 Personal Statement 3/3",
      "metadata": {
        "width": 612,
        "height": 792
      }
    }
  ]
}