{
    "ID": "703313960",
    "SOP": "I am motivated to pursue a Ph.D. in the Computer Science Program at Columbia to fulfill my research interests. Through experiences working as a research assistant with Professor Xi He, Florian Kerschbaum, and Ian Munro, I developed my research interests in both Database Management Systems (DBMS) and Data Privacy fields. Specifically, I am interested in developing applications to help data analysts better understand, and draw inferences about sensitive data, while protecting users’ personal information. Inspired by the topics covered in an algorithm class, I reached out to Professor Ian Munro to work on the majority problem. This problem involves determining the majority color from a set of balls with two colors. The project aimed to arrive at tighter upper and lower bounds for the number of comparisons required to solve this problem under a three-way comparison model. I made a valuable contribution by formalizing an algorithm that reduced the information-theoretic upper bound by a logarithmic magnitude asymptotically. This project ignited my passion in academic research. After my first project, the bulk of my work focused on developing applications that support private data exploration. In my next project, I built an interactive system that allows data curators to specify personalized privacy guarantees and data analysts to answer queries under such privacy guarantees. I worked with Professor Xi He, for this research project, which was published at the VLDB 2021 demo track. The differential privacy definition can be extended to protect combinations of sensitive attributes. In fact, data curators might want to extend such a definition by declaring customized indistinguishability conditions. Blowfish Privacy provides a solution through a graph, using nodes and edges to represent sensitive tuples. Yet, this brought up another problem – it’s infeasible for data curators to define the graph, especially for huge datasets. For the sake of usability, I extended Blowfish Privacy such that data curators may define attribute-wise (column- wise) privacy policies. More specifically, two tuples are indistinguishable if they have similar values of some attribute. After discussing my solution with Professor He and other group members, I led the drafting of the paper, coded up a prototype that dynamically generates privacy policies according to incoming queries, and presented our work at the conference. This project shed light on the importance of extending abstract definitions to concrete use cases, and equipped me with skills in designing and building an interactive system. Following this line of research, I joined another project with Professor Florian Kerschbaum in the data privacy area. In this project, we looked at membership inference attacks where a machine learning model leaks sensitive information about its training dataset. However, the performance of those attacks under differentially private learning were far lower than the theoretical bound. As we designed and conducted several successful attacks, a paper by Google Research presented the same problem along with several attacks that overlapped with ours. However, a contemporary paper did not mean that all the work we have done was in vain; as differential private learning aims to protect users’ data against unrealistic adversaries, we started to question the necessity of applying it in the real world. Specifically, privacy concerns might not rise before the model began to overfit, or ‘memorize’ the training set. Based on this observation, we developed a framework that evaluated the tradeoff between privacy level and utility of a model after each training epoch. Hence, it became possible to determine privacy-utility tradeoffs for different sets of training parameters through a pareto front. We applied non-differential privacy defenses to models including pretraining, early stopping, and gradient clipping, and evaluated these models against those generated through differential private training. Eventually, we observed that differential private learning often resulted in suboptimal performance. This project demonstrated to me that it is crucial to consider both theory and practice in research projects. Currently, I am working with Professor Xi He again. We are developing a system that reuses cached responses to answer incoming queries differentially privately under a given accuracy requirement. I joined the project halfway, so the key structure of the system had already been determined. However, there was a potential flaw where a particular matrix might not have a full column rank to satisfy the prerequisites to apply an existing algorithm correctly. To deal with the problem, I implemented an algorithm to transform the existing matrices into a compatible full- rank form, and formalized a proof of correctness. Moreover, I implemented one of the three main modules that cleverly picked accurate cached responses to answer a new query. Additionally, I developed a prototype of a related work for evaluation against our system. Aside from my technical contributions, I also designed interactive use-cases for our system and extensively tested our implementation against these cases. This project is still ongoing, and I will be involved in extending our system to handle queries with multiple attributes. We plan to submit our work to VLDB 2022. From the four projects mentioned above, I cultivated intensive research working habits, and identified my future research interest in doctoral study. I would like to further explore data privacy and DBMS because databases are the foundation for many topics in computer science. After careful research into both schools and professors, I believe the spirit of Columbia database research group aligns the best with my research interests. In particular, I am fascinated by Professor Eugene Wu’s project on Smoke query engine in which the relationship between input and output data of a workflow is monitored to make potential inferences using declarative logic. As a result, great performance improvements are promising on interactive data visualization. In return with the great resources in the Columbia database research group, I believe my research background and experiences in building interactive data exploration systems makes me a valuable addition to the research team at Columbia.",
    "Publications": [
        "Catch a Blowfish Alive: A Demonstration of Policy-Aware Differential Privacy for Interactive Data Exploration",
        "Generalization Techniques Empirically Outperform Differential Privacy against Membership Inference",
        "Cache Me If You Can: Accuracy-Aware Inference Engine for Differentially Private Data Exploration",
        "Majority in the Three-Way Comparison Model"
    ],
    "Education": {
        "Graduate": {},
        "Undergraduate": {
            "Institution": "University Of Waterloo",
            "Degree": "Bachelor of Mathematics",
            "Major": "Computer Science/Statistics/Combinatorics & Optimization",
            "GPA": "3.8"
        }
    },
    "Faculty Members": null,
    "Recommendation Letters": {
        "1": "Nov 30, 2021 Xi He Assistant Professor Department of Computer Science University of Waterloo Web: https://cs.uwaterloo.ca/~xihe/ Email: xi.he@uwaterloo.ca To Whom It May Concern: I have had the pleasure of working with Jerry (Jiaxiang) Liu in the past two years. Jerry is a highly talented and self-driven undergraduate student in Computer Science at the University of Waterloo. He took my course CS348 on database management in Winter 2020 and received an excellent grade (top 1%) for this course. I learned that he had a great interest in research and admitted him as an undergraduate research assistant (URA) in 2020-2021. I worked with Jerry on multiple research projects related to privacy-preserving database systems. One of the works has turned into a demo paper published at the International Conference on Very Large Data Bases (VLDB), a top-tier database venue. Jerry is a self-motivated and fast learner. The first project that Jerry worked with me is on designing and developing an interactive database system for sensitive data exploration, named BlowfishDB. This project requires a good understanding of the state-of-the-art privacy notions and their corresponding algorithms. Within a month, Jerry has managed the basic concepts and algorithms. He applied a privacy notion, Blowfish privacy, on real databases, that allows a flexible trade-off space between privacy levels on the sensitive databases and the query utility. Jerry also implemented the key algorithms for such a trade- off and integrated these algorithms into a query-answering interface, together with another student. In addition, to assist the data owners to specify their desired privacy policies, Jerry created an interface for them to visualize the privacy policies and explore the trade-off. The first end-to-end prototype for this work was completed by Jerry, as a part-time URA. I was very impressed by his productivity and enthusiasm with work assigned to him. Jerry was also greatly involved in the writing of the paper for this project and the demonstration of the system at the conference (VLDB’21). This paper proposed a new privacy notion, Dynamic Blowfish, to improve the performance of the database system.Jerry contributed significantly to the formalization of this new privacy notion and the proofs for the utility and performance guarantees. Jerry needed some guides at the beginning of the analysis, but he asked very good questions when learning the proofs and was able to generalize the proofs for different use cases. Jerry also worked with one of my graduate students to prepare the demonstration video of this work at the conference. The video was well done in illustrating the motivation, the use cases, and the results of this work. Jerry played a very important role in the completion of this demo work. Jerry is currently an active research member for another of my research project. He worked with a few graduate students to develop a cache structure for answering differentially private queries. In this project, he was able to figure out quickly the bottleneck of the previous prototypes and developed useful test cases to evaluate the usability of this cache structure. Jerry can work very well with his team members. He can communicate well and play a leading role in the development of the project when coming to his assigned part. This work is in preparation for submission. I think all this research experience has well prepared Jerry for graduate school. Overall, Jerry is definitely a top undergraduate student I have met at the University of Waterloo, with strong technical skills and great research potential. Hence, I strongly recommend Jerry for your graduate program. Sincerely, Xi He",
        "2": "1 December 2021 To whom it may concern: I am writing this letter in very strong support of Jiaxiang (Jerry) Liu’s application for your graduate program. I am an Associate Professor in the University of Waterloo’s School of Computer Science, NSERC/RBC chair in Data Security, and an ACM Distinguished Scientist. I know Jerry as my undergrad research assistant (URA, full-time) in the Winter 2021 term. URAs work on aspects of a research problem, in my group usually as a part of a larger team. I am very selective in choosing URAs and only accept students whose grades are in the top 5% of undergrad students. Jerry was working on our project on evaluating differential private stochastic gradient descent as a defense for membership inference attacks on deep neural networks co-supervised by postdoc Simon Oya. We are currently preparing a submission to the PETS conference, with Jerry as the first author. This project was very intensive on implementation and experimentation and the crucial aspect was to use a proper method such that the experimental results are sound, replicable and generalize to other settings. Jerry was responsible for the implementation using different machine learning techniques (regularization, etc.) and then executing and documenting the experiments such that we could draw reliable conclusions. This work requires very high attention to detail since even small mistakes can distort the results significantly. With the help of Simon, Jerry produced very good results that we are summarizing in the publication. Jerry is very inquisitive and always suggested new research directions, such as using SAM regularization which is one of the main conclusions of the work. During the entire process which required several iterations and included several setbacks (including initial work for which we were beaten to publication), Jerry remained motivated and dedicated to the result. I would assess that Jerry is among the top 1% of Waterloo’s computer science undergrad students motivated for grad school. He also has the necessary skills and talent to succeed which he has shown during our collaboration. Jerry is a very nice person to work with. He is always in a good mood and keen to explain his results. He has indicated to me that he wants his graduate studies to focus on machine learning. Jerry certainly has knowledge and skills in this topic that exceed the education in the classroom. My research rather focuses on securing machine learning as in Jerry’s URA project, but I would have gladly accepted to supervise him. I have no doubt that Jerry will do well in your graduate program. I highly recommend him without any reservation. Should you have any questions, please do not hesitate to contact me. Sincerely, Florian Kerschbaum Associate Professor of Computer Science, NSERC/RBC Chair in Data Security"
    },
    "Research Areas": [
        "Databases and Data Management",
        "Security and Privacy"
    ]
}